[["Snoop", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Owning dogs or cats keep us active and give us a way to take care and connect.</p>\n<p>Research has shown that owning a dog can help combat loneliness with senior citizens.</p>\n<p>Taking the dog for walks, feeding it, not only keeps one active but gives a sense of purpose and comeradery.</p>\n<p>However, elderly living by themselves often are in doubt whether they are still able to take care of a dog.</p>\n<h2>What it does</h2>\n<p>Our dog collar has a speaker built-in that gives tips and reminders about taking care of the dog. </p>\n<p>The collar senses whether the dog moves, if it eats, and barks, and where it is.</p>\n<p>Based on the dog's behavior the collar gives suggestions like taking walks, meals, games to play.</p>\n<p>It connects wirelessly to our cloud platform which stores the dog data and creates suggestions. </p>\n<h2>How I built it</h2>\n<p>We built a mockup out of 3D printed shells, a bluetooth speaker, microphone, connect to a smartphone using bluetooth. In this way we simulate how it feels to get voice suggestions from the collar.</p>\n<h2>Challenges I ran into</h2>\n<ul>\n<li>elderly people we interviewed did not agree with our original idea, to have a panic button and a video camera on the dog. They found that elderly dog owners are able enough to carry a smartphone in case there is a panic. </li>\n</ul>\n<h2>Accomplishments that I'm proud of</h2>\n<ul>\n<li>Designed and 3d printed nice fitting shell for the electronics.</li>\n<li>Successfully pivoted to a new idea halfway the hackaton based on talks with elderly </li>\n</ul>\n<h2>What I learned</h2>\n<ul>\n<li>Met nice and talented people</li>\n</ul>\n<h2>What's next for Snoop</h2>\n<ul>\n<li>To compete in the market we have to reach EUR 99 - EUR 129 sales price so we have to check volume manufacturing prices </li>\n<li>Build a smaller prototype and test in live situation with elderly and dogs.</li>\n<li>Create a baseline If-this-then-that algorithm based on hour of the day, feeding schedule and amount of dog steps.</li>\n</ul>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag\">3d-printed-mockup</span></li><li><span class=\"cp-tag\">bluetooth-speaker</span></li><li><span class=\"cp-tag\">microphone</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/siri\">siri</a></span></li></ul>\n</div>\n</div>", ["Solid modeling and prototyping", "", "", ""]], ["AgeActive", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"AgeActive – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/447/758/datas/gallery.jpg\"/>\n<p>\n<i>Flowchart of our platform</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>What is elderly independence and how is it connected to loneliness? \nIt is estimated that in 2040 there will be 4.7 million elderly in Holland. This will be more than one fourth of the total population. Our solution is creating an elderly-friendly social platform to improve our healthcare system. Thereby empowering elderly and giving them back their self-confidence and purpose in society. This system will hopefully encourage elderly to create communities and inspire each other to go on new adventures through our elderly focused platform.</p>\n<p>Research has shown that elderly who retire on a later age maintain their independence longer by staying mentally and physically active. Furthermore retired elderly will usually lose social interaction and thus their drive to stay active which gradually worsens their overall health.</p>\n<p>By connecting them with less independent elderly they are able to exchange their own needs and help each other to create a sense of purpose on both sides. This will hopefully create new friendships which drives them to be more physically, mentally and socially active in life. </p>\n<p>To incentivize people to provide healthcare on our platform they can work towards their own healthcare by donating their time to others. For example, lets say someone is helping out for 10 hours each week. These 10 hours will be verified and credited to the person helping out. By the time they are in need of healthcare, they can request and exchange it within our platform. This will hopefully motivate people to donate their time because eventually they will get it back when they need it. </p>\n<p>Explanatory cartoon:\n<a href=\"https://www.powtoon.com/online-presentation/dBfmh2KaIYQ/?mode=movie\" rel=\"nofollow\">https://www.powtoon.com/online-presentation/dBfmh2KaIYQ/?mode=movie</a></p>\n<p>Mock-up app concept:\n<a href=\"https://pr.to/RC5YEY/\" rel=\"nofollow\">https://pr.to/RC5YEY/</a></p>\n<p>See the flowchart of our platform in the attachments for further information.\nThank you for reading!</p>\n<p>Lin Mang Liu, Chee Wai Liu, Vincent Repko</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ios\">ios</a></span></li></ul>\n</div>\n</div>", [""]], ["HealthCloud", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"HealthCloud – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/447/799/datas/gallery.jpg\"/>\n<p>\n<i>Website home</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"HealthCloud – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/449/291/datas/gallery.jpg\"/>\n<p>\n<i>Blockchain</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"HealthCloud – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/449/292/datas/gallery.jpg\"/>\n<p>\n<i>Technical</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"HealthCloud – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/449/293/datas/gallery.jpg\"/>\n<p>\n<i>Logo</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"HealthCloud – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/449/294/datas/gallery.jpg\"/>\n<p>\n<i>Website login</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"HealthCloud – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/449/295/datas/gallery.jpg\"/>\n<p>\n<i>Website personal page</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Help contribute to healthy aging in an infective and innovative way by using a cloud platform and blockchain.</p>\n<h2>What it does</h2>\n<p>HealthCloud, being a Quantified Self Database, will function as an umbrella Portal for all IoT device enabling platforms. Data information coming from Clouds such as Fitbit and Apple I-health will be managed and encrypted for distribution through Blockchain to physicians and other parties that has been granted access to the information. </p>\n<h2>How we built it</h2>\n<p>Magic and love!</p>\n<h2>Challenges we ran into</h2>\n<p>Not enough programmers. </p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We finalized an idea while working as a thight team.</p>\n<h2>What we learned</h2>\n<p>We did not win the first price but we won something far greater than that! By the end of the Hackathon a group walked up towards us and started talking. One of their members priced us. She said:\"I have not seen a team working so well together. Your team had such a harmonious way of working with one and another. Knowing individually exactly what to do while having fun together.\"\nWe take that compliment with us, as we felt the exact same thing.</p>\n<h2>What's next for HealthCloud</h2>\n<p>As for the project, it isn't over for us just yet! With the approach to the right people, we believe that HealthCloud could be a success!</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/scss\">scss</a></span></li><li><span class=\"cp-tag\">gulp</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/blockchain\">blockchain</a></span></li><li><span class=\"cp-tag\">iot</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://invis.io/SP9EROWRZ\" rel=\"nofollow\" target=\"_blank\" title=\"https://invis.io/SP9EROWRZ\">\n<i class=\"ss-icon ss-link\"></i>\n<span>invis.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Programmer, - contributed the technical side to the end solution", "I've done all the graphic design and focussed the brainstorm towards the over-all solution. ", "I worked in the front end and brainstorm section"]], ["Trees", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Trees – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/447/767/datas/gallery.jpg\"/>\n<p>\n<i>Get narrative</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>More elderly live at home with mild cognitive impairment, which causes severe loss of quality of life and grows fears over self-empowerment.</p>\n<h2>What it does</h2>\n<p>Cognitive memory support: helps finding lost objects at home.</p>\n<h2>How we built it</h2>\n<p>Create a natural language processing system using Watson Conversation which creates a search query for an object. The search query then runs through Python Backend which sends the query through Google Cloud. Google Cloud searches for the object in our image database. The image database is created and constantly updated through ambiant cameras. It sends the image of the object in its surrounding back to the user.</p>\n<h2>Challenges we ran into</h2>\n<p>User interface decisions, speech output difficulties, localization of the object, sensor use for need recognisition.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Full natural language processing functionality, incorporated image recognition, user centered solution</p>\n<h2>What we learned</h2>\n<p>Interdisciplinary teamwork, to connect different toolboxes in one product and interface, to design a solution with a multi purpose potential</p>\n<h2>What's next for Trees</h2>\n<p>Sensor use for need recognisition, voice command optimization, broaden object database and recognition, accurate geo localization, emergency warning system</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ibm-watson\">ibm-watson</a></span></li><li><span class=\"cp-tag\">google-cloud-vision</span></li></ul>\n</div>\n</div>", ["I have tried out both the Watson vision api and the Google Could Vision api, (eventually implemented Google Could), created the interface between front-end and back-end, added Text to Speech.", "", ""]], ["Pepper as a connecting portal", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/0ql0tB-1lqA?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"Pepper as a connecting portal – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/447/801/datas/gallery.jpg\"/>\n<p>\n<i>Brain storming</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Nowadays, many elderly people live in loneliness. They might feel reluctant to call for help from family members living or working far away, fearing that they might become a burden. The neighbourhood provide chances of social life and interaction for them.</p>\n<p>Besides, many have difficulty with daily routines in their own house. Alzheimer patients often forget concepts and past activities they take during the day. The problem is not only a nuisance but also hampers their confidence, making them dependent and therefore even more lonely.</p>\n<h2>What it does</h2>\n<p>Our solution help an elderly person with both aforementioned problem. In one hand, Pepper works as a friend and personal assistant that is always present in the house. It can help alleviate forgetfulness. For example, when the user forgets a word, he or she can describe the object they are trying to recall and Pepper will guess the word for it. Another use case is when the user forget whether he or she have taken medicine/breakfast/exercise, Pepper can work as a talking diary.</p>\n<p>On the other hand, Pepper is connected to sensors in the house and wearable watches to detect the emotion of user. It can then react to sadness, boredom or other negative feelings of the user by playing with the person, suggesting activities or connecting he or she with relatives or neighbours.</p>\n<h2>How we built it</h2>\n<p>We make use of FollowFlow infrastructure and Pepper robot. The intelligence of the robot is program with Choregraphe and Python scripts.</p>\n<h2>Challenges we ran into</h2>\n<p>Complexity is a big problem. The rules that a Pepper robot can handle is limited and we need to push to its limit to handle as much use cases as possible.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We manage to instruct Pepper to have a meaningful and, more importantly, helpful conversation with users.</p>\n<h2>What we learned</h2>\n<p>We learn Choregrahpe for the first time here. It was also our first encounter with Pepper.</p>\n<h2>What's next for Pepper as a connecting portal</h2>\n<p>There are many opportunities such as trying machine learning, animate the robot more.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag\">choregraphe</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/minhlab/pepper\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/minhlab/pepper\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["Dementia Awareness Experience", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Dementia Awareness Experience – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/447/791/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration:</h2>\n<p>From the elderly that were still quite fit, and from other talks, we extracted the thought that most people ‘can manage’ while being fit, but that there’s a lot of resistance (and denial) when it comes to becoming less fit. When a doctor finally declares somebody to be ‘sick’, it hits like a verdict and only then people start thinking about ‘what now’?</p>\n<h2>What it does</h2>\n<p>Create an awareness program for future caretakers using a smartphone and a cardboard or similair lowcost device.\nGoal: We want to make future caretakers recognise problems and symptoms of future dementia patients in a very early stage of their disease, ie when the elderly is still quite active and fit. We do this by letting them experience what it means to experience symptoms of dementia themselves in an immersive VR environment.</p>\n<p>Because: The experience urges future caretakers to become more informed and prepared, and to avoid common pitfalls that will make communications with elderly easier and provide elderly with a better quality of life.\nFor example, conversations about yesterday will create anxiety with the elderly (because the elderly has forgotten about it), and talking about last year will not. \nBeing prepared before the doctor has spoken his/her final verdict makes it possible to have the elderly get used to equipment before he/she really needs it. This will make adaptation of equipment easier.</p>\n<p>An example of a expierence is putting keys on the table, turn around, only to find out that the keys are gone and are lying in the closet. At this point, we can measure the emotional state in the VR room using FollowFlow heartbeat measurements and showing people that they indeed are in a ‘confused state of mind’.\nAnother example is that after turning on the radio, photos appear again on the wall.</p>\n<h2>How I built it</h2>\n<p>We discussed the concept, and created an immersive 3D VR demo using Unity and a presentation explaining the idea.\nWe’d like to expand the number of different experiences in the VR room.</p>\n<h2>Challenges I ran into</h2>\n<p>It’s hard to find out or imagine what an elderly with dementia really experiences. We also tried to connect the FollowFlow measurement and display it in the VR room but it was hard to integrate the measurements in time.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We’ve shifted the focus from the elderly to the (future) caretakers, yet still try to provide a better life for the elderly themselves. This is quite a change in the thought process.</p>\n<h2>What I learned</h2>\n<p>We are shocked about the impact the elderly population will have in the near future and the problems that need to be solved. In a sense, we became aware.</p>\n<h2>What's next for Dementia Awareness Experience</h2>\n<p>Because the size of the audience is well about 1 million people in the Netherlands alone, we’ve tried to provide an experience that’s available to almost everybody who can use a smart phone. \nWe need to extend the VR experience and really reach all those people out there.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li></ul>\n</div>\n</div>", ["Contribute to initial concept phase;\nWorked on VR prototype;\nCode the functionality;\n", ""]], ["CareTeam", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"CareTeam – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/447/787/datas/gallery.jpg\"/>\n<p>\n<i>CareBot UI prototype</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>We were inspired by an elderly persona who shows early signs of Alzheimer's. Our goal was to build a prototype of an application that is able to interact socially with people. By detection of interest and moods the application will offer positive feedback that will bring the person in a better mood and is able to assist in reminiscence therapy, for example.</p>\n<h2>What it does</h2>\n<p>The application autolearns about mood and interests by offering various resources, audio, images, video, and registering the cognitive reaction (like/dislike) as well as physiological reactions through the use of wearables.\nThis data is stored in a database and can be used in therapeutic sessions with caretakes but - as importantly - also at home as an entertaining way to interact with the application as an autonomous system or in a session with both the application and caretakers. </p>\n<h2>How we built it</h2>\n<p>The system is build by Java and is running on a Tomcat application server. The prototype uses only images to detect interest (cognitive reactions) and one FollowFlow wearable as a physiological mood detector. In order to learn from the reactions of the user, we use IBM Bluemix to classify the images into positive, neutral and negative categories.\nCategories together with cognitive and physiological reactions are stored in an in-memory database and can be used in future sessions for example to cheer people up (show pictures they really like..) of in reminiscence therapy (showing pictures that stimulate the mind and memory of the elderly).</p>\n<h2>Challenges we ran into</h2>\n<p>The use of IBM Bluemix was new and finding a programming language that permitted us easy access proved to be a challenge. Also interfacing the FollowFlow watch to read out both the raw heart data, as well as the interpreted mood data by a third parties API, was time-consuming.  </p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Having a working prototype that shows all aspects of our proposal.</p>\n<h2>What we learned</h2>\n<p>Again we learned about the huge challenge society faces with people getting more and more older. There is great need for technological support with the changing demographics and the costs involved. \nTechnically we learned how to work with the IBM Bluemix API's. </p>\n<h2>What's next for CareTeam</h2>\n<ul>\n<li>Adding an CareTaker section to upload specific resources to the personal workspace of the elderly user.</li>\n<li>More research on the correlation between congitive and physiologic response to the resources shown.</li>\n<li>Prepare the application for use on a low-costs mobile robot platform (such as Tiger or a Turtle-bot based platform) to add functionality to existing care-taking platforms.</li>\n</ul>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ibm-watson\">ibm-watson</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/acekrystal/cordova-plugin-bluetoothle\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/acekrystal/cordova-plugin-bluetoothle\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I joined Eric later in the weekend. I worked at connecting a PulseOn bluetooth watch to a mobile app, uploading measurements to the FollowFlow API and forwarding the results to the CateBot UI prototype. At the presentation there was a working demo showing live FollowFlow results at the CateBot UI. This could be saved to relate your subconscious feelings. (If FollowFlow is accurate)", ""]], ["CURA", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/LnMZ2yBq9lw?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"CURA – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/447/481/datas/gallery.jpg\"/>\n<p>\n<i>CURA - Companion aUtonomous Robotic Assistant</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>The world population is ageing, <strong>and fast</strong>. As people live longer, some diseases that would not be significative in the past are becoming a <strong>public health problem</strong>. In 2030, Europe will have around <strong>14 million of people suffering with dementia</strong>. Only the costs with dementia will rise <strong>up to 250 billion Euros</strong>.</p>\n<p>With this is mind; we propose a new approach for the prevention and treatment of a vast group of brain diseases. Mixing the use of the social robot Pepper together with cutting edge Machine Learning from IBM Watson, Microsoft Cognitive Services and classical, well-understood, psychological tests, we aim to help to prevent, diagnose and also to improve the quality of life. Our system will be available 24/7, fulfilling a whole of carer and, why not, friend.</p>\n<h2>What it does and How we built it</h2>\n<p><a href=\"https://www.ald.softbankrobotics.com/en/cool-robots/pepper\" rel=\"nofollow\">Pepper</a> is our interface with the world. Its humanoid appearance helps to break the barrier between human and machines, without suffering from the uncanny valley problem. Cloud computer, delivered by <a href=\"http://www.ibm.com/watson/\" rel=\"nofollow\">IBM Watson</a>, is applied to deliver a robust, reliable speech based interface. <a href=\"http://www.microsoft.com/cognitive-services\" rel=\"nofollow\">Microsoft Cognitive Systems</a> help Pepper to better understand people feelings analysing faces. As an initial test, we implemented the well known <a href=\"https://en.wikipedia.org/wiki/Wisconsin_Card_Sorting_Test\" rel=\"nofollow\">Wisconsin Card Sorting Test</a> in order to help with an earlier diagnostics of <a href=\"http://www.alz.org/alzheimers_disease_what_is_alzheimers.asp\" rel=\"nofollow\">Alzheimers</a> where the user interacts with the robot through voice commands while his/her feelings are also analysed. At the end of the session, our system is able to generate a full report that can be sent directly to medical doctors, hospitals and carers. Also, since we have access to the patient's exteriorised emotions, the robot could be able to better deal with several common day-by-day situations, fighting back depression, loneliness and helping with simple tasks as remembering to take the medicines.</p>\n<h2>Challenges we ran into</h2>\n<p>The integration between several different systems as Pepper, IBM Watson and MS Cognitive Systems was our biggest challenge. All those systems are something still new, and there're not a vast documentation available demanding from us in-house development of interfaces. The main interface for the game is totally customisable and utilises the power of OpenCV to generate the transitions in a fast and reliable way.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Most of the systems were totally new to us and, with only 48h, we were able to break through bugs, lack of sleep and still deliver a demonstration prepared to interact with the real world.</p>\n<h2>What we learned</h2>\n<p>The hackathon, actually, is not much different from the day-by-day of a busy company. Therefore, we believe this experience will be transferred to our professional lives and help us to excel in a challenging environment.</p>\n<h2>What's next for CURA - Companion aUtonomous Robotic Assistant</h2>\n<p>Our next step is to expand the system, deploy an app for Pepper and start planning experiments with human beings to test our hypothesis.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag\">pepper</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ibm-watson\">ibm-watson</a></span></li><li><span class=\"cp-tag\">mscognitiveservices</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/opencv\">opencv</a></span></li><li><span class=\"cp-tag\">wisconsin-card-sorting-test</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/mpatacchiola/cura/tree/stable\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/mpatacchiola/cura/tree/stable\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["Frustybot", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/lujYHeVDm9M?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"Frustybot – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/447/332/datas/gallery.jpg\"/>\n<p>\n<i>Frustybot!!</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Frustybot – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/447/333/datas/gallery.jpg\"/>\n<p>\n<i>Hardware finished</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Frustybot – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/447/334/datas/gallery.jpg\"/>\n<p>\n<i>Helpdesk</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Frustybot – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/447/723/datas/gallery.jpg\"/>\n<p>\n<i>3D Modelling</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Elderly always have to be \"social\" and \"acceptable\". And robots should be \"helping\" and \"taking care\". </p>\n<p>In practice robots are worthless and introduce just another potential technical hurdle that separates elderly from the rest of the world.</p>\n<p>Technology sucks!</p>\n<p>That's why we created the Frustybot</p>\n<h2>What it does</h2>\n<p>The Frustybot can be punched in the ugly face. It has the shape of a ball and technology inside that tells an elderly person to hit harder, tells jokes, and tries to be a smart-ass.</p>\n<p>With hitting it we hope that elderly can get rid of all their frustrations about technology.</p>\n<p>If people hit it often enough a helpdesk is called. </p>\n<h2>How we built it</h2>\n<p>A lot of sewing. A lot of Javascript in the browser in combination with HTML5. We integrate the mobile phone within the robot. The punches we register by reading out the accelerometer data in the browser.</p>\n<p>Thinking of things to say was super fun!</p>\n<h2>Challenges we ran into</h2>\n<p>Automatically starting a skype conversation is not possible on mobile. We hence had to change tactics and use WebRTC. The latter always sucks but in the end we found a way in which it is automatically opening up the microphone (use httpS) on a particular type of Android device.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We have something to punch!!!!</p>\n<h2>What we learned</h2>\n<p>For example, we've set up the entire system for node-red, bluemix, speech synthesis, etc. However, after that we found out that speech synthesis is possible with a few lines of Javascript. Morever, speech recognition is even baked in in HTML5, see the <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Web_Speech_API\" rel=\"nofollow\">dev site at Mozilla</a>!</p>\n<h2>What's next for Frustybot</h2>\n<p>We hope that a lot of frusty bots will become available to elderly where they're also allowed to be human, grumpy at times, scared of technology, frustrated, and in general in which it is okay to be uncertain about things in the modern world.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/webrtc\">webrtc</a></span></li><li><span class=\"cp-tag\">needles</span></li><li><span class=\"cp-tag\">freecad</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/vim\">vim</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/mrquincle/frustybot\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/mrquincle/frustybot\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"https://goo.gl/WLKGV1\" rel=\"nofollow\" target=\"_blank\" title=\"https://goo.gl/WLKGV1\">\n<i class=\"ss-icon ss-link\"></i>\n<span>goo.gl</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on the base concept and refining details of the bot. T' was a merry old time", "I've not much time for coding anymore, so it was fun to see how fast I could do things with javascript.", "I worked on the HTML5 code", "I designed its ugly face and  sewed the fluffy monster.", "I was part of the ideation and heavily opposed the concept of frustybot ;)"]]]