[["Look Out", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/SyZR6YoAdHY?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"Look Out – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/418/datas/gallery.jpg\"/>\n<p>\n<i>An example of a contextual message which will appear on the boarding of traveler visiting Brazil.</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h1>Lookout</h1>\n<h3>Inform, prevent, protect</h3>\n<h6><a href=\"https://youtu.be/SyZR6YoAdHY\" rel=\"nofollow\">Elevator Pitch</a></h6>\n<h6><a href=\"https://www.youtube.com/watch?v=AHzhqKjZgRo\" rel=\"nofollow\">Generator Demo</a></h6>\n<h3>Lookout in a nutshell</h3>\n<p>Inspired by the Caveat Emptor Tourism problem statement, our solution is called Lookout. It’s a digital ecosystem serving relevant contextual messages and content to educate tourists about illegal wildlife products relevant to their travel destination. The messages and content are distributed wherever the end user is and we focus in particular on embedding impactful messages right into the travellers' flight booking journey.</p>\n<h3>What it does</h3>\n<p>We aim to form partnerships with governments, the International Air Transport Association but also major airlines, airports and online travel aggregators around the world in order to place contextual messages at key touch points, such as booking confirmation, visa application forms, boarding passes etc. These will use eye-catching messages and visuals, relevant to the traveller's destinations.</p>\n<p>To do so, we will use a content generator in the form of a web app in order to generate content and messages that we then distribute to the end user at key touch points of the flight booking journey and relevant to their respective travel destination. At the same time our content generator serves as a secondary web page allowing travellers to find out more information about specific wildlife products and endangered wildlife from the country of destination. </p>\n<h3>The development of our concept</h3>\n<p>Our team utilised our surroundings at the ZSL London Zoo to gather critical insight from the actual end user: ‘The Internal Traveller’. We sent out a small research team to ask zoo visitors whether they would engage and download a mobile app providing information about critically endangered wildlife. </p>\n<p>Whilst many confirmed they definitely wanted more information about products made from illegal and endangered wildlife, a staggering 86% said that they would not take the time to download a mobile app; taking into consideration that we interviewed Zoo visitors who are highly engaged with wildlife. </p>\n<p>The critical insights we gathered and on which we based our solution are:</p>\n<ol>\n<li>Target travellers where they are and keep it effortless for them to consume the information.<br/></li>\n<li>Target them with messages featuring products from endangered animals that look like something they would normally want to buy as opposed to featuring endangered wildlife.</li>\n</ol>\n<p>We came to the conclusion that we had to develop a user-centric solution. </p>\n<p>This drove us to create a content generator to power a digital ecosystem delivering eye-catching messages and visuals at relevant and mandatory touch points of the flight booking journey of the traveller; we believe that it is the only moment of the entire holiday where we can catch the traveller’s attention. Upon arrival at the holiday destination, it will already be too late. </p>\n<p>To identify the critical and mandatory touch points, we mapped out the entire user journey of a flight booking, step-by-step, in the form of a flow diagram. We could then identify the key non-avoidable touch points in which to feature our high-impact messages relevant to the booked flight destination e.g. flight booking confirmation emails, visa request forms, boarding passes and in-flight entertainment etc. </p>\n<p>We ultimately want this initiative to be implemented globally. This is a permanent upgrade to the official messages that airlines, airports and online travel aggregators need to feature on official communications such as confirmation emails, boarding passes etc. We want those wildlife messages to stand next to security and safety messages. </p>\n<p>We believe that official bodies such as governments and private airline companies have a vested interest in reducing wildlife trafficking, therefore redesigning elements of their official communications will benefit both us, and them.</p>\n<p>Our initiative would not rely on media funding and would therefore be a permanent upgrade rather than a short form ad campaign. </p>\n<p>We could however pilot the project on a very small scale with one airline over a short period of time and gradually increase the scale if it becomes successful. </p>\n<h3>How we built the Content Generator</h3>\n<p>To obtain an accurate dataset for what a tourist might bring back in their luggage from their travels, we collected data from the LEMIS dataset available on <a href=\"http://wildlifetradetracker.org/\" rel=\"nofollow\">wildlifetradetracker.org</a>. After selecting the relevant data, we created a dataset containing, for a given country, the most frequently seized wildlife and wildlife products. </p>\n<p>We then used Google Custom search (both for wildlife and wildlife related products) to obtain relevant images. We gathered the conservation status for each species from Wikipedia. This proved sufficient to determine what travellers are most likely to come across at the country of destination. In addition, we built a simple front-end page for our content generator in the form of a non downloadable web application to quickly serve to the users with content regardless of the device used to access it. In order to educate our visitors and not overwhelm them, we followed the golden rule that ‘less is more’ by keeping a very simple interface with the most trafficked species and the most popular products from those particular species. </p>\n<h3>Ways we reach people</h3>\n<p>We will leverage existing critical and non-avoidable touch points such as boarding passes, email confirmations, visa application forms etc. to reach out to our target audience. The power of this will be that we can use multiple touch points at different moments of the flight-booking journey to ensure that the International Traveller gets hit at least once, if not more frequently with contextually relevant messages and visuals. We would also feature different messages and content at different touch points further on to grab the traveller's attention.</p>\n<p>In addition we would curate a community using social media networks such as Facebook, which we would use to generate incremental ‘word-of-mouth’ about trafficked wildlife. (Within the first 24 hours, we achieved more than 150 likes on the <a href=\"https://www.facebook.com/looking0ut\" rel=\"nofollow\">Facebook page</a>). </p>\n<h3>Impact</h3>\n<p>Through partnerships with official bodies such as governments, IATA, embassies, major airline companies and travel aggregators, we aim for mass reach, with millions of international travellers exposed.\nThrough the use of contextually targeted messages that are relevant to the travel destination, we will ensure that we catch people’s attention by serving dramatic facts and getting them to think about the consequences of their simple acts of purchase.</p>\n<p>We will decrease the demand for products made from illegally trafficked wildlife, to the level where it becomes financially unrewarding. When this is achieved, the hunting of endangered species across the world will itself become extinct.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/scala\">scala</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/react\">react</a></span></li><li><span class=\"cp-tag\">saas</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bash\">bash</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://www.facebook.com/looking0ut/\" rel=\"nofollow\" target=\"_blank\" title=\"https://www.facebook.com/looking0ut/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>www.facebook.com</span>\n</a></li>\n<li><a href=\"https://github.com/katebee/look-out-app\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/katebee/look-out-app\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"https://drive.google.com/file/d/0Bx-dgD8EhtEtel9nT1FDQzJ6WXc/view?usp=sharing\" rel=\"nofollow\" target=\"_blank\" title=\"https://drive.google.com/file/d/0Bx-dgD8EhtEtel9nT1FDQzJ6WXc/view?usp=sharing\">\n<i class=\"ss-icon ss-link\"></i>\n<span>drive.google.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["data munging, image acquisiting, with some fronted polishing", "", "", "", "", "", "", "", "", ""]], ["Start spreading the Sumatran tigers news < 300 left", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>When I saw the new sumatran tiger newborn twins at London zoo and I found out the species was on the red list I just had to try and work out a way to alert people and get them to help. The zsl video was so adorable I thought it was a great place to start. I thought using this as the background to movies starring tiger conservationists, cat loves in fact any one with a heart would want to generate personalised content which would generate new ways to market the plight and new ways to appeal for help. </p>\n<h2>What it does</h2>\n<p>I use the xbox 360 'you're in the movies' pack to film customers with a green screen background and then merges the sumatran cubs video creating an adorable movie with a headlining message! You appear to be wrestling with the Sumatran tiger cubs in London Zoo. The movie joins a zoo library and people can browse and indicate that they like the submissions forming a legueue table. The movie will be sold for your further distribution. The zoo will promote the service online and in the zoo and people will want to document their concerns in this personal way that encourages a larger hit rates and so, in turn, further advertises their own star appeal. This app will help grow endangered species awareness but also  it's just great family and friend  fun!you are starring in their top video content.  </p>\n<h2>How we built it</h2>\n<p>The phone app will vet the movie submission to verify the criteria of the scripted movie template. The submission will be used by the 'you're in the movies' studio to generate the movie. This movie will be delivered to the customer on payment. I will be entered into the frank Sumatran memorial competition where it will be displayed in a repository of zoo movies with the director and actors details preserved </p>\n<h2>Challenges we ran into</h2>\n<p>The xbox live membership didn't come from ebay - it was a cyber criminal's add so I cant use the movie studio for the demonstration. The generation of a movie script to fit with the existing tiger cub video is harder than generating both together.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Promoting the sumatran tiger's plight and trying to stop them from becoming extinct because it is simply unimaginable</p>\n<h2>What we learned</h2>\n<p>We think that the personal touch will work. People love a familiar face so will enjoy watching the video and are more likely to react to messages from friends and family than to faceless companies or governments instructions.</p>\n<h2>What's next for start spreading the news &gt; 500 Sumatran tigers left</h2>\n<p>We would like to make it so easy to operate from any place. We would like to provide a selection of green screens and scripts from other endangered species i.e. the pangolins </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag\">xbox-360-you're-in-the-movies</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li></ul>\n</div>\n</div>", [""]], ["Don't eat that", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Don't eat that – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/422/820/datas/gallery.jpg\"/>\n<p>\n<i>Welcome message</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Don't eat that – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/422/790/datas/gallery.jpg\"/>\n<p>\n<i>Find out location and first options</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Don't eat that – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/422/791/datas/gallery.jpg\"/>\n<p>\n<i>Selecting you're at a restaurant</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Don't eat that – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/422/792/datas/gallery.jpg\"/>\n<p>\n<i>The thing you're eating has meat</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Don't eat that – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/422/795/datas/gallery.jpg\"/>\n<p>\n<i>Issue warning after choosing \"crisscrossed pattern\"</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Don't eat that – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/422/794/datas/gallery.jpg\"/>\n<p>\n<i>Window after you just write \"ivory\", asking for information</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Don't eat that – screenshot 7\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/422/793/datas/gallery.jpg\"/>\n<p>\n<i>\"Report it!\" options</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Not everyone has a conservationist friend to help them when they are on holidays, and those friends also need to sleep. We thought there was a need for getting information about illegal wildlife products for tourists in an easy way. With no need to install new apps.</p>\n<h2>What it does</h2>\n<p>We've created a Facebook bot that tries to help you to find out whether what you are about to consume is an illegal wildlife product and gives you additional information and an option to report it.</p>\n<h2>How we built it</h2>\n<p>With love, wildlife information in order to create the different possible answer flows and chatFuel to create the Facebook bot.</p>\n<h2>Challenges we ran into</h2>\n<p>Lack of time and resources to feed more information into the bot. With more knowledgeable people in different kinds of products, the bot could've been much more intelligent.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We built an easy and practical tool that can be used by everybody and you don't need to download any extra app as it works with Facebook as a normal conversation.</p>\n<h2>What we learned</h2>\n<p>How easy it is to find illegal products in some markets.</p>\n<h2>What's next for Don't eat that</h2>\n<p>Scaling and more possible integrations with wild live databases.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag\">chatfuel</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://www.facebook.com/YourConservationistFriend/\" rel=\"nofollow\" target=\"_blank\" title=\"https://www.facebook.com/YourConservationistFriend/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>www.facebook.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", "", ""]], ["WildFace", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/YfzCxeYQdRc?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"WildFace – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/425/066/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"WildFace – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/425/067/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"WildFace – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/425/069/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>WildFace</h2>\n<p><strong>Discretely report wildlife trafficking incidents using your Android Wear or Apple Watch</strong></p>\n<p>The reporting tool consists of a backend written in Python and Django,  frontend smartwatch applications written for Android Wear and Apple Watch.</p>\n<p><strong>Backend</strong><br/>\n  Django:</p>\n<ul>\n<li>Consists of a database with interactive map.<br/></li>\n<li>Has admin only access to view the interactive map.<br/></li>\n<li>Can limit access to certain admin. </li>\n</ul>\n<p><strong>Frontend:</strong><br/>\n  Android Wear:</p>\n<ul>\n<li>With a button on a watch face, sends the geolocation and can pick the reporting issue within an editable lists. The Android Wears sends the bluetooth information to the Android phone, then sends it to the database.</li>\n</ul>\n<p>Apple Watch:</p>\n<ul>\n<li>With a button on a watch face, sends the geolocation and can pick the reporting issue within an editable lists. The Apple Watch sends the bluetooth information to the Apple Watch, then sends it to the database.</li>\n</ul>\n<p><strong>Powerpoint link:</strong> <a href=\"https://docs.google.com/presentation/d/10XvsrsqfPvwa6KuWGZi35GybGh1JeAqzcKrcmomVO28/edit?usp=sharing\" rel=\"nofollow\">https://docs.google.com/presentation/d/10XvsrsqfPvwa6KuWGZi35GybGh1JeAqzcKrcmomVO28/edit?usp=sharing</a></p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/django\">django</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/gmuthetatau/zoohackathon2016\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/gmuthetatau/zoohackathon2016\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["PoPo Pango", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/1pyePN4K3e0?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"PoPo Pango – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/423/716/datas/gallery.jpg\"/>\n<p>\n<i>Facebook chatbot</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"PoPo Pango – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/423/717/datas/gallery.jpg\"/>\n<p>\n<i>SMS chatbot</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Introduction</h2>\n<p>Data about wildlife trafficking is hard to come by. Information about marketplaces where wildlife and its products are traded lie mostly within the local population. However, access to this data is valuable to study local markets, their demand and spread. Also, they serve as leads for law enforcement to trace the products back to the suppliers and poachers. There have been efforts to use technology to help report trafficking like Wildlife Witness. My goal is to build a platform for crowdsourced reporting using chatbots to complement existing methods.</p>\n<p>2016 has been hailed as the year of ChatBots and as a new means of User Interaction in addition to native mobile apps. Chatbots are programs that interact with people in natural language over messenger applications. Several popular messenger applications support the development of chatbots like Facebook Messenger, Kik, Telegram, WeChat, Line, Skype, Slack etc. These messengers combined have a user base of over a billion! </p>\n<p><a href=\"http://venturebeat.com/2016/08/02/why-chatbots-are-replacing-apps/\" rel=\"nofollow\">Why chatbots are replacing apps</a></p>\n<h2>Why Chatbots?</h2>\n<p>Chatbots have several advantages of single-purpose native mobile apps</p>\n<h4>For the User</h4>\n<ul>\n<li>Users use a small set of apps most of the time and Messenger apps are very popular. For example, Facebook has a <a href=\"https://www.statista.com/statistics/417295/facebook-messenger-monthly-active-users/\" rel=\"nofollow\">billion monthly active users</a>. Other apps tend to fall into the long tail of apps that are rarely used</li>\n<li>Apps include their own learning curve but chatbots use messenger interfaces and natural language that users are familiar with. This makes the user experience better. </li>\n</ul>\n<h4>For the Developer</h4>\n<p>The real advantage of chatbots over apps is in the development process. </p>\n<ul>\n<li>Native apps require building both back and front ends. The front end often requires several weeks by large teams to design, build and test the app. Chatbots, however, <em>only require the backend</em> since the front end is handled by the messenger apps. </li>\n<li>The long and expensive development life cycle is also per OS. i.e you would build an android version, an iOS version and maybe a windows version. For Chatbots, once you build the backend, adding messenger clients takes a couple of hours to plug in. </li>\n<li>Deployment of new features simply require small changes in the backend unlike native apps which require a lot more time to build, test and deploy updates</li>\n</ul>\n<h2>What is PoPo Pango and what does it do?</h2>\n<p>PoPo Pango is a chatbot that collects crowdsourced information about wildlife trafficking. The target user base are regular people who might travel to different places and notice wildlife being traded. For example, you were walking around in a new place and noticed someone selling a wildlife as a pet in a pet store! Or you come across a restaurant that serves a dish made from an endangered animal. You can simply tell PoPo Pango using any of the supported messenger applications. (Currently facebook messenger and SMS is supported but adding other messengers is extremely simple). Once you report it, the data is logged into a central repository. A simple web interface is provided to view and analyze this data and can be later used by law enforcement or wildlife conversationalists to decide on policy. </p>\n<p>Here is a demo of how users can <a href=\"https://www.youtube.com/watch?v=1pyePN4K3e0\" rel=\"nofollow\">interact with the chatbot on Facebook Messenger</a></p>\n<p>Several people who live on the peripherals of wildlife reserves might not have access to smartphones. So, the chatbot can also be used with SMS service. Here is a demo of <a href=\"https://www.youtube.com/watch?v=VKxraL8OGaQ\" rel=\"nofollow\">PoPo Pango on SMS</a></p>\n<p>Given the natural language interface, the language of communication can easily be adapted to handle local languages used services like Google translate.</p>\n<h2>What is it made of?</h2>\n<p>The chatbot has a simple Django based server and uses the messenger api provided by Facebook for communication. For SMS based interaction, it uses Twilio. Upcoming clients will use corresponding APIs</p>\n<h2>What is in store for the future?</h2>\n<ul>\n<li>The first step is to build a stable version, launch it on a production server and to support all possible messenger clients</li>\n<li>Not everyone understands English so use of Google translate to switch languages based on locality</li>\n<li>Integrate an incentive program using Facebook pay/mobile pay directly to encourage useful and authentic tips </li>\n</ul>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/django\">django</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/twilio\">twilio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/facebook\">facebook</a></span></li><li><span class=\"cp-tag\">messenger-api</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/abhay1/popo_pangolin\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/abhay1/popo_pangolin\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["Conservationville", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Conservationville – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/423/785/datas/gallery.jpg\"/>\n<p>\n<i>Screens can be customized for any organization and adjusted for any species in need of conservation </i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Conservationville – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/423/787/datas/gallery.jpg\"/>\n<p>\n<i>Screens can be customized for any organization and adjusted for any species in need of conservation </i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Conservationville – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/423/788/datas/gallery.jpg\"/>\n<p>\n<i>Screens can be customized for any organization and adjusted for any species in need of conservation </i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Conservationville – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/423/789/datas/gallery.jpg\"/>\n<p>\n<i>Adopt and get real-time updates on animals you have adopted</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Conservationville – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/423/790/datas/gallery.jpg\"/>\n<p>\n<i>Home screen with activities making conservation and adopting a species- engaging and fun</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Conservationville – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/423/797/datas/gallery.jpg\"/>\n<p>\n<i>Get notified of successes in conservation </i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Conservationville – screenshot 7\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/423/798/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Conservationville – screenshot 8\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/423/799/datas/gallery.jpg\"/>\n<p>\n<i>Check up on your animals under adoption</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Conservationville – screenshot 9\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/423/810/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Try It Now</h2>\n<p><a href=\"https://www.flinto.com/p/d60b6399\" rel=\"nofollow\">Click to play with demo</a> </p>\n<h2>Location</h2>\n<p>Pitched at Zoohackathon DC ( Runner Up/Honorable Mention) </p>\n<h2>Inspiration</h2>\n<p>Conservationville is \"Farmville\"ing the conservation donor experience. A white-label mobile app adaptable to any local NGO/conservation/anti-poaching group that educates the public on poaching issues and makes \"donating\" a fun and gamified experience. </p>\n<h2>Problems</h2>\n<ul>\n<li>Most donors who give to wildlife conservation and species rehabilitation from poaching are 35 years old and up. (Yet most funding for organizations at the local level come from individual donors). We need to find an engaging way to get young people involved. </li>\n<li>There is no \"simple\" solution exists to allow organizations to report about their conservation triumphs and pitfalls to donors to encourage more charitable giving. </li>\n<li>Some NGOS have \"adopt\" an ____ species programs. However adoption of an animal starts at a very high price point (that makes it unaffordable to most millennials). Building a solution that makes \"donating\" easy and impactful, even in small amounts</li>\n<li>Donations to conservation/poaching-prevention groups = an invisible process-  no direct way to see where $'s go aside from annual reports</li>\n<li>Programs poaching and public awareness can be enhanced with additional donor $s if organizations are able to fundraise more</li>\n</ul>\n<h2>What it does</h2>\n<ul>\n<li>Preview prototype made for Zoohackathon <a href=\"https://www.flinto.com/p/d60b6399\" rel=\"nofollow\">HERE</a> </li>\n</ul>\n<h2>How I built it</h2>\n<ul>\n<li>*Prototype: sketch | flinto. </li>\n<li>*Front-end: react-native </li>\n<li><p>*Backend: node.js</p></li>\n<li><p>APIS: Paypal, Stripe, Google and Facebook Login API</p></li>\n</ul>\n<h2>Challenges I ran into</h2>\n<ul>\n<li>Time (wish there was more of this) </li>\n</ul>\n<h2>Accomplishments that I'm proud of</h2>\n<ul>\n<li>Conservationville has IMPACT: Individuals making the difference on \"real\" species through conservation charity giving and poaching awareness. Fund generation of up to $100 million + for wildlife conservation/poaching prevention organizations</li>\n</ul>\n<h2>What I learned</h2>\n<ul>\n<li>a lot about various species that are widely poached around the world and the lack of education much of the general public has</li>\n<li>the impact that fundraising and funding can have to stop poaching at the local level (esp to millennials and those 35 and under that is not a typical donor-base for these types of community based organizations). </li>\n</ul>\n<h2>What's next for Conservationville</h2>\n<ul>\n<li>looking to partner with NGOs and anti-poaching organizations around the world. If you want to get in touch, or have suggestions for organizations to partner with, leave your info in comments below!</li>\n</ul>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/react-native\">react-native</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/sketch\">sketch</a></span></li><li><span class=\"cp-tag\">flinto.</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://www.flinto.com/p/d60b6399\" rel=\"nofollow\" target=\"_blank\" title=\"https://www.flinto.com/p/d60b6399\">\n<i class=\"ss-icon ss-link\"></i>\n<span>www.flinto.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["Savvy Savanna", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Savvy Savanna – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/423/939/datas/gallery.jpg\"/>\n<p>\n<i>Heat map showing sensor activity in a conservation area.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Savvy Savanna – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/310/datas/gallery.jpg\"/>\n<p>\n<i>The team</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Endangered species in conservation areas are threatened to the point of extinction by poachers.  Local authorities are resource constrained and are not able to monitor an entire conservation area for poaching activity -- particularly the interior of a preserve.  Low cost sensors can be deployed throughout the interior of a conservation area to monitor the savanna for suspicious activity.</p>\n<h2>What it does</h2>\n<p>Savvy Savanna allows low cost Internet of Things devices - the sensor and the button - to be deployed in conservation  areas and surrounding villages.  The system allows people to press a button to report suspicious poaching activity <em>and</em> solar-powered field sensors which automatically report potential poacher problems in the savanna.</p>\n<p>Sensors in the savanna detect sounds, such as helicopter noise, that trigger an alert to be sent to the cloud and subsequently to the appropriate authorities.</p>\n<p>The system alerts authorities of poacher activity detected by the system.  The authorities receive a text message alert.  </p>\n<h2>How we built it</h2>\n<h2>Challenges we ran into</h2>\n<p><strong>Network Coverage Issues</strong>\nCellular signal reception and WiFi network coverage is limited in the savanna.  Signals from the sensors need a way to transmit information to the cloud.  To solve this problem, the sensors in the field are part of a mesh network.  This is technology currently utilized in \"smart cities\" with interconnected devices.  Field sensors can be networked together with only certain sensors directly connected to the main cloud network.</p>\n<p><strong>Community Participant Anonymity</strong>\nCommunity members may be targeted for attack by organized crime groups if they are seen as reporting poaching activities.  To solve this problem, \"the button\" component of the system is a way that community members can anonymously report potential poaching activity in their neighborhood by simply pushing a button.</p>\n<h2>Accomplishments that we're proud of</h2>\n<h2>What we learned</h2>\n<h2>What's next for Savvy Savanna</h2>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/particle\">particle</a></span></li><li><span class=\"cp-tag\">particle-cloud</span></li><li><span class=\"cp-tag\">particle-board</span></li><li><span class=\"cp-tag\">electron</span></li><li><span class=\"cp-tag\">particle-electron</span></li><li><span class=\"cp-tag\">lambda</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/amazon-web-services\">amazon-web-services</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag\">sms</span></li><li><span class=\"cp-tag\">smart-and-feature-phones</span></li><li><span class=\"cp-tag\">aws-lambda</span></li><li><span class=\"cp-tag\">amazon-iot-button</span></li><li><span class=\"cp-tag\">aws-iot-button</span></li></ul>\n</div>\n</div>", ["Assisted with the development of the heat map and hackathon material submission.", "I helped develop the SMS portion of the system developing the integration with Twilio and Node.js. The SMS was triggered from Particle Cloud and AWS Lambda.", "I helped with the backend code hosted in AWS Lambda. I was also responsible for configuring the integrations between Particle Cloud, AWS, and Twilio.", "I worked on the hardware, firmware and setting up the overall architecture.", "", ""]], ["Palm Oil Optimisation Project", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/Q__JRvxbeOk?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"Palm Oil Optimisation Project – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/423/737/datas/gallery.jpg\"/>\n<p>\n<i>SustainabilityGatewayUI</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Palm Oil Optimisation Project – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/423/746/datas/gallery.jpg\"/>\n<p>\n<i>Processes for becoming certified</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Our team knows first hand the challenge of delivering to complex compliance regulation in both the aerospace and health insurance industry. We were inspired by best practices in these industries to simplify complex information.\n..</p>\n<h2>What it does</h2>\n<p>To become sustainably certified there is a barrier of over 500 regulations for farmers to fulfil: a seemingly impossible undertaking for smallholders. Our simple regulation work-through and community tools allow farmers’ cooperatives to join together and complete their sustainability accreditation. Taking the huge pile of regulations, breaking it down into bite sized manageable chunks. The impact is more sustainable certified palm oil production with a less painful barrier to entry for the little guy.</p>\n<h2>How we built it</h2>\n<p>The platform is a single page application in AngularJS with d3.js to generate the progress charts. The dashboard is a simple implementation of a kanban board allowing for farmers to move their tasks between different states.\nOur data is simply a json file that we built by analysing the RSPO certification guidelines. We parse it from the client to populate the visual workflow. The UI design was done using AngularMaterial..</p>\n<h2>Challenges we ran into</h2>\n<p>Being non-specialists in the palm oil industry, we were lucky to have a specialist to support us. Understanding the detail in the 47 pages of RSPO sustainable palm oil regulations was a big task.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Team collaboration and building a fantastic and functioning site in less than 24 hours! We brought together lots of new faces and skills to design and build elements under pressure.</p>\n<h2>What we learned</h2>\n<p>How challenging it is to become sustainability certified in palm oil production. \nTrello APIs.</p>\n<h2>What's next for Palm Oil Optimisation Project</h2>\n<p>Finishing the full user journey and site build. \nAdding content for all sections of the certification process.\nImplementing a full back end with a database for storage of user update/modifications of the tasks.\nEnabling farmers with low literacy to understand requirements by adding an audio option for most important text elements.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/angular-js\">angular.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/d3-js\">d3.js</a></span></li><li><span class=\"cp-tag\">material-design</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/heroku\">heroku</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://palmoiloptimisationproject.herokuapp.com/\" rel=\"nofollow\" target=\"_blank\" title=\"https://palmoiloptimisationproject.herokuapp.com/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>palmoiloptimisationproject.herokuapp.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["D3 ", "", "", "", "", "", ""]], ["Wildlife Friendly Traveler", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Wildlife Friendly Traveler – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/170/datas/gallery.jpg\"/>\n<p>\n<i>Landing Page</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Wildlife Friendly Traveler – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/173/datas/gallery.jpg\"/>\n<p>\n<i>Jamaica Example Page</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Wildlife Friendly Traveler – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/174/datas/gallery.jpg\"/>\n<p>\n<i>Jamaica Food Tab</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Problem Statement</h2>\n<p>The illegal trade in wildlife and wildlife products is a rapidly intensifying problem that requires serious international attention. Unfortunately, international travelers often unknowingly purchase wildlife items made from endangered or protected species and attempt to import them back into their home country. Many travelers do not realize that products and souvenirs made from these species are protected by international or national law and may be seized upon re-entry. In order to help curb this problem, I propose the creation of a mobile app that allows users to input destination and view wildlife and wildlife products to avoid while traveling in the selected destination.</p>\n<h2>What it does</h2>\n<p>This application is a prototype for the Wildlife Friendly Traveler web app for the Zoohackaton at the National Zoo in Washington, DC. The application demonstrates how to allow travelers to look up a country they will be traveling to and find information about wildlife trade products and issues, learn more about the species they will be helping to protect, and become better informed Wildlife Friendly Travelers.</p>\n<h2>Use Cases</h2>\n<ul>\n<li>Cruise Traveling (Incorporate this information into Cruise Shopping Seminars)</li>\n<li>Appended information to flight tickets</li>\n<li>JetBlue Video / Awareness (Point to this web app)</li>\n<li>Mobile App Version</li>\n<li>Tied into shopping apps</li>\n</ul>\n<h2>Resources Needed to Continue</h2>\n<ul>\n<li>More research is needed (the perfect intern project!)</li>\n<li>Add more items to each card, integrate more sources</li>\n</ul>\n<h2>Impact</h2>\n<ul>\n<li>More informed Consumers</li>\n<li>Decrease in demand for products that play a part in wildlife trafficking</li>\n</ul>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ruby-on-rails\">ruby-on-rails</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/charleshuang80/WlidlifeFriendlyTraveler\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/charleshuang80/WlidlifeFriendlyTraveler\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["Safe Souvenirs", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/zncc_sSLhAA?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"Safe Souvenirs – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/271/datas/gallery.jpg\"/>\n<p>\n<i>Safe Souvenirs was created by these people</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Safe Souvenirs – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/275/datas/gallery.jpg\"/>\n<p>\n<i>The goal of Safe Souvenirs</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Safe Souvenirs – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/277/datas/gallery.jpg\"/>\n<p>\n<i>How it works</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Safe Souvenirs – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/279/datas/gallery.jpg\"/>\n<p>\n<i>Enter a destination to see what products to stay away from and which products to look for</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Safe Souvenirs – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/280/datas/gallery.jpg\"/>\n<p>\n<i>Vibrant colors act as visual indicators to educate users on what products to avoid and why</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Safe Souvenirs – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/278/datas/gallery.jpg\"/>\n<p>\n<i>Educating users on what products are sustainable and where to get them</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Safe Souvenirs – screenshot 7\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/276/datas/gallery.jpg\"/>\n<p>\n<i>An accompanying website provides a responsive cross platform interface for users who may not have access to the app</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>After looking at the problem statements, the whole team connected with one specific problem that all of us had experienced. We have all visited other countries and purchased souvenirs with no knowledge of what we could and could not bring home.  As it turns out, we are not alone.  According to the World Wildlife Seizures Database, “While enforcement agents must seize non-compliant shipments, many of these incidents appear to be the result of ignorance or negligence, not criminal intent.”   </p>\n<h2>What it does</h2>\n<p><strong>Safe Souvenirs</strong> is both a mobile and web app that provides tourists with information on what \nproducts are illegal to import into the United States.  In addition, it provides tourists with safe to bring home souvenir options from their destination.</p>\n<h2>How we built it</h2>\n<p>We approached this problem by gauging what we can create in the two days and how easily we can scale it. We were also very keen on providing not just a proof of concept, but also a prototype. Hence, we decided to do a web app and a mobile app. </p>\n<p>An important goal for us was to make sure our product is hyper-focused so anyone seeing our product knows exactly what we are trying to do and that we have a clear direction in how we proceed. So we created a website that had a search engine for major regions of tourists. Once they identified where they wanted to travel, we would provide information on what exactly they should be on the look-out for and good alternatives that practice sustainable sales and harvesting. We paralleled this on the mobile app. Our whole theme was a travel and shopping centric application that targeted the average tourist/family</p>\n<h2>Challenges we ran into</h2>\n<p>Picking a problem statement and narrowing our focus, acquiring product data, cataloguing and a highly air conditioned room were some of our team’s challenges.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>As we built <strong>Safe Souvenirs</strong>, we realized how it addressed the fundamental concern of wildlife trafficking. Globally we know the demand for illegal products has increased, and our product reduces the demand for these products. We are proud of increasing the education of consumers, while also driving business to reputable, sustainable, and responsible merchants abroad.</p>\n<h2>What we learned</h2>\n<p>When we became a team and realized each of our specialized skillsets and strengths, we naturally fell into specific roles as we developed our product. We learned communication and flexibility were key as we developed our idea and brought it to life.</p>\n<h2>What's next for Safe Souvenirs</h2>\n<p>Our next steps are to finish compiling the product catalog and building a merchant contact database.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/objective-c\">objective-c</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/wix\">wix</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://utkrishtzoo.wixsite.com/safesouvenir\" rel=\"nofollow\" target=\"_blank\" title=\"http://utkrishtzoo.wixsite.com/safesouvenir\">\n<i class=\"ss-icon ss-link\"></i>\n<span>utkrishtzoo.wixsite.com</span>\n</a></li>\n<li><a href=\"https://github.com/madclouds/SafeSouvenirs/\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/madclouds/SafeSouvenirs/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I wrote the iOS app and lead product management.", "", "", "", ""]], ["WildTrack", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"WildTrack – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/292/datas/gallery.jpg\"/>\n<p>\n<i>Title</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"WildTrack – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/296/datas/gallery.jpg\"/>\n<p>\n<i>Problem</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"WildTrack – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/294/datas/gallery.jpg\"/>\n<p>\n<i>Solution</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"WildTrack – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/297/datas/gallery.jpg\"/>\n<p>\n<i>Implementation</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"WildTrack – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/295/datas/gallery.jpg\"/>\n<p>\n<i>Technology</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"WildTrack – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/298/datas/gallery.jpg\"/>\n<p>\n<i>How it Works</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"WildTrack – screenshot 7\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/299/datas/gallery.jpg\"/>\n<p>\n<i>Real Life Scenario 1</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"WildTrack – screenshot 8\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/300/datas/gallery.jpg\"/>\n<p>\n<i>Real Life Scenario 2</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"WildTrack – screenshot 9\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/302/datas/gallery.jpg\"/>\n<p>\n<i>Analytics Dashboard</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Problem</h2>\n<p>*No way to capture information from the general public on poaching, wildlife trafficking, and human-wildlife conflict into the SMART system</p>\n<h2>Solution</h2>\n<p>*SMS ingestion engine anonymously processes user reports in real-time, pulling out keywords to populate SMART data model\n*Analytics Dashboard aggregates data from SMS reports and multiple SMART Connect servers to show trends in poaching activity regionally and globally</p>\n<h2>Implementation</h2>\n<p>*Leverage existing base of feature phones (non-smartphones)\n*Integrate with existing SMART system\n*Add server for SMS ingestion engine and analytics dashboard\n*Customized localizations</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/leaflet-js\">leaflet.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/twilio\">twilio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/redis\">redis</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/docker\">docker</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/azure\">azure</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/aysark/ideal-palm-tree\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/aysark/ideal-palm-tree\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"https://github.com/jasonalderman/wildtrack-dashboard\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/jasonalderman/wildtrack-dashboard\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Project Manager, Sample dataset creation", "-Contributed to research and ideation\n-Wrote code to connect to API endpoint and fetch / parse data (for live data and test datasets)\n-Wrote various filtering and sorting functions \n-Wrote functions to update data model based on user interaction", "I contributed to:\n- User Experience\n - User Flow\n - Project Research\n - Building the User Interface ", "", "", "", "", ""]], ["Adonis", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<p><img alt=\"Adonis\" data-canonical-url=\"https://i.imgur.com/3b03onL.png\" src=\"https://res.cloudinary.com/devpost/image/fetch/s--aXQ9Ny4a--/https://i.imgur.com/3b03onL.png\"/></p>\n<p>Prompt 3: Create an Illegal Wildlife Fund</p>\n<p><img alt=\"Adonis in action\" data-canonical-url=\"https://i.imgur.com/4GWrjEf.jpg\" src=\"https://res.cloudinary.com/devpost/image/fetch/s--gRxRu78O--/https://i.imgur.com/4GWrjEf.jpg\"/></p>\n<p><strong>Adonis is a way for people to fund conservation projects for free.</strong> </p>\n<p>We've created <a href=\"https://sixfingeredamish.github.io/zoohackathon/\" rel=\"nofollow\">a website</a> to explain how it works.</p>\n<p>You can see the slides from our presentation <a href=\"https://drive.google.com/file/d/0B3Y5QQR4kz1AZDFMQVk1M1Z5TmM/view?usp=sharing\" rel=\"nofollow\">here</a>.</p>\n<p>Team: Walter Ceder, Nirawit Jittipairoj, Bruce Ng, Ivy Wong, Hannah Yoo</p>\n<p><img alt=\"Footer\" data-canonical-url=\"https://i.imgur.com/T7CL2Vp.png\" src=\"https://res.cloudinary.com/devpost/image/fetch/s--XUFf1wkM--/https://i.imgur.com/T7CL2Vp.png\"/></p>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://sixfingeredamish.github.io/zoohackathon/\" rel=\"nofollow\" target=\"_blank\" title=\"https://sixfingeredamish.github.io/zoohackathon/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>sixfingeredamish.github.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Walter Ceder worked on the Chrome extension and the settings page. "]], ["Responsibuyer", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Responsibuyer – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/362/datas/gallery.jpg\"/>\n<p>\n<i>Demo </i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Responsibuyer – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/363/datas/gallery.jpg\"/>\n<p>\n<i>Splash page</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h1>Zoohackathon: Responsibuyer</h1>\n<p>The purpose of this app is to help increase awareness of illegal or harmful products you may find when going on vacation.</p>\n<p>This application was developed on October 8th, 2016 for the <a href=\"http://www.zoohackathon.com/\" rel=\"nofollow\">Zoohackathon</a>.</p>\n<p><img alt=\"Isn't our app beautiful?!\" data-canonical-url=\"https://raw.githubusercontent.com/zoohackathon/responsibuyer/master/images/screenshot.png\" src=\"https://res.cloudinary.com/devpost/image/fetch/s--uW5y3U9h--/https://raw.githubusercontent.com/zoohackathon/responsibuyer/master/images/screenshot.png\"/></p>\n<p>Our app is live at <a href=\"http://responsibuyer.blueb.org:5000/\" rel=\"nofollow\">http://responsibuyer.blueb.org:5000/</a>. You can also check out our application in action below: <img alt=\"Gif\" data-canonical-url=\"https://raw.githubusercontent.com/zoohackathon/responsibuyer/master/images/screencast.gif\" src=\"https://res.cloudinary.com/devpost/image/fetch/s--AXGkFnzG--/https://raw.githubusercontent.com/zoohackathon/responsibuyer/master/images/screencast.gif\"/></p>\n<h2>Challenge and Approach</h2>\n<p>Our submission is for <a href=\"https://www.wildlabs.net/community/thread/272\" rel=\"nofollow\">Challenge #7. Decrease Purchase of Illegal Wildlife Products</a>.</p>\n<p>Our approach for satisfying this challenge was to:</p>\n<ul>\n<li>Create an easy to access site for searching based on destination</li>\n<li>Provide examples of known products that have a negative impact on native wildlife</li>\n<li>Allow users to look further into the products and the impact had on wildlife populations</li>\n</ul>\n<p>Going forward, we want to implement the following features to make Responsibuyer more helpful to our users and help promote conservation efforts of animals being poached:</p>\n<ul>\n<li>Allow users to upload images of examples of products promoting illegal poaching of endangered species</li>\n<li>Show users a list of local businesses that support local conservation efforts</li>\n<li>Allow users to input a travel itinerary with a list of destinations</li>\n<li>Show users ads for non-profits supporting conservation efforts on our list of goods and services to avoid to donate a portion of proceeds to charities fighting illegal poaching</li>\n</ul>\n<h2>Team Members</h2>\n<p>Our team is comprised of:</p>\n<ul>\n<li><a href=\"https://github.com/bonecrushereb\" rel=\"nofollow\">@bonecrushereb</a> - Benjamin Nolan</li>\n<li><a href=\"http://github.com/florean\" rel=\"nofollow\">@florean</a> - Nathan Florea</li>\n<li><a href=\"http://github.com/handigarde\" rel=\"nofollow\">@handigarde</a> - Ryan Handy</li>\n<li><a href=\"http://github.com/Jaemu\" rel=\"nofollow\">@Jaemu</a> - Jill Handy</li>\n<li><a href=\"http://github.com/wshelor\" rel=\"nofollow\">@wshelor</a> - Will Shelor</li>\n<li><a href=\"http://github.com/mfm24\" rel=\"nofollow\">@mfm24</a> - Matt Murfitt</li>\n</ul>\n<h2>Technologies, APIs, and Datasets Utilized</h2>\n<p>We made use of:</p>\n<ul>\n<li><a href=\"http://flask.pocoo.org/\" rel=\"nofollow\">Flask</a> application for serving data</li>\n<li>Postgres backend for storage</li>\n<li><a href=\"http://apiv3.iucnredlist.org/api/v3/docs\" rel=\"nofollow\">IUCN Redlist API</a> for information on endangered species</li>\n<li><a href=\"http://wildlifetradetracker.org/\" rel=\"nofollow\">Wildlife trade tracker</a> for information on harmful products</li>\n<li><a href=\"https://wikipedia.org\" rel=\"nofollow\">Wikipedia</a> for animal descriptions</li>\n</ul>\n<h2>Contributing</h2>\n<p>In order to build and run our app:</p>\n<ol>\n<li>Clone the repository</li>\n<li>Build database on <code>docs/schema.sql</code></li>\n<li>Unzip data/responsibuyer.sql.gz</li>\n<li><code>psql responsibuyer &lt; responsibuyer.sql</code> to populate the database</li>\n<li><code>python main.py</code> to start the webserver</li>\n</ol>\n<p>Our code is licensed under the <a href=\"LICENSE\" rel=\"nofollow\">Apache License</a>. Pull requests will be accepted to this repo, pending review and approval.</p>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/zoohackathon/responsibuyer\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/zoohackathon/responsibuyer\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", "", "", ""]], ["free friends to stop animal trafficking", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/F5CKyCUI6Lg?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"free friends to stop animal trafficking – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/719/datas/gallery.jpg\"/>\n<p>\n<i>STOP !!! A.T.</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>Inspiration - Our attendance at the Zoohackaton - San Diego Zoo Safari Park - Ending Loop - Coding to Stop Wild Life Trafficking, Oct 7-9, 2016</p>\n<p>What it does - Catchy Slogans &amp; a Coloring Book App - as a free gift for a donation to Stop Animal Trafficking, and creating a low-cost 'friendly lick button' to start a animal friendly dialogue between \"animal centric business and consumers\"</p>\n<p>How we built it - We established a very clear focus in getting our message out \"connecting the spots to STOP !!! AT\" into the forefront of everyone's \"working memory\" during the Zoohackathon.  Our knowledge of coding and teh technology side (for example, creation of a coloring book app) in achieving aspects of our proposal at moment is very limited. However, we did make some new friends who reached out to help us at the Zoohackathon (Oct 7-9, 2016) which we participated in.</p>\n<p>We, 'freefriends,' were established at the Zoohackathon, and our team is a team of three; a Professor of Chemistry, a Mechanical Engineer/MBA and a CPA. We are insightful, clever and busy people but being busy doesn't stop us from being life long learners, educating and being engaged in learning, and in trying to propose solutions in solving difficult issues.</p>\n<p>Challenges we ran into:  We are NOT coders, but in solving our problem statement \"conservation funding\" during the Zoohackathon competition, we were able to make new \"friends\" who we willing to reach out, give us the thumbs-up and offer help, and as a result we were established Oct 9, 2016 as \"freefriends.\"</p>\n<p>Accomplishments we are proud of - After getting an education by experts in the field on \"animal trafficking\" at the Zoohackathon, we were PROUD in establishing ourselves as \"freefriends\" having clear focus in innovating \"viable low-cost solutions\" into our \"working memories\" and having to present those ideas in competition within 48 hours. Our next step is to actively seek supporters.</p>\n<p>Our new motivation and purpose was derived from our participation in the Zoohackathon. Now, we would like to take it to the next level in gaining local support in San Diego before creating a national campaign to the get the message out \"Connecting the spots to STOP !!! AT, Stop Animal Trafficking\"</p>\n<p>What We learned - Animal Trafficking is a National Security and Global Threat that needs to be STOPPED! </p>\n<p>Please watch our 6 minute youtube video and join us in our endeavor.</p>\n<p><a href=\"https://www.youtube.com/watch?v=F5CKyCUI6Lg\" rel=\"nofollow\">https://www.youtube.com/watch?v=F5CKyCUI6Lg</a></p>\n<p>What's next for 'freefriends.' We are looking for minded individuals who would like to provide us help (funding, staffing and technical support) in getting our message and into the forefront of everyone's working memories, STOP !!! AT, as we move forward in resolving the complexities of \"animal trafficking.\"</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/iphone-sdk\">iphone-sdk</a></span></li></ul>\n</div>\n</div>", [""]], ["Protecting Our Orangutan Habitat (POOH)", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>In approaching the problem, we realized how little we understood about the impact of non-sustainable palm oil production on Orangutan habitat and the incredible complexity of the problem. After researching and discussing the many moving parts and ways to help, we realized that by raising awareness to the problem we could inspire others to think, feel, and take action.</p>\n<h2>What it does</h2>\n<p>Our web site, Protecting Our Orangutan Habitat (POOH), is an ArcGIS story map that uses maps, charts, descriptive information, pictures, and videos to describe the problem of non-sustainable palm oil production and its impact on Orangutan habitat in Borneo. An additional reporting app allows users to add reports of conflict palm oil incidents as photographs and text tied to locations on the map.</p>\n<p><strong>Visit it at</strong> <a href=\"http://arcg.is/2dCxrGd\" rel=\"nofollow\">Protect Our Orangutan Habitat</a> </p>\n<h2>How I built it</h2>\n<p>ArcGIS Online story map (see arcgis.com for a free account).</p>\n<h2>What's next for Protecting Our Orangutan Habitat (POOH)</h2>\n<p>-- Localized versions for Indonesia, Malaysia, and Thailand</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/esri\">esri</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://arcg.is/2dCxrGd\" rel=\"nofollow\" target=\"_blank\" title=\"http://arcg.is/2dCxrGd\">\n<i class=\"ss-icon ss-link\"></i>\n<span>arcg.is</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Contributed to the research, editing and creative inspiration for the project. Many thanks to all team members who dedicated themselves for an entire weekend to make the world a better place.", "I worked on fine-tuning our storytelling to increase public engagement. I also helped gather relevant information/data to improve the overall user experience. ", "", "", "", ""]], ["Rafiki", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/kzaa52sUG9I?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"Rafiki – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/540/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Rafiki – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/541/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Rafiki – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/542/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Rafiki – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/543/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Rafiki – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/544/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Rafiki – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/545/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Rafiki – screenshot 7\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/546/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Rafiki – screenshot 8\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/547/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Rafiki – screenshot 9\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/548/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Rafiki – screenshot 10\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/549/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Rafiki – screenshot 11\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/550/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>SMART (Spatial Monitoring and Reporting Tool) is one of the leading poaching reporting tools in use in protected areas around the world. Effective as a specialist software, it fails to capitalise on input from the communities living in and around conservation areas.</p>\n<p>Capturing local community intelligence in a meaningful way could be a game-changer for wildlife, bolstering ecological monitoring and law enforcement efforts. The SMART Partnership are seeking to use technology to this goal.\nIn order to be successful, any such solution should be simple to deploy, easy to use, and able to overcome language, technology and literacy challenges affecting these communities.</p>\n<p>Our inspiration stemmed from joint appreciation of elephants and familiarity with the research and awareness work of Save the Elephants in Kenya, who brought Samburu to Google Maps and the attention of the world. \nWe realised we could do so much more with technology. We want to create a harmonious loop: </p>\n<ol>\n<li>Report (incidents such as poaching, with the help of engaged and incentivised communities) </li>\n<li>Analyse (large datasets to identify circumstantial patterns) </li>\n<li>Predict (the likelihood, time and location of criminal activity to help facilitate proactive over reactive law enforcement)</li>\n</ol>\n<h2>What it does</h2>\n<p>Rafiki is a concept aimed at engaging communities in the conservation of local protected areas. Rafiki makes it easy to report incidents of criminal activity (such as poaching and illegal trade) and tries to overcome language, literacy and technological challenges. Eventually, Rafiki begins to predict patterns in criminal activity and sends out pre-emptive alerts to rangers and communities. </p>\n<p>At the very least, Rafiki is a progressively enhanced solution that works across a variety of channels: SMS, common to feature and smartphones alike; voice; and smartphone app – localised based on access number, area code and GPS data.</p>\n<p>In the case of SMS, the interface is conversational rather than being a prescribed set of questions; natural language processing extracts critical data from text. </p>\n<p>In the case of the app, a thoughtful user experience and rich visual language removes the barriers to engagement and educates communities with video and audio snippets, providing a compelling call to action. </p>\n<p>All in all, Rafiki makes it easy for those living in or around protected areas to report incidents of critical concern to conservation, safely (and optionally, anonymously) and just in time. </p>\n<p>But it doesn't stop here; we identified the potential for using external datasets (weather, seasons and daylight, animal migration patterns, camera traps, historical incident reports, news headlines) &amp; machine learning to offer predictions of when, where and how criminal activity is likely to occur. Early notifications could mobilise law enforcement, instil community vigilance (and prompt re-engagement) and may act as a deterrent for criminals. </p>\n<h2>How we built it</h2>\n<p>We started with the SMS interface, which is implemented and currently operational. We also prototyped a web app/native application, all based on a microservices architecture.</p>\n<p>We built a proof of concept to establish if the machine learning component could be an integral part of the system. The data feeds available are the limitation to the potential of a system such as this. For example, if live tracking data were available (with the obvious protections in place) our machine learning back-end would have been significantly enhanced.</p>\n<h2>Challenges we ran into</h2>\n<p>Machine learning is an exceptionally complex area and as such we chose to focus on the key points of the brief. The paucity of available datasets made implementation intractable within the time constraints of the hackathon.</p>\n<p>We’re a team of two, so we had to restrict the scope of implementation; however, we did not restrict the project scope and resolved to be prepared to deliver everything we’d propose, eventually ☺</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Rafiki’s cute logo! The harmonious loop: report, analyse, predict. 48 sleepless hours and so much passion. Also it's great to have a fully functional, multilingual application (give the SMS a try!).</p>\n<h2>What we learned</h2>\n<p>The Afrikaans word for ‘poaching’ is ‘stropery’, according to Google Translate. Conservation presents many challenges and exciting opportunities for the world of tech.</p>\n<h2>What's next for Rafiki</h2>\n<p>Our main focus to come is the machine learning platform, which we believe have enormous potential for law enforcement and community engagement. We extremely excited about the potential this offers and completing further research and implementation around this would be the obvious next step.</p>\n<h1>Demo</h1>\n<p>Text Rafiki to +44 7400 047859 (English) or +44 7400 274155 (Afrikaans)</p>\n<p><a href=\"https://www.dropbox.com/s/fl06qwx0sxx2b92/Rafiki%20-%20Brave%20Pandas%20-%20Zoohackathon%202016.pdf?dl=0\" rel=\"nofollow\">Rafiki Presentation</a></p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css3\">css3</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/twilio\">twilio</a></span></li><li><span class=\"cp-tag\">sms</span></li><li><span class=\"cp-tag\">api</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/json\">json</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mongodb\">mongodb</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/machine-learning\">machine-learning</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/BravePandas/panda-sails\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/BravePandas/panda-sails\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"https://github.com/BravePandas/panda-vagrant\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/BravePandas/panda-vagrant\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"https://www.dropbox.com/s/fl06qwx0sxx2b92/Rafiki%20-%20Brave%20Pandas%20-%20Zoohackathon%202016.pdf?dl=0\" rel=\"nofollow\" target=\"_blank\" title=\"https://www.dropbox.com/s/fl06qwx0sxx2b92/Rafiki%20-%20Brave%20Pandas%20-%20Zoohackathon%202016.pdf?dl=0\">\n<i class=\"ss-icon ss-link\"></i>\n<span>www.dropbox.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on the backend and machine learning concepts. ", "I worked on the front end and UX design."]], ["Reading Palms", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Reading Palms – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/432/614/datas/gallery.jpg\"/>\n<p>\n<i>The colour image of the area of interest, which covers approximately 12k square miles. The area is South Kalimantan Indonesia.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Reading Palms – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/432/613/datas/gallery.jpg\"/>\n<p>\n<i>The importance of each variable in the model. The created variables designed to detect Vegetation (TNDVI) is the most important</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Reading Palms – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/432/612/datas/gallery.jpg\"/>\n<p>\n<i>The map with land use classified by the model. Light Green is Palm Plantation, Dark green is Forest, White is Cloud, Blue is water.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Reading Palms – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/097/datas/gallery.jpg\"/>\n<p>\n<i>Plantations from the SPOTT database overlaid on the classified map</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Reading Palms – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/432/896/datas/gallery.jpg\"/>\n<p>\n<i>Calculated Values based on SPOTT data. area in Km^2. According to data 47 percent of Seruyan's output is Conflict</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration:</h2>\n<p>To prevent further deforestation in tropical rainforest for the production of palm oil. Focusing on the early detection of land use in conflict areas. The Spectral analysis provides a clear way of detect changes in land which can be investigated and checked against certified land. This allows stake holders easy access to data to check new farms are not in a conflict area. This can aid registration to RSPO or prevent. information can be shared with manufactures and the wider public to reassure them in the sustainability in the Palm Oil product.</p>\n<h2>What it does:</h2>\n<p>The system has two components, which work together for enhanced sensitivity to changes in land use.</p>\n<ul>\n<li>Change detection for early intervention in vulnerable sites.</li>\n<li>Land classification to monitor land use and identify conflict palm areas.</li>\n</ul>\n<p><strong>Change Detection</strong>\nUses spectral analysis to detect changes to satellite imaging in conflict areas. Using open source API's to detect changes in land use, and checking against data of certified areas. Using machine learning to highlight possible conflict zones to be highlighted. Web app receives updates from server displaying polygon to show location of land change. Images update every 5 days and one pixel represents 10m. </p>\n<p><strong>Land Classification</strong>\nA secondary system classifies Landsat 8 images by area class, these classes are Forest, Plantation, Water, Cloud. This classification allows the detection of conflict palm by comparing the areas classified as Plantation with the <a href=\"http://www.sustainablepalmoil.org/\" rel=\"nofollow\">SPOTT</a> database of Oil Palm plantations. This allows the model to estimate the legal and illegal output of each administrative region in indonesia as well as it's value.</p>\n<h2>How it was built:</h2>\n<p>Due to there different functions the models are built using different systems the results of which are then integrated.</p>\n<p><strong>Change Detection</strong>\nusing google icloud platform, debian8 and squl server. Python backend with a google map API interface. Data from Sentinel2 MSI (multi spectral interface ) using 2,3,and 4 correspondence to re, green and blue band width bulian cirrus data. Python back end with opencv API implementing a function which subtracts last Sentinel-2 as a baseline. update data reference to change of potential conflict areas are identified by opencv subtract method. subtract baseline from updated data to give geospatial sat of polygons (defence) corresponding to area of potential conflict. exported as a vector to google map API. stored as a squl. </p>\n<p><strong>Land Classification</strong>\nThe area class classifier was built using TIFF files from landsat 8, the area in the test is south Kalimantan, specifically the administrative regions of Seruyan and Kotawaringin Timur. The Tiff files are loaded into R along with shape files defining areas of Water, Cloud, Plantation and Forest, a multilevel XGboost model is then trained and tested, before being deployed to classify the entire map. The resulting classifier is then replotted as a map. Once done the map is compared with known plantations and conflict palm identified</p>\n<h2>Challenges faced:</h2>\n<p>The biggest challenge is time. the ability to create a working model in such a short time frame.\nLearning to work with TIFF files and Geospatial data was challenging especially, given the size and moving them around in the cloud.</p>\n<h2>Accomplishments that we are proud of:</h2>\n<p>The system provides an early detection , especially useful in hard to reach areas that could go unidentified for long periods of time. Thus helping to maintain the biodiversity of the local area.</p>\n<p>The predictive model is very accurate having prediction accuracies in the high 90's. The ability to convert the observed oil palms into a dollar value is also helpful to help non-specialists appreciate the size of the issue. Incorporating SPOTT data to quantify conflict is very helpful and allowed us to make statement about the state of conflict palm based on real data as shown in the table below.</p>\n<table class=\"responsive\">\n<tbody><tr> <th> </th> <th> key </th> <th> value </th> </tr>\n<tr> <td> 1 </td> <td> Location </td> <td> Seruyan </td> </tr>\n<tr> <td> 2 </td> <td> Total Plantation (Km^2)</td> <td> 1426 </td> </tr>\n<tr> <td> 3 </td> <td> Legal Plantation (Km^2)</td> <td> 749 </td> </tr>\n<tr> <td> 4 </td> <td> Conflict Plantation (Km^2)</td> <td> 677 </td> </tr>\n<tr> <td> 5 </td> <td> Total Forest (Km^2)</td> <td> 1157 </td> </tr>\n<tr> <td> 6 </td> <td> Estimated Production (Tonnes)</td> <td> 526194 </td> </tr>\n<tr> <td> 7 </td> <td> Percent Conflict </td> <td> 47% </td> </tr>\n<tr> <td> 8 </td> <td> Production Conflict (Tonnes)</td> <td> 247311 </td> </tr>\n<tr> <td> 9 </td> <td> Value Conflict (MUSD) </td> <td> 171 </td> </tr>\n</tbody></table>\n<h2>What we learned :</h2>\n<p>How satellite imagery can be used to identify land. That changes can be identified on a regular time intervals. The extent of current deforestation levels and the need for action. Time - creating an idea and concept takes longer than a couple of days. </p>\n<h2>What's next for Reading Palms?</h2>\n<p>The combination of change detection and land classification systems reduces computational load so improving scalability. As a result the system can be used to identify any changes in land mass use, across the globe.\nThis can include other conflict  areas, or to track progress of reforestation projects.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mysql\">mysql</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/opencv\">opencv</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/r\">r</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://docs.google.com/presentation/d/1TO-Nqf_BKplNo5TvASG67vru5WIlrHDgn1-0eNUQOSg/edit?usp=sharing\" rel=\"nofollow\" target=\"_blank\" title=\"https://docs.google.com/presentation/d/1TO-Nqf_BKplNo5TvASG67vru5WIlrHDgn1-0eNUQOSg/edit?usp=sharing\">\n<i class=\"ss-icon ss-link\"></i>\n<span>docs.google.com</span>\n</a></li>\n<li><a href=\"https://github.com/JonnoB/ReadingPalms\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/JonnoB/ReadingPalms\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Created the classifer for differentiating between, plantations and jungle.", "", ""]], ["Understanding Deforestation through Civic Engagement", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Check out our PowerPoint at the link below!</h2>\n<p>Questions? Problems viewing the slides? Don't hesitate to reach out: jrogers (at) hmc (dot) edu</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/flask\">flask</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mysql\">mysql</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/twilio\">twilio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google-maps\">google-maps</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://drive.google.com/file/d/0B2vRpwuXmpjaRFJUNFpLcGJUaFU/view?usp=sharing\" rel=\"nofollow\" target=\"_blank\" title=\"https://drive.google.com/file/d/0B2vRpwuXmpjaRFJUNFpLcGJUaFU/view?usp=sharing\">\n<i class=\"ss-icon ss-link\"></i>\n<span>drive.google.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["Save the Elephants!", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/5Zu09TmB3NA?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"Save the Elephants! – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/515/datas/gallery.jpg\"/>\n<p>\n<i>Screenshot</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Save the Elephants! – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/602/datas/gallery.jpg\"/>\n<p>\n<i>Screenshot</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Save the Elephants! – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/603/datas/gallery.jpg\"/>\n<p>\n<i>Screenshot</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>\"Save the Elephants!\" is a video game aimed at raising awareness and reducing demand for wildlife products.</p>\n<p>The game is a simulation of the global wildlife trading economy with the goal of preventing elephants from going extinct. The economy features entities such as wildlife populations, poachers and consumers of wildlife products. Players can spend their limited budgets on preservation efforts in different areas, such as increasing law enforcement to combat poachers, investing in regeneration schemes to rebuild elephant populations, and conducting PR campaigns to reduce demand for illegal ivory.</p>\n<p>The economy is dynamic and adapts to the players actions. For example, if a player reduces demand for wildlife products in one area might reduce poaching activities in another area but in turn increase the poaching activity and demand in other areas. These _ emergent _ characteristics of the game demonstrate that tackling the illegal ivory trade is a complex issue, requiring approaches on multiple fronts.</p>\n<p>By letting players experience virtual extinction events, we aim to raise awareness about the pressing issue of global wildlife trade and reduce the social acceptance for wildlife products.</p>\n<p>The game can be easily extended to a larger-scale simulation, or a mobile cooperative multiplayer game with in-game events based on real-world data. There are also potential applications outside of gaming e.g. in decision support or science.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--2\">c#</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/scala\">scala</a></span></li><li><span class=\"cp-tag\">spatialos(improbable)</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/improbable-io/Zoohackathon\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/improbable-io/Zoohackathon\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["Fauna Voyage", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Fauna Voyage – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/429/datas/gallery.jpg\"/>\n<p>\n<i>Fauna Voyage</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Fauna Voyage – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/614/datas/gallery.jpg\"/>\n<p>\n<i>Game Feature</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Fauna Voyage – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/615/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Fauna Voyage – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/616/datas/gallery.jpg\"/>\n<p>\n<i>Game/Story Feature</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Fauna Voyage – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/617/datas/gallery.jpg\"/>\n<p>\n<i>Features </i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Fauna Voyage – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/618/datas/gallery.jpg\"/>\n<p>\n<i>First user interaction </i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>​Wildlife trafficking is one of the world’s most nefarious challenges. Trafficking in poached and living wildlife is decimating populations of iconic animals such as elephants, rhinos, and tigers. More quietly, the world faces the permanent loss of fauna as diverse as pangolins and tortoises. Local communities are losing livelihoods and their natural identities and are becoming literal battlegrounds in a fight for survival. The once occasional link between wildlife trafficking and gun, drug, and human trafficking is now a highway that involves transnational organized criminals. This illegal trade is driven by demand for exotic pets, delicacies, jewelry, decorations, and traditional medicines. Even countries that are not destination markets can play roles as transit routes. The rate of trafficking has spiked over the last few years, and time is against us. The United States, United Kingdom, Australia and others are leading international efforts to stop this scourge and bring kingpins to justice. But can we do more to bring new tools and approaches to the table? How can we change attitudes, raise awareness, and enable consumers to make informed choices to support wildlife-based tourism and reduce the demand that fuels this global threat?</p>\n<p>The mission of San Diego Zoo Global is to save species worldwide by uniting our expertise in animal and plant care and conservation science with our dedication to inspiring passion for nature. Using our family of brands to differentiate our campuses, projects, and initiatives, we strive to be at the forefront of wildlife conservation and education.\nforefront of wildlife conservation and education.</p>\n<h2>What it does</h2>\n<p>International travelers often unknowingly purchase wildlife items made from endangered or protected species and attempt to import them back into their home country. \nProvides information about: \n-Crafts or  products made from endangered species. \n-Share your experiences and stories about the animals that are endangered.\n-Uploading photos: Implementing an image search can identify how likely that image may pertain to an endangered species.\n-An interactive game that shows the tourist that reveals a tourist knowledge of animals related to poachers.\n-Game: If you play the game then the app will display a question and also four pictures that the user will be able to choose from. The user will make their selection and then there answer will lead to another page which will show the correct answer as well as other information on the animals. If you choose picture then the app will take you to a page that shows many pictures involving poaching and what items are made from animals. These will help inform the user. If you click on story it will take the user to a page that shows the stories of different animals and the story describes their endangered lives.\n-Advertisement of local sustainable products.</p>\n<h2>How Fauna Voyage was built</h2>\n<p>Android Studio \nTerminal\nSublime\nQT </p>\n<h2>Data; building a database of endangered species</h2>\n<p>CITES.org contains the classification of the endangered species.\nIUCN red list contains the images of the animals and the classification of the endangered species.\nWe collected byproducts information from different sources such as: US fish and Wildlife services and other agencies.\nBuild a database of approved vendors that offer alternative items that benefit wildlife.</p>\n<h2>What's next for Fauna Voyage</h2>\n<p>TBD.</p>\n<h2></h2>\n<p>CONTACT:\n<a href=\"https://twitter.com/fauna_voyage\" rel=\"nofollow\">https://twitter.com/fauna_voyage</a>\n<a href=\"mailto:h4ck.fauna.voyage@gmail.com\" rel=\"nofollow\">h4ck.fauna.voyage@gmail.com</a></p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/photoshop\">photoshop</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/react\">react</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--3\">c++</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/StefanRetief/ZooHackathon\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/StefanRetief/ZooHackathon\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"https://twitter.com/fauna_voyage\" rel=\"nofollow\" target=\"_blank\" title=\"https://twitter.com/fauna_voyage\">\n<i class=\"ss-icon ss-link\"></i>\n<span>twitter.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Cloud / Task Manager\nWebsite Bootstrap HTML,css ->React java\nUX Android Studio \nPhotoshop Logo\n", "I worked on the layout for the apps function. Mainly i worked on the game, story, and picture layout on android studio. It was difficult because it was my first time using android studio.", "This was the first time that I have ever coded in any other language than c++ which made it harder for me. I worked mostly frontend stuff which was the layouts for the options page, story page, game page, and the alternative/correct answer page for the app and helped clean up some of the other pages. Javascript  was a bit difficult but was very fun to learn. I also learned alot about team collaboration through github. ", "", ""]], ["econscience", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h1>eConscience</h1>\n<p>A project from the ZSL zoohackathon. A chrome extension that helps users be more responsible in what they buy and surf. The ideas is to educate and promote positive action.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/jamiebrown201/econscience\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/jamiebrown201/econscience\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", "", "", ""]], ["exclamation", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h1>README</h1>\n<p>This project was inspired by a serendipitous meeting during the Zoohackathon of 2016.\nWhile my teammates - @csaminak, @jootse84, and @nevillelauren - and I worked on a separate app at the hackathon (which we hope to release an alpha version of soon!), some members of the LAGA and Eagle groups from Uganda and Cameroon visited the National Zoo and told the group about what they did and some of the challenges they faced.</p>\n<p>One of the challenges they highlighted in particular was that they have very little specialized technology to support their jobs. In particular, this becomes especially problematic when they get into difficult or even dangerous situations. When this happens, they're currently forced to rely on tools like WhatsApp to manually tell their colleagues their location and ask for help.</p>\n<p>Hearing this story inspired my teammates and I to take immediate action. We believe that wildlife trafficking is a serious issue sorely in need of attention at the international stage - and nowhere is that clearer than the plight of the rangers that stand at the very heart of this problem.</p>\n<p>Based on what the rangers told us, we built a panic button app that:</p>\n<ul>\n<li>Allows you to set a specific group of phone numbers and email addresses to send emergency broadcsts to</li>\n<li>Broadcasts your location to that while open via:\n\n<ul>\n<li>SMS (On open, then every time you move substantially and every 5 minutes)</li>\n<li>A fallback technology - due to limitations in the WhatsApp and Email APIs available to us, we could not find a way to simply send a WhatsApp message or Email without having to open a client. Thus, we decided to allow the rangers and enforcement officials to set up a fallback technology, and when an emergency happens, <em>first</em> broadcast the location of the ranger via SMS, <em>then</em> open up the secondary app and allow them to send the (automatically created) message.</li>\n<li>The currently available fallback technologies are:\n\n<ul>\n<li>WhatsApp (The rangers' communication tool of choice)</li>\n<li>Email (A similar fallback mechanism that can be transmitted through either a data connection or WiFi)</li>\n</ul></li>\n</ul></li>\n</ul>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/objective-c\">objective-c</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/sahiltalwar88/exclamation\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/sahiltalwar88/exclamation\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I was one of the core developers. My contributions include repo & React Native setup, email gathering & sending, and settings amongst others. I worked directly with Jose on core features, and helped introduce Samina and Lauren to the project and React framework so they could both learn and contribute. ", "I helped with some of the debugging and research associated with it. This was my first time being introduced to building a mobile app and working with React Native, so there was definitely a learning curve and lots of research to try to understand the language.", "I was with Sahil working on the core of the application. I mainly was in charge of the SMS broadcast and whatsapp share features."]], ["Animals alive", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>The illegal wildlife trade is a serious issue that requires our attention. People involved are frequently not aware of the issues and education is desperately needed to protect the world’s wildlife.</p>\n<h2>What it does</h2>\n<p>Animals alive is an educational portal designed to spread awareness about endangered wildlife and the threat of illegal trade across Southeast Asia. </p>\n<p>The Animals Alive hub aims to build connections, matching volunteers with schools and education experiences in order to deliver curriculum based content (linked to English as a second language lessons) to educate people about endangered animals and wildlife products and what can be done to help. Teachers will also have access to lesson content through an online toolkit.</p>\n<p>People will be driven to website by zoos, volunteering websites and general travelers who want to make a difference.</p>\n<h2>How we built it</h2>\n<p>Jimdo website builder</p>\n<h2>What's next for Animals alive</h2>\n<p>For our online hub to be used internationally to share information and create educational materials, to inspire people to help fight these issues, via volunteering, donating etc.</p>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://animals-alive.jimdo.com/\" rel=\"nofollow\" target=\"_blank\" title=\"http://animals-alive.jimdo.com/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>animals-alive.jimdo.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["Shujaa", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Shujaa – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/677/datas/gallery.jpg\"/>\n<p>\n<i>Rangers: heros for conservation</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h1>SHUJAA: Rangers vs. Poachers</h1>\n<h2>Become a hero</h2>\n<p><a href=\"https://prezi.com/qmeivgnx_gwz/shujaa/\" rel=\"nofollow\">Read the presentation / Watch the demo</a></p>\n<p>An Epic adventure featuring the grandson of a shaman/sangoma who uses previously unknown  powers as he leads battle-hardened Rangers for United Africa, on a quest to battle a demonic international poaching ring across West and sub-Saharan Africa, by land, air, and sea. </p>\n<p>In 2025, most of sub-Saharan Africa, including Hausa, Igbo, Banda, Mande, Maasai, Fulani, Yoruba, Akan, Shona, Zulu, Ashanti nations, have united as a democratic multi-state republic. The Pan-African law enforcement agency tasked with apprehending poachers is led by Shujaa, the commander. </p>\n<p>One day, Shujaa’s reconnaissance team encounters strange evidence near a murdered elephant and her calf. Unlike anything he’s seen before, he uses satellite communication to contact the main base, which alerts him that a drone has spotted a group of poachers leaving the scene, headed to a bush plane.  In an armored vehicle he pursues the band of renegades, but encounters supernatural resistance: monsters, with elemental powers. Shujaa continues pursuit and manages to capture, with cunning and bravery, one of the monsters, who reverts to human form, alerting him that the poacher gangs have allied with something unexpected and unknown. </p>\n<p>Looking for answers, Shujaa visits his grandfather, who explains an ancient legend that may be coming true in the new era. The poachers are getting supernatural help from demons that thrive on war, bloodshed and violence who have been suppressed by the unity of Pan-Africa. The endangered animals they are killing represent a sacrifice which the villains need to maintain their evil powers. </p>\n<p>Shujaa’s quest begins after his grandfather, Ade, passes away, admonishing him to pursue the path of peace, vanquishing evil with as little bloodshed as possible. He will be with him throughout his journey. Ade will send guides and helpers along the way. </p>\n<p>In hot pursuit of the villains (and trying to track down the Kingpins), Shujaa must do detective work and chase poachers, neocolonialists, and assorted enemies, some human, some monsters: through the tropical forests of the Congo, on the plains and veldt of the Serengeti, the national preserves and parks of Zambia, Kenya and Botswana, down rivers and up mountains (Kilimanjaro in Tanzania), and across the big cities of Lagos, Yaounde, Cape Town, and Nairobi, as well as the sacred city of Ile Ife. He chases them on foot, in a jeep, on a motorcycle, helicopter and wingsuit jumping off the cliffs of the Capes in South Africa. As he conquers and arrests foes, and frees trapped and/or possessed animals or their orphaned offspring, he encounters Bosses/kingpins with a variety of magical powers. Locust swarm demons who fight as a colony creature but dissolve into crickets as a defense; a lightning fast rhino monster that stands like a man (defeating him releases the animal’s trapped spirit); an elephant monster than can reach over any distance with its supernatural trunk; a lion whose roar can knock an enemy back a hundred feet. \nAll of these bosses and pursuits are punctuated by visits from Ade, his grandfather, who shows him how to find magic in various places, with the help of children, potions, music, and a Giant Baobab tree with a passage to a secret world. Villagers throughout his journey need protection but also help defend the helpless and the needy. </p>\n<p>The culmination of Shujaa’s quest is at Victoria Falls. Finding a doorway behind the waterfall, Shujaa faces his greatest threat,  Ingquza, the evil Bloodshed Demon, with elemental and mind control powers, who has been sending harm to the innocent people and animals of United Africa. Shujaa must use all of his skills, magic, and creativity to defeat the attacks and hallucinations fired at him by Ingquza. </p>\n<p>He emerges victorious, and throughout the states of Africa storms and fires subside, animals escape from poachers, and peace reigns once more.</p>\n<hr/>\n<blockquote>\n<p>\"Being a ranger was not a choice but a calling,\" says Stephen Midzi, whose base is Shangoni Post in Kruger. \"I was born for this, so had to fulfill what has already been written in my book of life.\"</p>\n</blockquote>\n<p>Others obtain solace from the place they love. Kruger's Midzi puts it this way: \"To sit among a pride of lions and hear \nthem roar in synchrony, that's a moment that always renews my energy.\"</p>\n<blockquote>\n<p>“This is not just one group. It’s not the African poachers, it’s not China, it’s everyone. It takes governments in Africa actually doing something about the poachers on the ground; it takes an education system to teach the people — kids in the schools, the villagers — telling them it’s wrong. The same applies to people in Asia, who are buying the stuff,” said Young. “It shouldn’t be easy to buy ivory. It shouldn’t be taken lightly.”</p>\n</blockquote>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li><li><span class=\"cp-tag\">heart</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://cwillisf.github.io/ZooHacks2016-Shujaa/Doc.html\" rel=\"nofollow\" target=\"_blank\" title=\"https://cwillisf.github.io/ZooHacks2016-Shujaa/Doc.html\">\n<i class=\"ss-icon ss-link\"></i>\n<span>cwillisf.github.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Originated the script, concept, vision for the game.", "", "", "", "", "", ""]], ["Ranger Danger ", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Ranger Danger  – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/693/datas/gallery.jpg\"/>\n<p>\n<i>Title screen</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Ranger Danger  – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/424/695/datas/gallery.jpg\"/>\n<p>\n<i>Gameplay</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Games like candy crush and tiny tower are incredibly successful at generating funds via a freemium in-app purchase model.  We wanted to utilize a similar model to generate charitable donations to real-world wildlife conservation efforts via an addicting and entertaining anti-poaching tower defense strategy game based off of real-world information and scenarios.</p>\n<h2>What it does</h2>\n<p>Ranger Danger is a 8-bit two dimensional tower defense styled strategy game modeled after real world wildlife conservation areas.  Players adopt the role of the head warden or ranger at a conservation area, and utilize the resources available in that area to halt and deter poaching efforts.  Resources within the game are based upon real world resources available to the groups maintaining the selected range the player controls, with similar budgetary constraints and expenses within the game.  Real world information of funding sources and amounts, ranger statistics, animal motion patterns and varieties are attained from partner conservation groups that are featured and utilized in the game.  The game utilizes a freemium model to allow in-app purchases that augment the playing experience, with funds generated being donated to the institution featured in the level the player is playing.  Current working demo features the Sioma Ngwezi National Park, with the game background featuring a map of the park and it's location within Zambia, and focuses on Elephant conservation.  </p>\n<p>The player is greeted with a chiptune rendition of the Zambian national anthem, and Zambian national colors and iconography are features throughout the game.  This is an example of future development plans, with each conservation group and region relying on regional themes.</p>\n<h2>What's next for Ranger Danger</h2>\n<p>In the future we plan to further develop the game mechanics to allow for more real-world actors within the selected environments, allowing for the education of the role of communities, criminal syndicates, informant networks and other anti-poaching factors within the game.  We plan on making the app available on multiple platforms, and creating multiple levels in direct partnership with various conservation agencies to increase awareness of conservation efforts on a global scale.  We also plan on further developing game features, to allow for a variety of real world anti-poaching techniques within the gameplay, to increase educational awareness of the current anti-poaching efforts.</p>\n<h2>How to play</h2>\n<p>Go to:</p>\n<p><a href=\"https://github.com/devonmurphy/RangerDanger\" rel=\"nofollow\">https://github.com/devonmurphy/RangerDanger</a></p>\n<p>Download the zip file and uncompress it.</p>\n<p>For Mac: open application.macosx/zoohackathon_game</p>\n<p>For Windows: open application.windows64/zoohackathon_game.exe</p>\n<p>Place rangers around the reservation in order to protect your elephants.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/processing\">processing</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/devonmurphy/RangerDanger\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/devonmurphy/RangerDanger\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I wrote code and helped create the game mechanics.", "Developed pathfinding and AI of poachers. Helped code and squash bugs. Researched potential future expansions to incorporate more real-world aspects to game mechanics.", "Created Pixel Art sprites and background graphics for the game.  Composed and created chiptune based soundtrack for gameplay and title screens.  Conducted research on real world conservation locations and selected the demo location, as well as researched and selected future candidates for game development.  Brainstormed and created ideas for future game expansion and charitable fundraising aspects."]], ["Wildcoin", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Wildcoin – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/425/003/datas/gallery.jpg\"/>\n<p>\n<i>Wildcoin homepage</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h1>Wildcoin</h1>\n<h2>Overview</h2>\n<p>Wildcoin is a peer to peer conservation donation platform and a universally unique identifier (UUID) for endangered species allowing donors interested in funding conservation to target donations directly at where they will have the greatest impact - the actual conservationists working to save it.</p>\n<p>Each species is assigned a UUID so products (a label on the back of a soft toy pointing directly to the species and donations), campaigns and articles across the world can create a quick link to its species page on the site. This page lists the four avenues of donation, donating to a species, an organisation, a conservationist directly or a a threat (wildlife trade for example).</p>\n<h2>Donation avenues</h2>\n<h3>Donating to the species</h3>\n<p>Donations to the species will be collected and divided up automatically between all conservationists and organisations verified as working on the species.</p>\n<h3>Donating to an organisation looking after a species</h3>\n<p>Donations will be directed to that conservation organisation's general pool but they'll see which species the donation is directed to so they can direct funding appropriately and see what is popular with donors.</p>\n<h3>Donating to a conservationist or scientist directly</h3>\n<p>Verified organisations can verify conservationists that work directly on their projects so the money goes straight to where it matters. Within this level the conservationist can register targets and goals (which would be shown by a funding thermometer) so donors can pick what they want to fund (equipment, time...) much like the popular crowdfunding model.</p>\n<h3>Donating to a general campaign about a threat or issue</h3>\n<p>Species on the site will be grouped within threats, for example \"Wildlife Trade\" so donors can donate directly to that and have the money assigned to the organisations and people that matter.</p>\n<h2>Monthly and one-off donations</h2>\n<p>Donors can simply step through the site without registering to donate quickly or they can sign up for a monthly donation and whenever they want, allocating how much of their donation should go to a specific thing. </p>\n<h2>Updates from conservationists to donors</h2>\n<p>Upon donating, donors can receive updates via targeted newsletters based on exactly what they are donating to. Conservationists and organisations will have methods to plug in news, photo and social media feeds that link directly to the site and are sent out to relevant donors keeping them up to date with the work they are doing.</p>\n<h2>Ideas on how the money will be stored and project could be funded</h2>\n<p>Donations could be stored in a general pot that is then assigned out to conservationists (using various methods to ensure that the money gets to the right place which is often difficult when it comes to remote field workers). Because of this, the interest from these donations could possibly contribute towards funding the running of the application without having to take a cut from donations like most donation sites.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li><li><span class=\"cp-tag\">drupal</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://wildcoin.filipnest.com/\" rel=\"nofollow\" target=\"_blank\" title=\"http://wildcoin.filipnest.com/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>wildcoin.filipnest.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["As a conservation science PhD student, I mainly contributed ideas, gave context and helped present the project. ", ""]]]