[["AquaSource", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"AquaSource – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/503/datas/gallery.jpg\"/>\n<p>\n<i>View of Undrinkable Water Sources</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"AquaSource – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/350/datas/gallery.jpg\"/>\n<p>\n<i>Testing Spectrometer with Crude Oil</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"AquaSource – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/348/datas/gallery.jpg\"/>\n<p>\n<i>Assembling Spectrometer</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"AquaSource – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/349/datas/gallery.jpg\"/>\n<p>\n<i>Assembling Spectrometer</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"AquaSource – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/498/datas/gallery.jpg\"/>\n<p>\n<i>Home Screen</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"AquaSource – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/499/datas/gallery.jpg\"/>\n<p>\n<i>Select Contaminant Type</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"AquaSource – screenshot 7\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/500/datas/gallery.jpg\"/>\n<p>\n<i>Machine Learning Sample</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"AquaSource – screenshot 8\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/502/datas/gallery.jpg\"/>\n<p>\n<i>Blank Calibration of Spectra</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"AquaSource – screenshot 9\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/501/datas/gallery.jpg\"/>\n<p>\n<i>Spectra Analysis</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Our application is built to solve the problem that many people don't have access to clean water. This is either because they don't know where to find it, or don't know how to tell what water sources near them are cleanest.</p>\n<h2>What it does</h2>\n<p>Our application lets users crowd-source water quality data. Users use our cheap spectrometer (constructed out of a phone + $10 of materials) to identify the presence of contaminants in water sources. The results of every test are uploaded to an AWS database that lets users who do not have access to a spectrometer look up water quality in their area. To do this we leveraged Mapquest, AWS lambda functions, DyanmoDB, and the AWS API gateway.</p>\n<h2>More info for those who are interested:</h2>\n<h2>How we built it</h2>\n<p>Hardware:\nWe built a spectrometer using the iPhone's camera. At one end, we have an LED source that emits light at a wavelength of 405 nm. We then direct this light so that it passes through a broken CD and then into the iPhone camera's lens. The broken CD acts like a prism, and splits the light into its component wavelengths (basically a rainbow). This allows the camera to easily see what wavelengths of light are being emitted at the source.</p>\n<p>So far what I've described just tells us what the wavelength of the light being emitted is. The next step is to make the light pass through the liquid we want to identify. As we know, water lets all wavelengths of light pass through it equally. On the other hand, contaminants (bacterial or otherwise) found in water both attenuate different wavelengths of light in unique ways, and fluoresce (re-emit the light at different, lower energy wavelengths). These attenuation/fluorescence 'fingerprints' mean that the wavelengths of light that reach the camera are unique based on the liquids that we've placed in our spectrometer.</p>\n<p>Software:\nThe software consists of two main parts:</p>\n<p>Front end:\nThe front end is an iOS phone app that uses MapQuest and GPS information to display water quality information near the user's location. It queries our backend through an AWS API that returns the crowdsourced water quality information. If people have access to a homemade spectrometer (like the one we created), they can contribute to our water-quality database by taking water quality readings with the application. These readings are automatically uploaded to the database.</p>\n<p>Back end:\nThe back end of our application consists of two AWS lambda functions and a DynamoDB database. The lambda functions take care of adding and retrieving water-quality information to/from the database. To determine whether the water is drinkable, we implemented a machine learning algorithm.</p>\n<h2>Challenges we ran into</h2>\n<p>Going into this Hackathon, none of us had much Swift development experience. We ran into all sorts of issues because of this. In addition, we had never used AWS, and had never built a spectrometer, so it was a great learning experience for us all. I won't enumerate all of the specific challenges we ran into because there would be too many to list.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Everything we built! We are happy to have a mostly working spectrometer that lets people cheaply detect the presence of contaminants in their water supply. We are also very happy that this information is crowdsourced so that people know where to go to find the cleanest water without having to take tens of readings themselves.</p>\n<h2>What we learned</h2>\n<p>Swift, DynamoDB, AWS lambda functions, AWS API gateway, and how to cheaply build a spectrometer</p>\n<h2>What's next for AquaSource</h2>\n<p>We are hoping to flesh out our MVP so that it will be more scalable and can actually be used on a large scale.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/amazon-web-services\">amazon-web-services</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/amazon-dynamodb\">amazon-dynamodb</a></span></li><li><span class=\"cp-tag\">amazon-lambda</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mapquest\">mapquest</a></span></li></ul>\n</div>\n</div>", ["I worked on using Swift to interact with our API of crowdsourced water quality information, accessing current longitude/latitude coordinates, and parsing the bitmap image to get wavelength vs color intensity information to be fed into the machine learning model", "Created iPhone UI and flow", "I implemented machine learning algorithms to analyze spectra and built hardware.", "I built the API that enables crowd-sourcing of water quality information", "Connected with the MapQuest API to generate the map with markers. "]], ["Expresso", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Expresso – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/432/999/datas/gallery.jpg\"/>\n<p>\n<i>Launch</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Expresso – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/001/datas/gallery.jpg\"/>\n<p>\n<i>Request Help</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Expresso – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/002/datas/gallery.jpg\"/>\n<p>\n<i>Help Request Feed</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Expresso – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/433/000/datas/gallery.jpg\"/>\n<p>\n<i>Chatroom</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>We got the idea for this app when recently a GSU student committed suicide. Many people around us have personal problems that may affect their lives in an unpleasant way and we thought we could make an app that can help resolve that. </p>\n<h2>What it does</h2>\n<p>This app connects people who are not emotionally feeling very well to individuals who can help them through a one on one chat or a group chat. </p>\n<h2>How we built it</h2>\n<p>We built this app using Swift in the front-end and firebase in the backend. </p>\n<h2>Challenges we ran into</h2>\n<p>We ran into many github merge conflicts, complexity of scope of the app, UI design, and the research had to do since our app required us to research human psychology, color theory etc.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We are to implement dynamic realtime content, as well as having a good UI design. Also the feeling of creating something that can actually help people. </p>\n<h2>What we learned</h2>\n<p>Some of our team members were new to IOS, so it was their first time working with IOS apps. We learned a lot about Watchkit, and also how to use firebase. </p>\n<h2>What's next for Expresso</h2>\n<p>We are planning to deploy to the app store as soon as possible.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xcode\">xcode</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/sql\">sql</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/json\">json</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/firebase\">firebase</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/love\">love</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/youngvz/Expresso\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/youngvz/Expresso\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I helped develop the UX and UI, and helped develop some of the front end. Research about human psychology, emotions, and color theory. Worked on apple watch app. ", "Team Lead for the iOS App. Developed the UI and architected and integrated the  backend from Firebase", "I helped to design the UI and UX of the application by working on the constraints of certain views within the application. I helped bring the idea into fruition. I also helped to start the watch application and worked on it.", "Design Lead for iOS app. Researched and developed a unique color scheme and layout. Designed the logo and wrote miscellaneous code."]], ["NoTypePass", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>The growing fields of Artificial Intelligence and Biometrics led the the fusing of the two concepts to produce a innovative and useful program that learns how an individual types in order to authenticate them instead of using a password. </p>\n<h2>What it does</h2>\n<p>NoTypePass generates random sentences for the user to type, records data related to each key event, such as when a key is pressed or when it is released, and then finally sends the data to a machine learning algorithm to either train the algorithm to learn how you type or to authenticate a user by categorizing your typing style to a previously learned pattern. </p>\n<h2>How we built it</h2>\n<p>Using PyGame, we built a simple GUI that displays the random sentence to type and provides a place to type the sentence. PyGame also manages the event keys, and time.time() records the start and end time of each individual event. All of this data is stored in an object representing a Key press event, and then a Parser class uses several loops to sift through the data and calculate usable information, such as the average time between each possible combination of key presses, and the average amount of time each key has been pressed. All of this data is then written to a text file, while allows for easy organization of different users in the application and the machine learning algorithm. The machine learning algorithm looks at a large set of data from several different perspectives, and then creates a mathematical function to approximate it. This function is then used to categorize new data into a previously learned pattern, in order to authenticate a user.  </p>\n<h2>Challenges we ran into</h2>\n<p>Recording and formatting precise, usable data of staggered key press events required several complex nested loops and recursive functions, which required several hours of planning and rewriting code. The amount of raw data that was produced was a much larger quantity than we first expected, and therefore we had to adapt. Training and perfecting the machine learning algorithm in order to yield the most accurate possible approximation also took several hours. Finally, typing random sentences for hours in order to produce the necessary data to train the machine learning algorithm was painstaking. </p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We were able to produce a program that accurately records unique data about how a person types, in a format that is usable by a machine learning algorithm. We were also able to develop a machine learning algorithm specific to this application, and produce data to train the algorithm and accurately categorize new data into already existing patterns in order to authenticate a user. </p>\n<h2>What we learned</h2>\n<p>Everybody on the team became much more confident in the Python scripting abilities, and we all learned how to organize and manipulate large amount of data. We also learned about different machine algorithm approaches and how to train them to be more accurate. </p>\n<h2>What's next for NoTypePass</h2>\n<p>The concept of NoTypePass can be applied to a lot of different uses. We started the development of a Google chrome extension to work like the Chrome password manager, using keystroke dynamics to authenticate a user instead of a Google account login, and autofill these stored passwords into a webpage. We also plan to create a Unix and Windows services to record keystroke information in the background, to more efficiently and effectively learn how a person types while they work on homework or they next hackathon project. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/numpy\">numpy</a></span></li><li><span class=\"cp-tag\">sci-kit-learn</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/pygame\">pygame</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/camcrae/typepass\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/camcrae/typepass\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on the word/passphrase generation, hashing the master password for storage, etc., and assisted in creation of the data calculations we used as our input data (averages, patterns, masterlist, key pairs, etc.)", "I worked on the GUI and the data recording and organizing. ", "I wrote the machine code to recognize patterns in the typing recognition application. I also assisted my team with creating the major data structure of the program."]], ["Haptic Vision", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Haptic Vision – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/698/datas/gallery.jpg\"/>\n<p>\n<i>The Haptic Vision Team!</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Haptic Vision – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/658/datas/gallery.jpg\"/>\n<p>\n<i>The Entire Training and Detection Setup</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Haptic Vision – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/691/datas/gallery.jpg\"/>\n<p>\n<i>Schematic for the Vibration Motor Circuit</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Haptic Vision – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/690/datas/gallery.jpg\"/>\n<p>\n<i>Brandon plugged into the Matrix</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h1>One Summary</h1>\n<p>Haptic Vision provides a low-effort, high-impact way to learn to see and communicate unobtrusively, especially for the visually impaired. </p>\n<h1>Inspiration</h1>\n<p>Passive Haptic Learning (PHL) allows people to learn muscle memory through vibrations while paying little to no attention to the stimuli. With the help of cheap ubiquitous electrical elements like microcontrollers and vibration motors, anyone can easily build a system to passively acquire tactile skills like learning how to play an instrument, reading braille, and using morse code. An offshoot of PHL is Passive Haptic Rehabilitation (PHR), which has allowed patients with spinal cord injuries to more than double their recovery rate with the same equipment.</p>\n<p>Sensory Substitution is the effect that one type of sensory stimuli can be changed into another type of sensory stimuli. For example, visual information can be conveyed and perceived through our other senses, such as sound or touch. In this project, we substituted one's sense of sight with their sense of touch, allowing people to \"see\" and \"listen\" with their skin using a haptic encoding from the vibration motor.</p>\n<p>We first learned about Passive Haptic Learning when Sarthak started working with Wearable Computing research at Georgia Tech. After <a href=\"http://delivery.acm.org/10.1145/2980000/2971768/p164-seim.pdf?ip=131.96.219.171&amp;id=2971768&amp;acc=ACTIVE%20SERVICE&amp;key=AA86BE8B6928DDC7%2E44E017FFD298019C%2E4D4702B0C3E38B35%2E4D4702B0C3E38B35&amp;CFID=685146611&amp;CFTOKEN=68497216&amp;__acm__=1477221140_6c712dc240f0408338ed4fb6843eb2d5\" rel=\"nofollow\">conducting research and running experiments on its effectiveness</a>, we were all amazed by how quickly the human brain was able to learn the encoding pattern which transformed the visual input through sensory substitution into the replacement vibrations. We realized that the potential number of meaningful applications was tremendous.</p>\n<p>With Sarthak and Ralph familiar with the timeline of hackathons, we drew on their collective experience and decided that the time window given was a perfect way to test the practicality of our project. </p>\n<h1>What It Does</h1>\n<p>Haptic Vision consists of three stages – a training stage, an object detection stage, and the blind communication phase. </p>\n<h2>Training Stage</h2>\n<p>In this stage, we teach the brain to make associations between the seemingly random vibration patterns felt on a forehead with the correct letters. We do this by first playing the sound of the letter we want the trainee to learn, and follow up with the vibration pattern corresponding to that character.</p>\n<h2>Object Detection Stage</h2>\n<p>In this stage, we use a deep convolutional neural network consisting of 32 different layers to process images captured from our laptop and understand the semantic contents of the image. The main job of the neural network is to classify images into a wide range of existing categories we used the same categories as the VGG-16. The network is able to understand what those objects are by continuously extracting higher level features from the pixels in an image. The first layers extract information like edges and shapes while the last layers contain much more abstract information about object positioning.</p>\n<p>We set up an experiment that could simulate conditions in which people with visual deficiency live in. We believe that this technology could potentially be used in the future to enable those people to be able to perceive objects through a haptic sensory extension. In order to do so, we place objects in a box, completely off the sights of our subject. Then, a camera is able to use AI to detect which objects are in the box and pass a signal to the haptic module. This enables the blind person to \"see\" and understand what those objects are through the haptic model, effectively restoring their capacity to perceive objects again</p>\n<h2>Blind Communication Phase</h2>\n<h1>How We Built It</h1>\n<h2>Hardware</h2>\n<p>The hardware circuit consists of a Arduino Uno controller, breadboard, and vibration motor. The electronic circuit was then securely attached to a hat, allowing for ease of wear for our testing subject.</p>\n<h2>Software to Communicate with Arduino</h2>\n<p>The Arduino itself runs in Arduino, which is in the family of C languages. We made a Python virtual environment to communicate with the Arduino using serial communication. Python acts as the gluing component in our software architecture, allowing the project to take information from the neural network and feed it into the Arduino.\nWe used the pySerial github repository to aid with this cross-device communication.</p>\n<h2>Neural Network</h2>\n<p>VGG16: 32 Layer Convolutional Neural Network whose architecture was originally envisioned by the VGG team.</p>\n<h1>Challenges We Ran Into</h1>\n<p>We had difficulty building the neural network to decipher handwritting and recognizing objects that weren't on the ImageNet dataset.</p>\n<h2>Hardware</h2>\n<p>There were several Arduino components that we could not use in this project due to lack of access.</p>\n<h2>Software Limits</h2>\n<p>We weren't able to get access to the Predix platform in time to deploy our Neural Network model to the cloud. That was unfortunate, since we believe that this could have had a great impact in the future. The AI software could have been used by multiple IoT devices and the platform could be used to constantly improve the quality of our service.</p>\n<h1>Accomplishments We Are Proud Of</h1>\n<p>We actually managed to train someone in a realistic setting! It only took a few hours for our volunteer to be able to decode the sensory input from the vibration motor into a meaningful substitution for vision. We were also able to enable people to directly write messages to Brandon through their computers. This means that, in the future, this technology could be used a a hands free form of messaging. The technology was also promising at object recognition, enabling Brandon to effectively \"see\" which objects were in the box through the device. This means that a future iteration of this project could be fully used to help blind users navigate their environments effectively. </p>\n<h1>What's Next for Haptic Vision</h1>\n<p>We plan to do further research on how much better this hack can get with the integration of multiple tactile motors in it. Brandon was able to easily read sentences and identify objects with only one motor for encoding the information, so we wonder how much better can we do if we had access to more motors in either a vest or belt using a grid design. We want to know if this could enable us to encode messages faster to our users or even pass in more complicated information. One cool application that could follow for a better haptic module would be teaching people how to sing or play musical instruments better, for example</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/arduino\">arduino</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/shell\">shell</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c\">c</a></span></li><li><span class=\"cp-tag\">deep-learning</span></li><li><span class=\"cp-tag\">convolutional-neural-networks</span></li><li><span class=\"cp-tag\">morse-code</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/hardware\">hardware</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/wolfram-technologies\">wolfram-technologies</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/sarthaksrinivas/haptic-vision\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/sarthaksrinivas/haptic-vision\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"https://docs.google.com/document/d/1OmzO0AFuZ-Iki91gvFv58UlYx-2Mpc4CyOJfQTGfvcw/edit?usp=sharing\" rel=\"nofollow\" target=\"_blank\" title=\"https://docs.google.com/document/d/1OmzO0AFuZ-Iki91gvFv58UlYx-2Mpc4CyOJfQTGfvcw/edit?usp=sharing\">\n<i class=\"ss-icon ss-link\"></i>\n<span>docs.google.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["As a Wearable Computing Researcher at Georgia Tech, I conducted research demonstrating Passive Haptic Learning's viability. I built the headset and training modules using Arduino, C, and Python, with Mathematica to automate some of the training process. I also trained Brandon (our subject) in Morse Code in 2 hours while he played videogames.", "Worked on integrating the machine learning intelligence modules with the Arduino hardware modules. Used Python and TensorFlow", "I worked on the arduino circuit and programmed the Haptic Module using Arduino, C, and Python."]], ["Cat Chat", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>We wanted to create a web app that rewarded positive discussion with cats.</p>\n<h2>What it does</h2>\n<p>Cat Chat is an online chat room. When a user enters text, the message is scanned for positive or negative words. If positive, the user's score increases which leads to more cool cat gifs. We are hoping that by giving a reward for positive behavior, we can discourage online harassment. It also has a spooky Halloween mode.</p>\n<h2>How I built it</h2>\n<p>We created the webapp with mostly javascript and php. The php code writes and reads from a text file which holds the messages in place of a database. Javascript was used for pretty much everything else. We used amazon web services to host the site.</p>\n<h2>Challenges I ran into</h2>\n<p>It was the first time building a webapp for everyone on the team. Learning how to use html, css, and javascript was very challenging. </p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Cat gifs. Lots and lots of cat gifs.</p>\n<h2>What I learned</h2>\n<p>Javascript, html, css, php, and using amazon web services. </p>\n<h2>What's next for Cat Chat</h2>\n<p>A more extensive algorithm for determining if a message is positive or negative. More cat gifs and more holiday themes.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/amazon-web-services\">amazon-web-services</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://catchat-1.2ug5mpe3f5.us-east-1.elasticbeanstalk.com/\" rel=\"nofollow\" target=\"_blank\" title=\"http://catchat-1.2ug5mpe3f5.us-east-1.elasticbeanstalk.com/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>catchat-1.2ug5mpe3f5.us-east-1.elasticbeanstalk.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["Pawsitivity", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Pawsitivity – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/431/539/datas/gallery.jpg\"/>\n<p>\n<i>Pawsitivity</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Pawsitivity – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/084/datas/gallery.jpg\"/>\n<p>\n<i>You're a wizard, Hairy!</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Pawsitivity – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/086/datas/gallery.jpg\"/>\n<p>\n<i>Witch of the West</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Pawsitivity – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/085/datas/gallery.jpg\"/>\n<p>\n<i>Rare Taco Cat says, \"You wanna taco 'bout it?\"</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Pawsitivity – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/090/datas/gallery.jpg\"/>\n<p>\n<i>Hawaiian cat</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Pawsitivity – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/098/datas/gallery.jpg\"/>\n<p>\n<i>I'M BATMAN</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Pawsitivity – screenshot 7\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/431/155/datas/gallery.jpg\"/>\n<p>\n<i>Aspiring chef</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Pawsitivity – screenshot 8\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/431/160/datas/gallery.jpg\"/>\n<p>\n<i>Chasing a butterfly</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Pawsitivity – screenshot 9\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/431/169/datas/gallery.jpg\"/>\n<p>\n<i>Sleepy cat</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Pawsitivity – screenshot 10\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/431/541/datas/gallery.jpg\"/>\n<p>\n<i>Halloween theme</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Everyone gets stressed out sometimes and mental health is slowly starting to be recognized as a concern for those in today's society. As college students, we experience anxiety and crippling depression first-hand. Our goal was to create a mobile application that will bring some sunshine to those who are feeling these negative emotions. Pawsitivity was the result. </p>\n<h2>Application Description</h2>\n<p>Pawsitivity is an app that combines inspirational quotes to get you motivated and cute cats to deliver you a smile. Users can choose their favorite color cat who will give you a quote when you tap on them. </p>\n<p>In honor of Halloween just over a week away, this app also offers 8 different costume choices, such as a mummy, a pineapple, and a chef. We made these customization options with the hope that it brings someone joy while customizing their own special cat! </p>\n<p>After selecting your cat, simply tap on the screen for instant motivational quotes!</p>\n<h2>Implementation</h2>\n<p><strong>Android application</strong></p>\n<ul>\n<li>Design: Adobe Illustrator</li>\n<li>VCS: Github</li>\n<li>CI/CD: codeship</li>\n<li>Rest API: Node.js &lt;- Heroku</li>\n<li>Database: MongoDB &lt;- Heroku</li>\n</ul>\n<h2>Challenges</h2>\n<p>While the idea of Pawsitivity is very simple and straight forward, we found during our brainstorming process that we envisioned many customization and preferences options for the user. However, these settings, such as updating the color and outfit of the cat in runtime for the users to see, were more challenging that expected. </p>\n<p>The group's idea of the app was largely influenced by popular apps on the market that utilize lots of animation to communicate what is happening to the user. We imagined lots of animated snippets to really bring a more professional touch to our application. However, actually implementing moving images was difficult for both building graphics and for coding it in the app, and thus the amount of animation was decreased to a more manageable level during the time period. </p>\n<h2>Accomplishments</h2>\n<p>One of the biggest aspects of Pawsitivity is the fact that all of the graphics were created from scratch specifically for this project. The members of our group worked together to bring together Halloween-themed designs for the costumes and cats that would make anyone smile! </p>\n<p>We also spent considerable time setting up a database and API to keep track of users and their customized cats. This database recognizes if the user already has an account or if a new account must be made. </p>\n<h2>Learning Experiences</h2>\n<p>For some members of this group, this project was their first encounter with Android Studio and building a native Android application. </p>\n<p>We also further developed design skills while creating the necessary vector graphics using Adobe Illustrator. Because Adobe products tend to have a high learning curve, we needed to communicate effectively between members to teach and to learn.</p>\n<h2>What's Next</h2>\n<p><strong>User-Interface</strong></p>\n<p>The options given to the user are limited in the app at the moment, but we would like to add more customization features, such as naming the cat, choosing between more outfits, and picking different colors of cats (perhaps with a color picker for the adventurous minds). </p>\n<p>Our initial plan for Pawsitivity was to create many other animals other than cats, such as puppies, bunnies, polar bears, etc. With more time for implementation and graphics, this is definitely possible and we hope to add them to the collection. We also hope to implement animation for individual animals as well as for the user experience of the entire application as a whole. </p>\n<p>Pawsitivity can be gamified by adding more interactions with your pets, such as feeding them and playing with them to increase their health and happiness level. Allowing the user to be in control of the cat might bring some peace to the anxious user by giving them something to nurture. This effect has been shown in the popularity of apps such as Forest (a distraction management application that allows you to plant a virtual tree if you do not use your phone for 30 minutes; if you do use your phone for a non-emergency matter, the tree will die) and Neko Atsume (a game that allows the user to leave out food and toys to gather cats). </p>\n<p><strong>User-Interaction</strong></p>\n<p>One of the biggest things we wanted to communicate to those who suffer from anxiety disorders and/or depression is that they are not alone. We would like to translate this in our application by adding user-to-user communication. The user can take a photo of their pet and quote (or write their own!) and send it to their friends via SMS, Facebook, Twitter, etc. </p>\n<p>There are times, however, that no matter how cute the pet and how inspiring the quote, the user may need more professional help than we can offer. For these situations, we would like to implement a way for them to reach the services they need, such as hotlines and 911 emergency.</p>\n<p><strong>Machine Learning and Artificial Intelligence</strong></p>\n<p>Customization features can go beyond just appearance of the pet. The user will be able to choose from categories of quotes that they would like to see, and we could implement for the application to gradually learn their preferences through machine learning and a rating system for individual quotes. </p>\n<p>For situations described earlier that a user requires more services, the application can learn if a user is possibly in need of such help and be able to respond effectively. </p>\n<p><strong>Applications</strong></p>\n<p>After polishing up our app and adding the features we weren't able to get to, we are thinking of releasing it to the Google Play store for real users to download and use. We would love to expand Pawsitivity to iOS as well, where we can reach out to more people who may be suffering from depression or anxiety. </p>\n<h2>Finishing Thoughts</h2>\n<p>Overall, we really enjoyed building this application and have great hopes for it to move forward as an aid for anyone who can use a smile! </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/heroku\">heroku</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mongodb\">mongodb</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/adobe-illustrator\">adobe-illustrator</a></span></li><li><span class=\"cp-tag\">codeship</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/github\">github</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/yeejkoobt/Pawsitivity\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/yeejkoobt/Pawsitivity\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on both the frontend and backend Pawsitivity. I wrote a HTTP RESTful API in Node.js that validates the username and password Pawsitivity users in our database MongoDB. I setup the CI/CD process for our API with Heroku and Codeship. On the frontent, I helped implement the animations of the cats and business logic of the application.", "", "", ""]], ["MagicHand", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>We want to help everyone to be able to communicate with each other.</p>\n<h2>What it does</h2>\n<p>Translates sign-language into American-English audio </p>\n<h2>How we built it</h2>\n<p>We use the camera to record the movements of the hands. Then we use machine learning and computer vision to match the patterns with English words.</p>\n<h2>Challenges we ran into</h2>\n<p>Limited time and hardware resources</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Most of us are new to computer vision and machine learning and with time and technology limit, we could still be able to reach our goal </p>\n<h2>What we learned</h2>\n<p>Through trials and errors, we've learned how different kinds of computer vision and machine learning algorithms work and successfully apply those algorithms to our project.</p>\n<h2>What's next for MagicHand</h2>\n<p>We will continue in this research project to increase the number of words in the dictionary and make the recognition more stable. Our goal is to help as many people as possible.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/opencv\">opencv</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/machine-learning\">machine-learning</a></span></li><li><span class=\"cp-tag\">knn</span></li><li><span class=\"cp-tag\">feature-distraction</span></li><li><span class=\"cp-tag\">computer-vision</span></li><li><span class=\"cp-tag\">image-background-subtraction</span></li><li><span class=\"cp-tag\">convex-hull-detection</span></li><li><span class=\"cp-tag\">gesture-regconition</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/ngailapdi/sign-to-text\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/ngailapdi/sign-to-text\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Improve accuracy of hand gesture detection\nWork on computer vision side such as background subtraction and count number of fingers pointing (based on convex hull and defect points)\n", "Get started with initial code for KNN training and testing that works with images.\nImprove training script so that it works with video.", "Project manager:\ngenerate ideas; research on different computer vision algorithms like: SIFT, SURF. ", "Set up OpenCV library, brainstorm algorithms, analyze and process image, generate training images, test data, validate result, write report."]], ["CatMan", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"CatMan – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/960/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"CatMan – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/961/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Halloween</p>\n<h2>What it does</h2>\n<p>Virtual Reality PacMan</p>\n<h2>How I built it</h2>\n<p>Using Unity and Oculus Rift VR</p>\n<h2>Challenges I ran into</h2>\n<p>We didn't get a hold of the necessary hardware until more that half way through the hackathon due to transportation difficulties</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Actually got my own virtual application up and running for the first time!</p>\n<h2>What I learned</h2>\n<p>I learned how to us unity and design virtual models as well as the interaction between the two.</p>\n<h2>What's next for CatMan</h2>\n<p>There are a still a few improvements and 'DLC' left to release</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--3\">c++</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/oculus-gear-vr\">oculus-gear-vr</a></span></li></ul>\n</div>\n</div>", [""]], ["Dissonance", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<p>Team Beard - HackGSU Fall 2016</p>\n<h2>Inspiration</h2>\n<p>Early in our development phase we realized that we shared a love of making and listening to music, and with JBL present with the opportunity to work with their smart headphones, Everest Elite 700, and Bluetooth speakers, Pulse 2,  we jumped at the opportunity to build a project around our passion and their tech.</p>\n<h2>What it does</h2>\n<p>We developed an Android mobile application that integrates with the Everest Elite 700 headphones. It utilizes the headphones built in motion sensors to capture motion from the user. We utilized those movements as gestures to help control the listener's musical experience. Operating volume and EQ controls with the simple nod or turn of your head.</p>\n<h2>How we built it</h2>\n<p>We developed the project in Android Studio and integrated the JBL Everest SDK to build out the functionality built into the Everest Elite 700 headphones. We used Matlab to analyze the sensor data as well.</p>\n<h2>Challenges we ran into</h2>\n<p>We attempted to utilize machine learning algorithms to enable users to build custom gestures by mapping their personal range of motion, but the implementation of such functionality was time prohibitive, so we used a quick location normalization with a threshold margin to allow gesture control.  </p>\n<h2>Accomplishments that we're proud of</h2>\n<ul>\n<li>Successful utilization of sensor data from the headphones.</li>\n<li>Development of a functional and sleek UI.</li>\n<li>Completing the core functionality that we initially desired to create. </li>\n</ul>\n<h2>What we learned</h2>\n<p>We learned a great deal through this process about a variety of topics from Bluetooth utilization in Android Studio, making useful information from very delicate movement sensors, to the difficulties of working with machine learning in time sensitive applications.</p>\n<h2>What's next for Dissonance</h2>\n<p>We see many more way for this application to develop and be utilized. We would love to implement audio effects and recording into the app, making it into a hands-free virtual mixer.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li><li><span class=\"cp-tag\">everest-elite-700-sdk</span></li><li><span class=\"cp-tag\">jbl-everest-sdk</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/matlab\">matlab</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bluetooth\">bluetooth</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/bcooper436/Dissonance\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/bcooper436/Dissonance\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on integrating the Everest SDK into our application. I used that SDK to set the sensors in the JBL Everest Elite 700 headphones. I built filters for the information received from those sensors in order to reduce the amount of misfire information due to their sensitivity. I developed the calibration to find the user's resting headphone location.", "I worked on the app architecture design and did research on machine learning for gesture recognition.", ""]], ["BTCheckIn", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"BTCheckIn – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/432/686/datas/gallery.jpg\"/>\n<p>\n<i>One Employee Present</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"BTCheckIn – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/432/687/datas/gallery.jpg\"/>\n<p>\n<i>No Employees present</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h1>BTCheckIn</h1>\n<p>Automatically detects when users come and go from an office environment</p>\n<h1>How It Works</h1>\n<ul>\n<li>A MySQL database on the Pi holds a bluetooth ID and name for each person and indicates whether they are currently present or not.</li>\n<li>A python 2.7 script loops on the Pi surveying to see if the users from the MySQL database are present, and updates the database when they enter or leave the bluetooth coverage area.</li>\n<li>A local Apache server runs on the Pi and serves a php based website that reads from the MySQL database to display which users are currently present.</li>\n</ul>\n<h1>Hardware</h1>\n<ul>\n<li>Hardware consists of a Raspberry Pi with a USB Bluetooth dongle connected to a local network.</li>\n</ul>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mysql\">mysql</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/raspberry-pi\">raspberry-pi</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/apache\">apache</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/KevinAiken/BTCheckIn\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/KevinAiken/BTCheckIn\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I modified the initial idea to incorporate it in an office setting. I also worked with the Python script, and messed around a bit with the PHP/MySQL (greatest difficulty the team overcame). This project helped me work on my Python skillset.", "I setup the Apache server and MySQL database on the Pi, wrote the initial BTCheckIn.py script, and decided what technologies to use to execute the project.", "I wrote the python script that constantly checked if certain phones were or weren't in the vicinity and would log what time they entered or exited into the MySQL database.", "I worked on the front end of the app.", ""]], ["Personif.ai", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/Tf2wDdVqpf8?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"Personif.ai – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/828/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Personif.ai – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/826/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Personif.ai – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/827/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Personif.ai – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/431/211/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>The mental state of patients in long term hospital stays or assisted living facilities tends to decrease with time due to lack of continued social interaction. </p>\n<h2>What it does</h2>\n<p>Personif.ai is an AI-driven health monitoring system that serves as a companion to patients and adds a social dimension to digital healthcare.</p>\n<h2>How we built it</h2>\n<p>A backend in Flask and Python with a front-end in HTML/CSS and Javascript comes together to create an avatar you can interact with.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We managed to take a chat bot to a whole new level by trying to solve a real issue that affects many people. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/flask\">flask</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/api-ai\">api.ai</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google-web-speech-api\">google-web-speech-api</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/twilio\">twilio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mapquest\">mapquest</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/predix\">predix</a></span></li></ul>\n</div>\n</div>", ["I worked on all of the front-end and design work. ", "I wrote the back-end python server, the speech recognition, and the text to voice capabilities.", "Я спал."]], ["Treat Yo Cat", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/72Zc7OrDuCg?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"Treat Yo Cat – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/429/978/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Treat Yo Cat – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/429/979/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Treat Yo Cat – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/002/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Have you ever been away from home but miss your cat? If you have ever wanted to give your cat some treats while you're away from home, now you can!</p>\n<h2>What it does</h2>\n<p>Treat Yo Cat is an app and a device that lets you give your cat treats with the click of a button while you're away.</p>\n<h2>How we built it</h2>\n<p>The device works with a servo powered by an Arduino that pulls a card out of a 3D printed dispenser. You put cat treats in the dispenser and then you're good to go! When you click the button, the servo will move the card out of the way and let some treats fall out into the cat's bowl.</p>\n<h2>Challenges we ran into</h2>\n<p>We had a hard time figuring out how to have the PHP server communicate with the Arduino.</p>\n<h2>What's next for Treat Yo Cat</h2>\n<p>We hope to add the ability to detect motion in front of the device and send a picture to the user so that you can see your cat eating the treats from far away.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/arduino\">arduino</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/servo\">servo</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/processing\">processing</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li></ul>\n</div>\n</div>", ["", "", "", ""]], ["TrackRTreat", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>What it does</h2>\n<p>A crowd-sourced mapping and review tool to maximize the safety, ease, efficiency of trick-or-treating</p>\n<h2>How we built it</h2>\n<p>We used a node.js backend with a mongodb database, as well as the express and mongoose wrappers. On the front end, we used android studio and Java. We also implemented the Mapquest API to handle the mapping.</p>\n<h2>Challenges we ran into</h2>\n<p>None of us had a lot of experience, but we knew what we wanted to do, so our biggest challenge was really learning the frameworks for the first time. </p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We were proud of the whole experience, and we all feel better off as a result. Even though our development process was pretty rocky at points, we know we learned something new, which we are most proud of.</p>\n<h2>What we learned</h2>\n<p>As noted previously, we learned node.js, mongodb, express, mongoose, and Android development, as well as the mapquest apiece and how to do networking in java.</p>\n<h2>What's next for TrackRTreat</h2>\n<p>Our next goal is to have the rating functions working, then use that data to provide a heat map of good candy locations. We also want to implement safety features to build on the app for utilization outside of Halloween. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mongodb\">mongodb</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/express-js\">express.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mongoose\">mongoose</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li></ul>\n</div>\n</div>", ["My role involved idea development and a lot of watching and learning.", "I was the Android developer, as well as the developer that connected the app to MapQuest API.", "I assisted with the front and back end development, as well as the design process. ", "I acted as the project lead and as the lead developer for the backend, which is NodeJS and MongoDB. This was my first exposure to back end and NodeJS/MongoDB.", ""]], ["Thermal Health Companion", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<p>This is a project about IOT for health monitoring Companion App. The goal is to simply monitor body temperature that reflect health base on expert advises. The idealization is to create smart system using low cost IOT devices to achieve the goal which reminds user of their healthy status. </p>\n<p>The system is created using Intel Edison board which act as a temperature sensor, using XDK environment to extract sensor data and send http request to server, whereas a companion android app linked to these smart devices for user interfaces and social functions. The back-end server are composed of Mysql database that store user history and php script that act as data end-point. Using html, we create our own website and control panel for display result which enable users an insightful way to foresee their health.  A heat map was able to create a direct visualization in the extract data, using javascript and matlab. The sensor network schema was also available in this case. </p>\n<p>With our companion app and an solution to health monitoring, the concept isn't just as simple as it is. The potential of new smart system as well as life changing solution is created. And we are proud to announce at HackGSU 2016</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/sql\">sql</a></span></li></ul>\n</div>\n</div>", ["", "", ""]], ["rainbowCatRun", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h1>rainbowCatRun</h1>\n<p>Rainbow Cat Run @ HackGSU</p>\n<p>teamawesome</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/RandomUser999/rainbowCatRun\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/RandomUser999/rainbowCatRun\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["teamawesome"]], ["KitCat", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h1>KitCat</h1>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/Yuliy97/KitCat/tree/Yuli\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/Yuliy97/KitCat/tree/Yuli\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on the design and also collected photos ", "", "", ""]], ["hackGSU2016", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h1>hackGSU2016</h1>\n<p>Going for Make Pixel Happy Award &amp; Best Halloween Hack :^)\n<a href=\"http://codd.cs.gsu.edu/%7Evthomas13/hackGSU2016/hack.html\" rel=\"nofollow\">http://codd.cs.gsu.edu/~vthomas13/hackGSU2016/hack.html</a></p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/vthomas13/hackGSU2016\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/vthomas13/hackGSU2016\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["Guru ", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Guru  – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/431/446/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Guru  – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/431/447/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Guru  – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/431/448/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Guru  – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/431/449/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Guru  – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/431/450/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Guru  – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/431/451/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<div class=\"alert-box alert\">\n        This image is currently processing. Please be patient...\n      </div>\n<img alt=\"Guru  – screenshot 7\" class=\"software_photo_image image-replacement\" src=\"https://devpost-challengepost.netdna-ssl.com/assets/defaults/software-d4334efb72013df43784baffede9d379.gif\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration:  We wanted to create something that could motivate the everyday discouraged person and entertain the people eager to hear words of knowledge.. For example, I feel like skipping the gym... or I am about to cheat on my diet.</h2>\n<h2>What it does: Tell Guru how you are feeling. Maybe its your first time at a hackathon and you werent able to finish your project, but you know you should demo anyways because it is a great experience. But you're also a little scared. Tell Guru. \"Hey I don't know if I want to demo. I'm kinda scared.\" Guru will return an array of quotes pertinent to your situation to help you follow through.</h2>\n<p>For Example, if you tell Guru, \"I am about to cheat on my diet\", Guru will analyze your text and provide a inspiration in form of a quote or image. Whatever Guru says will hopefully prevent and inspire you to not cheat on your diet.</p>\n<h2>How I built it: We used AngularJS, HTML, &amp; CSS for the Front-End Dev and Node and MongoDB for the Back-End Dev... We built Guru as a web application.</h2>\n<h2>Challenges I ran into We had hard time agreeing on how this project would look and what the best ways to implement a meaningful project.</h2>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Im just glad we are demoing!! Great Experience</p>\n<h2>What I learned:</h2>\n<p>Learned NodeJS and Express..</p>\n<h2>What's next for Guru -- Wisdom In Your Pocket</h2>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/angular-js\">angular.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mongodb\">mongodb</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css3\">css3</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/photoshop\">photoshop</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/jeduardo5/PocketGuru\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/jeduardo5/PocketGuru\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on the front-end and designs", "", "", "", ""]], ["Dab Right Meow", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration:</h2>\n<ul>\n<li>Pixel and Octocat were our inspiration for this dank project</li>\n</ul>\n<h2>What it does:</h2>\n<ul>\n<li>Not only keeps time but keeps your dab lit! Upon the execution of each dab a cat appears.</li>\n</ul>\n<h2>How we built it</h2>\n<ul>\n<li>We built it using C and Javascript</li>\n</ul>\n<h2>Challenges we ran into:</h2>\n<ul>\n<li>Meow</li>\n</ul>\n<h2>Accomplishments that we're proud of:</h2>\n<ul>\n<li>We did it!!!</li>\n</ul>\n<h2>What we learned:</h2>\n<ul>\n<li>We learned how to use the pebble watch</li>\n</ul>\n<h2>What's next for Dab Right Meow:</h2>\n<ul>\n<li>More cats. We're available for birthdays, weddings and bar mitzvah</li>\n</ul>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c\">c</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://dabrightmeow.com/\" rel=\"nofollow\" target=\"_blank\" title=\"http://dabrightmeow.com/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>dabrightmeow.com</span>\n</a></li>\n<li><a href=\"https://cloudpebble.net/ide/project/372544#\" rel=\"nofollow\" target=\"_blank\" title=\"https://cloudpebble.net/ide/project/372544#\">\n<i class=\"ss-icon ss-link\"></i>\n<span>cloudpebble.net</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["Not Predix 2.0 (with emphasis on the \"Not\")", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<h2>What it does</h2>\n<h2>How I built it</h2>\n<h2>Challenges I ran into</h2>\n<h2>Accomplishments that I'm proud of</h2>\n<h2>What I learned</h2>\n<h2>What's next for Not Predix 2.0 (with emphasis on the \"Not\")</h2>\n<p>I ONLY HAVE 3 MORE MINUTES FOR THIS SUBMISSION (AIN'T NOBODY GOT TIME~~ #AIN'T NOBODY GOT TIME)</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag\">java-servlets</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag\">wildfly-10.0</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag\">freemarker</span></li></ul>\n</div>\n</div>", [""]], ["Lingo Lollipop", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>We came up Lingo Lollipop while when we were playing around with some confusing API and someone said \"That s*** is jank\". As someone who moved to Atlanta from Massachusetts about three months ago, I was very confused. Aditya and I realized many people have the same disorientation when moving to somewhere new. The terms and phrases used by people is native to their region. For example, in my town, people say, \"Wow, that was rattling!\" all the time. It means that something was mind boggling. We created Lingo Lollipop to provide users with native lingo definitions of a specific area.</p>\n<h2>What it does</h2>\n<p>Our app will query Twitter for massive number of tweets within 5 miles of a location provided by the user. We then process through the data to eliminate common words, and then statistically determine uncommon terms and phrases. These are then sent off to UrbanDictionary, where we are able to fetch the definition. We then provide the definitions nice and neatly to the user on their android device.</p>\n<h2>How we built it</h2>\n<p>We built it through android studio, the twitter api, jsoup, the google maps api and various other tools.</p>\n<h2>Challenges we ran into</h2>\n<p>Time was a huge issue since we came up with the ideas after a while, however the main issue was learning various sort methods and their O time complexities in order to process the massive amount of data most efficiently.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Of creating a fully functional android app within a day and a half.</p>\n<h2>What we learned</h2>\n<p>The differences in efficiency between different kinds of sort methods. Furthermore, we learned how to use the Google Maps, Twitter and Jsoup APIs.</p>\n<h2>What's next for Lingo Lollipop</h2>\n<p>We hope to release to the app store within a couple hours!</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/twitter\">twitter</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jsoup\">jsoup</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/photoshop\">photoshop</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/aditya3398/Lingo\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/aditya3398/Lingo\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["NewLeaf", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Twitter shows that words can be extremely impactful. In a mere 140 characters, a person's self esteem can be crushed. These harassers may not be aware of the impact of their words. We want to draw awareness to this impact, so these harassers will reconsider sending these types of tweets out. </p>\n<h2>What it does</h2>\n<p>We constantly scout for tweets harassing people. Once we have found the tweet, we return a quote that allows them to reflect on their hurtful words.</p>\n<h2>How we built it</h2>\n<p>We're using Twitter's API in order to gather tweets that contain harassing words toward other people. We feed these tweets into the IBM Watson's Alchemy API which allows us to analyze the emotion of the text. After confirming that the tweet is considered harassment, we use Twitter's API to retweet the harasser with a quote that allows them to reflect on their hurtful impact.</p>\n<h2>Challenges we ran into</h2>\n<p>It was difficult consolidating different stack technologies into a standard format.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We managed to create a working prototype within 36 hours.</p>\n<h2>Individual Contribution</h2>\n<p>James Wang - Project Manager, created the idea for the AntiHarassment campaign, oriented team towards our core features. Contributed to developement of the twitter bot.<br/>\nBranden Lee - Created the twitter bot that would take in random tweets with the word hate, which symbolizes negative feelings, and send positive encouragements and quotes back to the person every minute.\nconnecting the twitter API with the Alchemy Lab API. \nJeongsu Park - Working on the FrontEnd part (Creating a website to visualize, embedded twitter timeline into the website)\nDave Pham - Researching different APIs, created the framework for website developed. </p>\n<h2>What we learned</h2>\n<p>Alchemy API\nTwitter API\nTaking advantage of everyone's strength\nEffective Communication</p>\n<h2>What's next for NewLeaf</h2>\n<p>Team up with a nonprofit that brings out its full potential.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/alchemyapi\">alchemyapi</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/angular-js\">angular.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/twitter\">twitter</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://www.newleaf.supark.a2hosted.com/\" rel=\"nofollow\" target=\"_blank\" title=\"http://www.newleaf.supark.a2hosted.com/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>www.newleaf.supark.a2hosted.com</span>\n</a></li>\n<li><a href=\"http://www.newleaf.supark.a2hosted.com/\" rel=\"nofollow\" target=\"_blank\" title=\"http://www.newleaf.supark.a2hosted.com/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>www.newleaf.supark.a2hosted.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I created the twitter bot \"New Leaf\" that we would be using for our project.  The twitter bot that would take in random tweets with the word hate, which symbolizes negative feelings, and send positive encouragements and quotes back to the person every minute. In order to do this we used both the twitter API and the Alchemy Lab API.", "", ""]], ["Ringo", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/xvUOJAJI5vw?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n</ul> </div>\n<div>\n<h2>Why we did it</h2>\n<p>Cause it's cool! We all got excited about the idea of a virtual instrument, so we figured we might as well do it.</p>\n<h2>How we built it</h2>\n<p>Using the built in gyroscope on an Arduino 101, we were able to develop accurate rotational position tracking. We created spatial definitions for drum planes, and whenever the tracked position goes downwards through a particular drum plane, that drum is triggered. This is then sent to the base laptop, which plays it through the JBL Pulse 2.</p>\n<h2>Challenges faced</h2>\n<p>Accounting for a 6DOF system with a gyroscope and accelerometer to track the motion of a rigid body proved to be a formidable task. Additionally, we encountered several unexpected obstacles when trying to interface with Arduino, Android Stuidio, and the JBL Pulse 2 simultaneously.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We are very happy we were able to connect four different devices together, communicating across protocols and environments.</p>\n<h2>What we learned</h2>\n<p>Keep it simple. The more devices that need to be connected, the more room there is for things to malfunction.</p>\n<h2>Future work</h2>\n<p>Because this was done in the course of a weekend, there is much room for improvement. Firstly, the overall topology of the design can be simplified down to three devices. Also, position tracking with the gyroscope can be further improved to reduce the error in yaw. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/arduino\">arduino</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li><li><span class=\"cp-tag\">jbl</span></li><li><span class=\"cp-tag\">iot</span></li></ul>\n</div>\n</div>", ["I created the function of allowing a java program to live-stream data from the Arduino board via serial ports", "Worked with the Arduino and Java interface to translate certain Arduino motions to drum sounds.", "I helped create the motion sensors. I had no idea how to use Arduinos before hand, but I feel like I learned a lot. ", ""]], ["Pulsify", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>The love of music. Music is life. We love programming to music with lights!</p>\n<h2>What it does</h2>\n<p>This gives the user a personal and comforting experience with music and animation.</p>\n<h2>How we built it</h2>\n<p>Google and Stackoverflow :)</p>\n<h2>Challenges we ran into</h2>\n<p>Abandoned teams and everything under the sun</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Staying up for 3 days and 3 nights.</p>\n<h2>What we learned</h2>\n<p>Don't stay up for 3 days and 3 nights.</p>\n<h2>What's next for Pulsify</h2>\n<p>More features! Features for everybody!</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag\">api</span></li><li><span class=\"cp-tag\">http</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/json\">json</a></span></li></ul>\n</div>\n</div>", ["I worked on the backend and frontend. I used the Spotify API and SDK to create a user login to a user's spotify account. Also used the Spotify API to stream music depending the mood of the user.", ""]], ["Saasnoharass ", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>We wanted to write something that could be used by anyone and everyone. We also disliked the cyber bullying and it's effect on the youth.</p>\n<h2>What it does</h2>\n<p>It is a web service that functions as an API, receiving a message as its only parameter and returning an integer back to the sender. That number is the likelihood that the message was offensive. We also built a demo to showcase what the API can do</p>\n<h2>How we built it</h2>\n<p>We built it using AWS and PHP. </p>\n<h2>Challenges we ran into</h2>\n<h2>Accomplishments that we're proud of</h2>\n<h2>What we learned</h2>\n<h2>What's next for Message Checker API + DEMOs</h2>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/amazon-web-services\">amazon-web-services</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://harass-php.ywvkgndma5.us-west-2.elasticbeanstalk.com/#\" rel=\"nofollow\" target=\"_blank\" title=\"http://harass-php.ywvkgndma5.us-west-2.elasticbeanstalk.com/#\">\n<i class=\"ss-icon ss-link\"></i>\n<span>harass-php.ywvkgndma5.us-west-2.elasticbeanstalk.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on the the filter algorithm used in our api.", ""]], ["Guess That Cat!", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h3>Sudden Death quiz to see if you can recognize cats from popular 90's TV shows. Utilizing JQuery, Javascript, HTML, and CSS, Guess That Cat! is a fun, click-though game that challenges people's cat naming abilities from popular TV shows they grew up with. How many cats can you guess?</h3>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li></ul>\n</div>\n</div>", [""]], ["Last Thoughts", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>I found this dataset and I felt like messing with it.</p>\n<h2>What it does</h2>\n<p>Analyzes the last statement of death row inmates in Texas from 1984-present using the Alchemy API.</p>\n<h2>How I built it</h2>\n<p>We downloaded the dataset with a Chrome extension. Then using the web addresses found in the dataset, we scraped the webpages that had the final statements of the executed prisoners and wrote the text into a file. Then using the Alchemy API, we analyzed all of the statements to find what was the most common emotion of these inmates.</p>\n<h2>Challenges I ran into</h2>\n<p>Web scraping, using Python library pandas to utilize the dataset</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Successfully retrieving the data and storing it into a file, using an API</p>\n<h2>What I learned</h2>\n<p>Web scraping, IBM Bluemix, Alchemy API, natural language processing</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/pandas\">pandas</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ibm-watson\">ibm-watson</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/alchemyapi\">alchemyapi</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bluemix\">bluemix</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/Mehfistoe/ISeeTheLight\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/Mehfistoe/ISeeTheLight\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I helped create the Python scripts used to hit the API and obtain data.", ""]], ["DealsDownTheBlock", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/kQvM3xJn63s?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"DealsDownTheBlock – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/605/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"DealsDownTheBlock – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/431/100/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"DealsDownTheBlock – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/431/102/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>The inspiration came from not being able to locate an app that would provide this market demand.</p>\n<h2>What it does</h2>\n<p>The app will run in the background of the phone utilizing the location. It will read the coordinates of the phone and return notifications from businesses nearby that share their daily discounts as a marketing tool. </p>\n<h2>How I built it</h2>\n<p>We built it using the framework, Phonegap, that allowed us to write the app using web development languages including front-end and back-end languages such HTML, CSS, JavaScript, AJAX, PHP, and SQL. </p>\n<h2>Challenges I ran into</h2>\n<p>Most of the team had to learn how to be a full stack developer in a short time due to the lack of web development skills. </p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>We were successful in connecting every team member's portion of the app project and combine it to produce a presentable, final project.</p>\n<h2>What I learned</h2>\n<p>We learned the valuable skill of teamwork in connecting our portions into a complete project. We learned more about web development that we integrated into our app project.</p>\n<h2>What's next for DealsDowntheBlock</h2>\n<p>We can continue to enhance the app product to be a resourceful use to support local businesses and enhance the consumers satisfaction. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/phonegap\">phonegap</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ajax\">ajax</a></span></li><li><span class=\"cp-tag\">api</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/sql\">sql</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/dpourmehr/DealsDownTheBlock\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/dpourmehr/DealsDownTheBlock\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked with Nick on creating the database and linking the database to the html file with php and ajax. It was my first time using databases. ", "Worked with Vibhuti to create the database that would hold the data for all the user's and businesses who used our platform. Created front end pages with html/javascript; and back end services with php,ajax, and sql.", "Worked on setting up PhoneGap to get GeoLocationing as well as used MapQuest's API to be able to determine when a user was within a mile radius of a business from our database for them to get notified about it being there.", "I worked on the front-end of the project using HTML, CSS, JavaScript to make the app look interesting. I also worked on back-end using PHP and SQL to get the pages to function together."]], ["Heat Signature Security", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Our 36 Hours</h2>\n<p>We believe in solid systems that cannot be thwarted or deceived. And when we envision those, we can enumerate the many ways thieves and trespassers can break into a physical system. After all, they can hide their face, hide their clothes, hide their presence – but they can’t hide their temperature, can they? With that in mind, we decided to work on an idea for a heat map security system, one that updates based on the users’ preferences, and alerts them to any new and drastic changes in temperature.</p>\n<p>Our work starts off with the Intel Edison superchip, where Shubin and Guangzheng were able to configure the chip for its temperature scanner. They worked in C++ to handle the data, convert it all to Fahrenheit and subsequently simplified it into a matrix of temperatures, which would be a picture of the scanned region, but with numbers representing the people, objects and nearby items.</p>\n<p>After that, Maaz took the textfile with the matrix of temperatures, and plugged it into MATLAB. Since heat maps are colored relative to the highest and lowest temperature of the picture, the data was computed to automatically pinpoint the highest and lowest temperature in the matrix, and associate color to each temperature value. When this was done, the matrix of temperatures now had a colored image of the scanned area, where reddish colors signified hotter temperatures and bluer / blacker colors signified colder temperatures.</p>\n<p>A suggestion to the processing was to add a segment that detected drastic changes in temperature, and alert the user of a suspicious entry.  In addition, when the program compared the outlier temperatures to the average temperature of the outlier’s ambience, it would run through a table of potential threats classified by initial temperature and temperature difference. From this, when it sends an alert to the user, it also suggests a possible cause for the change in temperature. Unfortunately, we were not able to implement all of these changes in the time we had, though we certainly are and will be working on it after the judging is over.</p>\n<p>In the unpredictable case that MATLAB failed with its processing, Nitharjan worked on R Programming to come up with code that would also take the matrix of temperatures ( this time in a .csv file ), attach colors to each temperature value, and produce a brilliantly colored heat map. Even though MATLAB has been selected for our setup, the heatmap code and support in R Programming also gives us a feasible alternative in case there is a system that does not support MATLAB.</p>\n<p>After that, Huang took the heatmap pictures from MATLAB and added to our project’s website, which has the constantly updating heatmap right on the front page, along with a list of user alerts generated by the code. Heat Maps are best viewed on large screens ( i.e. computers, TVs, security camera monitors ), so the idea of developing an app for mobile devices to load a constantly updating heat map was quickly ruled out. Thus, a website was used to bring all the data and results together, and present our hack in a neat and considerable fashion.</p>\n<p>With that, thank you for reading, and if we have not already, we would be proud to present our HackGSU’s hack: Heat Signature Security. </p>\n<h2>Challenges I ran into</h2>\n<p>We ran into two major roadblocks along the way. The first one involved the Intel Edison's temperature scanner having a scan range that was infinitesimally smaller than what we had estimated. We continued our code in the hopes that when we are able to use technology of our own choosing, our code will work as intended, and return a very accurate and colorful heatmap of the surroundings. For now, we are working with the Intel Edison in lieu of the proper technology.</p>\n<p>The other challenge was more of a disagreement over whether MATLAB would be compatible with the data we got from the Intel Edison, and after we talked about our choices, we decided to invest some time in R Programming, where Nitharjan spent time on Saturday learning the basics and in-depth functions to replicate the heat map in R Programming. It was a worthwhile adventure, as we currently now have 2 methods to process the data and produce heat maps that we can add to the website.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>On the first day, we all came together and had a laugh over the notion that we beginners, could create something interesting and catchy from our combined lack of experience and recent introduction to programming. But we did exactly that. We pooled together whatever computer languages we knew, and managed to create a system that not only works, but looks great while protecting your interests at home. On top of that, we were able to acknowledge our technological constraints and proceed with our project, despite the fact that it's likely that someone points out how tiny our scanner is. Our project isn't perfect, but after all, who said it had to be perfect after a measly 36 hours of work?</p>\n<h2>What I learned</h2>\n<p>It's incredible to recount just how many things we've learned since we started. For starters, we set out as beginners in programming, and spent a good chunk of time studying, coding, debugging, and learning about all sorts of functions, methods - code that we probably would never see in class for the next several years. The introduction workshops were pretty nice as well, but we also immensely benefited by going around the hall and talking to other groups. Ideas fly quickly in an environment like this, and learning of other hackers' hacks and methodology really gave us a fresh set of perspectives that we used to keep looking at our project, and determine if it was still feasible, still relevant, and still accomplishing our goal. We learned a helluva' lot, and it's only just starting.</p>\n<h2>What's next for Heat Signature Security</h2>\n<p>For the sake of appearances and an ideal implementation, we have a list of user alerts on the website that note drastic temperature changes and suggest a reason for the drop or rise. However, our code does not return that list at the moment. After our judging, we plan to return to our code to analyze the interference's temperature, the surrounding temperature, and the temperature discrepancy, and compare it to a table of values we plan to include. These values, if satisfied by the three temperature conditions, will suggest an already coded reason as to why there might be a difference in temperature. </p>\n<p>For example, if the room is at room temperature, and a stove is lit to temperatures of above 100 deg F, then the program can use a heat map to look at these three temperature values, and suggest that the stove is being turned on. In regards to the cold weather outside, if someone decided to break into a house by breaking or opening a window, the heat map system would detect the sudden drop in temperature near the window, compare it to the room temperature, and conclude that the window was opened. </p>\n<p>As it is right now, it is not an AI system, though it would be certainly nice to move it in that direction.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/matlab\">matlab</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/r\">r</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--3\">c++</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/intel-edison\">intel-edison</a></span></li></ul>\n</div>\n</div>", [""]], ["LVLS", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"LVLS – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/457/150/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"LVLS – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/457/151/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>The inspiration for <strong>LVLS</strong> stems from a casual conversation with an affiliated member of the HARMAN company that demonstrated a fundamental absence in visual equalizer functionality.  Upon learning there was no such function currently available, it was our sworn duty as avid music listeners and connoisseurs of the ideal audio-visual entertainment experience to provide such functionality to our fellow, music-listening brethren.</p>\n<h2>What It Does (should do eventually...)</h2>\n<p>The application allows the Pulse 2 to execute proper audio visualization by utilizing the 11x9 LED screen to provide a visual equalizer.</p>\n<h2>How We Built It</h2>\n<p>We utilized both Android Studio and JBL Pulse 2 SDK.</p>\n<h2>Challenges</h2>\n<p>There were a lot of challenges with mapping out the layout of the LED lights in the system.  We had to physically draw out a layout and visualize the placement of each LED light that needed to light up. There were issues with adding activities to handle to operations.  Lastly, brainstorming a way to properly implement a FFT* was difficult. While, we worked tirelessly, we unfortunately could not complete in time to meet deadline.</p>\n<p><em><strong>(Fast Fourier Transform) an algorithm that computes transformations or sequences.</strong></em></p>\n<h2>Accomplishments</h2>\n<ul>\n<li>Learned about a new SDK</li>\n<li>Acquired knowledge about the in/outs of Android Studio </li>\n</ul>\n<h2>Things Learned</h2>\n<p>As a team we learned, to rapidly adapt with change. We also learned that some ideas can sometimes fall apart. </p>\n<h2>The Future of <strong>LVLS</strong>?</h2>\n<p>The future will consist of further development and seeing if we can actually implement properly functioning audio visuals. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/leemartinc/HackJBL\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/leemartinc/HackJBL\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I was support on code, avid researcher, and documentation/devpost specialist!", "", ""]], ["Speedy", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Speedy – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/431/058/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Speedy – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/431/059/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Speedy – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/431/060/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>What it does</h2>\n<p>Speedy facilitates racing between people from all over the world. You sign in telling the app how you want your race set up and the app will pair you up with someone else around the world with the same options. Then it will track you via GPS on your phone to watch where you're going and how fast you're going.</p>\n<p>There's also a web app that spectators can view races as they happen lives.</p>\n<h2>How we built it</h2>\n<p>We built it on Android and used Firebase as a backend and a web app written in javascript.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li><li><span class=\"cp-tag\">real-time</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/firebase\">firebase</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/joshuamking/speedy\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/joshuamking/speedy\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"https://github.com/ddakev/SpeedyWeb\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/ddakev/SpeedyWeb\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"https://speedy-ca2db.firebaseapp.com/\" rel=\"nofollow\" target=\"_blank\" title=\"https://speedy-ca2db.firebaseapp.com/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>speedy-ca2db.firebaseapp.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["QuickPoll", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"QuickPoll – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/823/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"QuickPoll – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/912/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"QuickPoll – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/913/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>What it does?</h2>\n<p>QuickPoll allow you to create and responds any day to day question that needs outside opinions in your local area. Can't decide which newest smart phone should you get this Thanks Giving? Pop on QuickPoll and see how many people have agreed with you in just a few clicks!</p>\n<p>Creating surveys and opinion polls can be a real hassle, so can filling them out. That's why our main goal is to have an eye pleasing pocket tool that is simple yet succinct for quick and efficient usage.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/fluid-ui\">fluid-ui</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/dhnt01/HackGSU\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/dhnt01/HackGSU\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I've worked on designing the UI, project management as well as the code's logic", "", "", ""]], ["Vocadroid", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>We wanted to create a way for lyricist to be able to non-biasly modify music by hearing something else sing to them. </p>\n<h2>What it does</h2>\n<p>First, it gets some lyrics through our android app. Then, when connected to the Harman Everest Elite, you can listen and modify the tempo by bobbing your head. Then, when connected to the Harman Pulse 2, you can visualize the notes being played. This, in a whole is what our app does.</p>\n<h2>How we built it</h2>\n<p>We used android studio to develop since we decided it would be best as an android app. From there, we developed the app by splitting the program into 3 real areas, the text-to-song, the headset, and the pusle. </p>\n<h2>Challenges we ran into</h2>\n<p>One main challenge we had was inaccessibility to the Harman Android Dev who didn't show up. We were able to get through this by talking to other participants who were using the Pulse. The challenge also evolved further when the documentation had many issues and instructions ended up not being correct, and following documentation would lead to incorrect code and incorrect settings as well. </p>\n<p>Another challenge we had was having so many ideas, all which could lead to the end-product. But we would each push our own work without consideration towards the ideas of others. We came to an agreement on which way, but we realized how sometimes it is difficult to develop on a team.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We were able to put images onto the Pulse. Stayed up late 2 days in a row. </p>\n<h2>What we learned</h2>\n<p>How to work on a team with incorrect documentation, including how to troubleshoot issues. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/jackle1127/Vocadroid\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/jackle1127/Vocadroid\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"https://github.com/mhanberry1/OpenHarmon-Everest-Elite-SDK\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/mhanberry1/OpenHarmon-Everest-Elite-SDK\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", "", ""]], ["Homie", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Need to control many household appliance at once.</p>\n<h2>What it does</h2>\n<p>Controls many household appliances at once (OK, it's a mockup.)</p>\n<h2>How we built it</h2>\n<p>Used mostly Java and Android, plus a server as proxy for various appliances.</p>\n<h2>Challenges we ran into</h2>\n<p>Servers.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>It pretty much works.</p>\n<h2>What we learned</h2>\n<p>It's harder to integrate stuff than we thought.</p>\n<h2>What's next for Homie</h2>\n<p>GE deploys Homie in the Autumn of 2018?</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/json\">json</a></span></li></ul>\n</div>\n</div>", ["I made some models and classes and helped with the layouts and talked about servers and stuff.", "", ""]], ["Central Card", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Central Card – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/629/datas/gallery.jpg\"/>\n<p>\n<i>Add the credit card to the app.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Central Card – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/630/datas/gallery.jpg\"/>\n<p>\n<i>Sign-in page of the app.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Central Card – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/631/datas/gallery.jpg\"/>\n<p>\n<i>Sign-up page of the app.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Central Card – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/632/datas/gallery.jpg\"/>\n<p>\n<i>One visual card that is equivalent to several credit card.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Central Card – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/633/datas/gallery.jpg\"/>\n<p>\n<i>The front page of the app. </i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Central Card – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/634/datas/gallery.jpg\"/>\n<p>\n<i>List of all the credit card that's stored in the app.</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>We got our idea from the State Farm's slogan which is, \"Here to help life go right.\" We think it's important to protect one's identity and financial security.</p>\n<h2>What it does</h2>\n<p>The app should generate a unique sixteen digit virtual credit card with CVV and Exp. That could be either temporary or permanent usage depending on the user as in hours, days or years. This virtual credit card should allow the customer to get access to all the credit cards they own. It should send them a notification to request them to choose a credit card for transaction.<br/>\nThis app is supposed to protect the consumer providing an extra layer of security for online/credit card purchases. It's supposed to use 128-bits encryption and data blinding to secure transactions.</p>\n<h2>How I built it</h2>\n<p>We developed an android application using Android Studio.</p>\n<h2>Challenges I ran into</h2>\n<p>The biggest challenge is finding encryption API and banking API. Due to security reasons there were no banking API's for us to use. </p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>This is all our first android application and first Hackathon.  </p>\n<h2>What I learned</h2>\n<p>I learned new database to work with and develop application as a team. It also taught us what we did not know such as the API's.</p>\n<h2>What's next for Central Card</h2>\n<p>It will work and expand if banks are willing to cooperate with Central Card. This will reduce humongous number of frauds. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xml\">xml</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/firebase\">firebase</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/sunjayden/CentralCard\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/sunjayden/CentralCard\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["Airwaves", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/ysiIDgBeGcw?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"Airwaves – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/313/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Airwaves – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/316/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Mapquest API</p>\n<h2>What it does</h2>\n<p>Generates a list of stations via the iHeartRadio API which we were unfortunately unable to get, your favorite genres and your geolocation based on a route to play local stations that is in your favorite genre so you don't have to touch the dial ever again. #DitchTheDial.</p>\n<h2>How we built it</h2>\n<p>We started with the mapquest API to try to get a list of the major cities on a route from point A to point B. Soon we realized that the mapquest API does document that and thus we started using regular expression to get the data we want from the turn by turn narrative of mapquest.</p>\n<h2>Challenges we ran into</h2>\n<p>Complex compounded regular expressions</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We were able to produce a very powerful set of regular expressions that did what we needed.</p>\n<h2>What we learned</h2>\n<p>Regular Expressions and GeoLocation</p>\n<h2>What's next for Airwaves</h2>\n<p>To be the biggest music app that everyone uses and loves.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mapquest-directions\">mapquest-directions</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mapquest-geocoding\">mapquest-geocoding</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mapquest\">mapquest</a></span></li><li><span class=\"cp-tag\">regex</span></li><li><span class=\"cp-tag\">regex101</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jsfiddle\">jsfiddle</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://jsfiddle.net/9amtobw8/34/\" rel=\"nofollow\" target=\"_blank\" title=\"https://jsfiddle.net/9amtobw8/34/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>jsfiddle.net</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I wrote the regular expression which is kind of like the heart of the program", "", ""]], ["Tweety Haiku", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Tweety Haiku – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/415/datas/gallery.jpg\"/>\n<p>\n<i>Sample of the haiku generated</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>What it does</h2>\n<p>A twitter bot that will respond to a word given with a haiku generated around it!</p>\n<h2>How we built it</h2>\n<p>It was created with the Python Natural Language Toolkit as well as the Twitter API and the TwinWord Word Association API.</p>\n<h2>Challenges we ran into</h2>\n<p>Generating the bigram collocation dictionary takes a lot of time! We implemented caching and generated a bunch of collocations already.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>I'm proud of using the NLTK since it's the first time ever doing anything related to natural language processing.</p>\n<h2>What we learned</h2>\n<p>How natural language processing works</p>\n<h2>What's next for Tweety Haiku</h2>\n<p>Trigram implementation and perhaps weaning it off Haikus onto other forms of poetry, such as limericks.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/nltk\">nltk</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/twitter\">twitter</a></span></li><li><span class=\"cp-tag\">twinword-word-association</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/yoogchu/tweetyhaiku\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/yoogchu/tweetyhaiku\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on acquiring word association list from the twin-word API. I used a python script and the unirest python library to help.", ""]], ["HashGame", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"HashGame – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/209/datas/gallery.jpg\"/>\n<p>\n<i>Decode the algorithm</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"HashGame – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/208/datas/gallery.jpg\"/>\n<p>\n<i>Match the hash code and win</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"HashGame – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/210/datas/gallery.jpg\"/>\n<p>\n<i>Try password combinations to find the pattern</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"HashGame – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/211/datas/gallery.jpg\"/>\n<p>\n<i>Use all the resources to your advantage</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Hashing algorithms that transform passwords into encoded strings to protect the user's privacy and avoid information leaks.</p>\n<h2>What it does</h2>\n<p>It gives you an encoded string that the player has to match by using the level's encoding algorithm. Each level has a hint, but they are not recommended.</p>\n<h2>How we built it</h2>\n<p>Using Unity 3D and C#.</p>\n<h2>Challenges we ran into</h2>\n<p>Making the UI look the way we wanted, creating the levels, implementing the scrolling text.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Developing a polished game with only 2 members in such a short amount of time, making a custom keyboard and console-type interface. Developing a game that presents coding in a different way.</p>\n<h2>What we learned</h2>\n<p>C#, Unity 3D, Inkscape, Git</p>\n<h2>What's next for HashGame</h2>\n<p>More levels with increasingly hard algorithms, many easter eggs, customization options. The game will have been released (and approved) for Android, but other platforms might also get their own version as well in the future. Eventually, it would be interesting to make more hacking games with console-type UI to increase the interest in coding among young students.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--2\">c#</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/sublime-text\">sublime-text</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://drive.google.com/open?id=0B7P-6hSsgGpYdUJzZ1hJZURpa0U\" rel=\"nofollow\" target=\"_blank\" title=\"https://drive.google.com/open?id=0B7P-6hSsgGpYdUJzZ1hJZURpa0U\">\n<i class=\"ss-icon ss-link\"></i>\n<span>drive.google.com</span>\n</a></li>\n<li><a href=\"https://play.google.com/store/apps/details?id=com.notyet.hashgame\" rel=\"nofollow\" target=\"_blank\" title=\"https://play.google.com/store/apps/details?id=com.notyet.hashgame\">\n<i class=\"ss-icon ss-link\"></i>\n<span>play.google.com</span>\n</a></li>\n<li><a href=\"https://github.com/mszylkowski/hashgame\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/mszylkowski/hashgame\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Designed and implemented the UI (keyboard, console, hints/table panel), coded the swiping text functionality from scratch and input system. Created system to make levels/algorithms creation efficient and easy to code.", "I worked on creating levels and created some of the interface as well as the logo. I learned a lot about unity, c#, git, and inkscape. "]], ["Online Course Management Bot", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/aYrF68Zh-Sw?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"Online Course Management Bot – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/458/datas/gallery.jpg\"/>\n<p>\n<i>App Logo</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Online Course Management Bot – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/450/datas/gallery.jpg\"/>\n<p>\n<i>Help</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Online Course Management Bot – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/455/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Online Course Management Bot – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/453/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Online Course Management Bot – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/451/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Online Course Management Bot – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/452/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Online Course Management Bot – screenshot 7\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/454/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Online Course Management Bot – screenshot 8\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/456/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h1>OnlineCourseManager</h1>\n<h2>Synopsis</h2>\n<p>OnlineCourseManager uses Slack API and Canvas LMS API to integrate new Slash Commands into a Slack team directory. These Slash Commands are intended to be used with Canvas, a learning management system used by the University of Florida, to query and grab course information to display directly into Slack. </p>\n<h2>Slack Slash Commands</h2>\n<p>Here Slack Slash Commands you can use with OnlineCourseManager: <br/></p>\n<h4>List course names you are registered to. Optionally filter by term (e.g. Spring16)<br/></h4>\n<p><br/>Format:\n<br/><code>/courses [term]</code>\n<br/><br/>Example:\n<br/><code>/courses Spring16</code>\n<br/><br/></p>\n<h4>Search assignments by keyword or by due date. <br/></h4>\n<p><br/>Format:\n<br/><code>/assignments [keyword], /assignment start [day/month/year] end [day/month/year]</code><br/>\n<br/><br/>Example: \n<br/> <code>/assignments math worksheet</code><br/>\n<code>/assignments start 10/21/2016 end 10/31/2016</code><br/>\n<code>/assignments start 10/21/2016</code><br/>\n<code>/assignments end 10/31/2016</code>\n<br/><br/></p>\n<h4>Gets all upcoming events - tests, quizzes, and assignments.<br/></h4>\n<p><code>/upcomingevents</code>\n<br/><br/> </p>\n<h4>Lists all course announcements for the past 7 days. <br/></h4>\n<p><code>/announcements</code>\n<br/><br/></p>\n<h4>Gets user's profile information.<br/></h4>\n<p><code>/profile</code>\n<br/><br/></p>\n<h4>List calendar events stored in Canvas given a course code (e.g. COP4600).</h4>\n<h4>Optionally show all calendar events or filter by a start and/or end date.<br/></h4>\n<p><code>/calendar coursecode start [d/m/y] OR/AND end [d/m/y] OR allevents</code><br/>\n<br/>Example:\n<br/><code>/calendar COP4600</code><br/>\n<code>/calendar COP4600 start 10/21/2016 end 10/31/2016</code><br/>\n<code>/calendar COP4600 start 10/21/2016</code><br/>\n<code>/calendar COP4600 end 10/31/2016</code><br/>\n<code>/calendar COP4600 allevents</code>\n<br/><br/></p>\n<h4>Shows list of commands and their purpose, if the user input is 'help'<br/></h4>\n<p><code>/onlinecoursemanager [help]</code><br/>\n<br/>Example:\n<br/><code>/onlinecoursemanager help</code>\n<br/></p>\n<h2>Motivation</h2>\n<p>This project was created in part of the HackGSU 2016 event from Oct 21 - Oct 23, 2016. We're three students from the University of Florida who dislike navigating our insitution's course manager website, Canvas, to display upcoming assignments and any announcements.</p>\n<h2>Installation</h2>\n<p>1) Visit <a href=\"https://9df9971b.ngrok.io/\" rel=\"nofollow\">https://9df9971b.ngrok.io/</a> and click 'Add to Slack' to give OnlineCourseManager permission to integrate with your Slack team.</p>\n<p>2) Login to your insitutions Canvas (Instructure) account. Go to Account -&gt; Settings and generate 'New Access Token' under approved integration. Make note of the token.</p>\n<p>3) Clone the repository. In the root of the repository, create a file named config.js and input this information:</p>\n<pre class=\"language-javascript\"><code>module.exports = {\n  slackBotToken : 'YOUR-SLACK-BOT-TOKEN',\n  canvasToken : 'YOUR-CANVAS-TOKEN',\n  slackClientID : 'YOUR-SLACK-CLIENT-ID',\n  slackClientSecret : 'YOUR-SLACK-CLIENT-SECRET',\n  slackOauthState : 'hackGSU',\n  redirectURI : 'SEE-STEP-5',\n};\n</code></pre>\n<p>4) Install npm, ngrok, and node.js. Run <code>npm install</code></p>\n<p>5) Run <code>node server.js</code> and <code>./ngrok http 8000</code> in separate terminals and note the https URL fto use for redirectURI.</p>\n<h2>API Reference</h2>\n<p>Canvas LMS API - <a href=\"https://canvas.instructure.com/doc/api/\" rel=\"nofollow\">https://canvas.instructure.com/doc/api/</a> <br/>\nSlack API - <a href=\"https://api.slack.com/\" rel=\"nofollow\">https://api.slack.com/</a></p>\n<h2>Future Features</h2>\n<ol>\n<li>Partner with UF and Canvas to provide a developer access token (we had to use an access token restricted to our personal accounts)</li>\n<li>Deploy Web Application (with \"Add to Slack\" button) to AWS or similar service</li>\n<li>Expand functionality: More slash commands, Slack bots, etc.</li>\n<li>Database integration: Store access keys and more</li>\n</ol>\n<h2>Contributors</h2>\n<p>Sebastián Hernández - <a href=\"https://github.com/prcbass/\" rel=\"nofollow\">https://github.com/prcbass/</a> <br/>\nEmily Macon - <a href=\"https://github.com/emily-macon\" rel=\"nofollow\">https://github.com/emily-macon</a> <br/>\nJulian Tolentino - <a href=\"https://github.com/juliantolentino\" rel=\"nofollow\">https://github.com/juliantolentino</a> <br/></p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag\">slackapi</span></li><li><span class=\"cp-tag\">canvasapi</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/prcbass/hackGSU2016SlackBot\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/prcbass/hackGSU2016SlackBot\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["Cat Blocker", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>cats</p>\n<h2>What it does</h2>\n<p>detects online harrassment and replaces it with cat gif</p>\n<h2>How we built it</h2>\n<p>chrome extension</p>\n<h2>Challenges we ran into</h2>\n<p>learning chrome extension</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>learned chrome extension</p>\n<h2>What we learned</h2>\n<p>how to make a chrome extension</p>\n<h2>What's next for Cat Blocker</h2>\n<p>blocks out ads and replaces it with cat gif</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/chrome\">chrome</a></span></li></ul>\n</div>\n</div>", ["", ""]], ["SpeechToMeow", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"SpeechToMeow – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/429/992/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>Our inspiration is to cat owners become closer with their cats.</p>\n<p>User speaks into phone then phone can output either pig latin or a pig latin/cat meowing hybrid.</p>\n<p>We build it with Android Studios.</p>\n<p>Challenges we ran into was splicing the meowing with the user's input.</p>\n<p>We are proud of how much we were able to accomplish in such little time.</p>\n<p>We learned how to successfully convert speech to text and vice versa.</p>\n<p>SpeechToMeow will work towards making it compatible with more pets.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/davis-trem/SpeechToMeow\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/davis-trem/SpeechToMeow\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["D.E.X.T.E.R", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p><strong>DIRTY CLOTHES, unorganized items, thought about a camera in the ridge...</strong> Our inspiration started out from the idea of having a camera in the fridge and also telling the owner if foods will expire soon. With couple revision of our innovation. We are teenagers/ young adults that are not willing to accept the acknowledgement of \"adulting\". Instead we wanted make our lazier lives even more lazier(but smarter) by creating our innovation. </p>\n<h2>What it does</h2>\n<p>The program detects objects by color and tracks their camera position. By being able to track  the items position, we are able to gain a clear depiction of where a particular item stands in a camera view. It shall be used in common house holds to keep track of lost items for the owner. The software is also able to relay information back the items location though text to speech. </p>\n<h2>How I built it</h2>\n<p>The team wondered many ways of trying to implement our idea. We realized that we have webcams and googled \"How to track motion on webcam\". Then Googled spat our an answer <strong>OpenCV</strong>, then from there, many hours of researching this new open source. </p>\n<h2>Challenges I ran into</h2>\n<p>I personally ran into many different errors. From the beginning our hack, I have encountered a problem with Python on Mac and virtualenvwrapper. I have not set my PATH for Python in the beginning which gave me trouble. But the worst problem I have encountered so far was not the coding. But setting up a new environment for the project.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>From Day 1, I have not used Python or even heard of OpenCV. And till now, I have not mastered, but I do have more strong grasp of Python, which is SO much better than Java, simply because of the high-level and the syntax. OpenCV is something new and I hope I will be using it for many side projects to come. </p>\n<h2>What I learned</h2>\n<p>I have learned that everyone has their <strong>strengths and weakness</strong>. And notice that everyone in a hackathon does not know everything. And it feels like a sense of noticeability between peers and friends when accomplishing a task that was started as an idea. From the beginning, we knew that we would not win, but my team had a sense of wanting, the want of completing the idea from nothing to something. And as we look back as a team, we have came very far. We knew nothing about OpenCV or Python. And using the programming language and open source for the project, made us unconsciously realized that we are learning and using something that we never did before. </p>\n<h2>What's next for D.E.X.T.E.R</h2>\n<p>We would love to see D.E.X.T.E.R be used in any form of categorizing application, integration for security and industrialization purposes. Industrial purposes would be the dream for D.E.X.T.E.R, rather than scanning each inventories QR code, we can invent a camera that takes a selection of the inventory by the size of the box, color (if important) and small details that D.E.X.T.E.R can pick up and use those details for sorting/collecting data. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/opencv\">opencv</a></span></li><li><span class=\"cp-tag\">hopesanddreams</span></li><li><span class=\"cp-tag\">statefarm</span></li><li><span class=\"cp-tag\">ge</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/Heftyheffy/HackGSU.git\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/Heftyheffy/HackGSU.git\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on using color recognition to visually present and pass the tracked objects with image processing. It was my first experience using openCV.", "I assisted in the develop of the  audio recognition, as well as in the development in Dexter's image comparison..", "I organized my team's efforts and contributed to the image processing portion of Dexter'so intelligence as well as the image comparison", ""]], ["C", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<p>even better.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c\">c</a></span></li></ul>\n</div>\n</div>", [""]], ["DontWasteFood", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>I always wanted to have a positive impact in my community through technology. So i wanted to build an app that where i could help the homeless people in Atalanta brainstormed for days and i was able to come up with DontWasteFood</p>\n<h2>What it does</h2>\n<p>It drops markers on maps and adds a description box.The description includes the pick up time,address,description.Using the information provided food banks can send volunteers to pick up food and later donate in to the homeless.</p>\n<h2>How I built it</h2>\n<p>I used google maps API  to draw a map,on click JavaScript change marker and description box information.</p>\n<h2>Challenges I ran into</h2>\n<p>The map wouldnt load time to time,and the markers wouldn't respond onclick or change colors.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Completing the project less than a day </p>\n<h2>What I learned</h2>\n<p>Stronger understanding of google maps api</p>\n<h2>What's next for DontWasteFood</h2>\n<p>Expand to not just food banks but other services that need to be connected in real time.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css3\">css3</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google-maps\">google-maps</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://codd.cs.gsu.edu/~jdsouza1/program/DontWasteFood/index.html\" rel=\"nofollow\" target=\"_blank\" title=\"http://codd.cs.gsu.edu/~jdsouza1/program/DontWasteFood/index.html\">\n<i class=\"ss-icon ss-link\"></i>\n<span>codd.cs.gsu.edu</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["Cats Against Bullying", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Cats Against Bullying – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/429/844/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>To find a creative yet effective solution to online harassment</p>\n<h2>What it does</h2>\n<p>This browser plug-in/extension replaces harassing posts/messages with silly words and pictures to reduce the harm on internet victims by showing them a nonsensical, goofy version of the harassment intended to irritate the victim.</p>\n<h2>How we built it</h2>\n<p>We summoned the mightiest internet paladins of the feline realm to come in aid us in fighting our issue of internet harassment in exchange for copious amount of catnip.</p>\n<p>A prototype was constructed in Java by pulling a post from a .txt and executing an algorithm to <strong><em>Sillify</em></strong> the harassers post to the victims client side, reducing the harmful effects caused by cyber-harassment. The program was then ported to JavaScript to streamline accessibility browsers.</p>\n<h2>Challenges we ran into</h2>\n<p>The greatest challenge was creating an algorithm that only targets certain words to modify within the text post</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>The aspect of this program that we are most proud of is creating a piece of software that does not harm either the victim nor the bully.</p>\n<h2>What we learned</h2>\n<p>We learned how to create a lightweight extension that can easily be installed on anyone's browser to promote ease of use.</p>\n<h2>What's next for Cats Against Bullying</h2>\n<p>We plan to incorporate some sort of way to enable the extension on the client side bully's computer to stupefy the harasser and discourage further provocation.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://pwnsec.co/opt.zip\" rel=\"nofollow\" target=\"_blank\" title=\"http://pwnsec.co/opt.zip\">\n<i class=\"ss-icon ss-link\"></i>\n<span>pwnsec.co</span>\n</a></li>\n<li><a href=\"http://pwnsec.co\" rel=\"nofollow\" target=\"_blank\" title=\"http://pwnsec.co\">\n<i class=\"ss-icon ss-link\"></i>\n<span>pwnsec.co</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Engineered and Programmed the Algorithm and the Java beta file."]], ["Watson Advertising", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/RLtGW4Tcjeg?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>In the past few years, the attention span of the human being has dropped from 12 seconds to 8 seconds. When viewed from the perspective of the advertising industry, this change in attention span amounts to a waste of millions of dollars of lost revenue. Advertising plays a fundamental role in the dissemination of information for nearly every corporation and the overloading of advertising has served to the determent of all companies involved. \nIn order to match with the present trends of the people,today's information spreading methods need to become more individualistic and less in the form of generic background noise the average consumer. In order to do so, we thought about improving something that everyone sees everyday, the digital billboard. Through the utility of the Watson API which is basically something which detects the type of things you're interested in based on you're appearance, age and gender in order to spread information that is relevant to individuals as well as supplementation by Google's Vision API, our billboards are able to further tailor and select advertising which is more impacful in their daily lives and thus help people gain knowledge about products they are more likely interested in. </p>\n<h2>What is Watson Advertisements</h2>\n<p>Watson Advertisement is an enhancement on the existing billboard by presenting relevant advertisements to people that are eyecatching providing a greater hit on the amount of the advertising which actually leads to an actionable result. The advertisement technique involved is using a camera which takes pictures of the area in front of the billboard at set intervals of time and uses the Watson API in order to categorize certain aspects of the visible and then change the billboard information into a relevant topic for a particular demographic. \nWatson advertisement only displays information that is relevant to the people that are standing in front of it and does not displays anything that is not relevant to the set of people around it. \nFurthermore, if a person is interested in a project, it is seen that the person looks at that particular advertisement for about 10 seconds and this billboard just need 8 seconds to know whether the person is interested or not based on whether if the person is present in the consecutive picture of the surrounding. If the person is present, then the billboard will display a video which is relevant to the image that was displayed earlier so as to slowly gather the attention of people.</p>\n<h2>Challenges</h2>\n<p>A major problem what we faced was decreasing the latency from the stream into the Watson API as the camera must take pictures at certain intervals of time while being subject to a constantly changing view. The addition of latency makes it difficult to have responsive and immediate feedback to the viewer and cuts into the already short attention span. Our solution to this problem was to create a cloud server that could give lesser latency as well as subvert a technical limitation of the Nest Cameras inability to connect to Enterprise or Captive network through a laptop wifi passthrough. </p>\n<h2>What's next?</h2>\n<p>In order to make this a fully refined product, we would focus on using any USB camera in order to take the input that is able to distinguish in between the objects, have minimal latency, and hence can enable the Watson API to analyse images at a really fast rate and based on that display a more responsive which is suitable based on the type of people present around it. Advertisements to be displayed also have the potential of being downloaded directly from advertising partners who can update them at their own discretion. \nThese billboards can be used in order to ensure that the company can push it's product to the consumer who are actually in need of it and the advertising done by the company becomes much more resourceful than it usually is.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/json\">json</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/nest\">nest</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ionic\">ionic</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/go\">go</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/git\">git</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/github\">github</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bluemix\">bluemix</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/azure\">azure</a></span></li><li><span class=\"cp-tag\">vision</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ibm-watson\">ibm-watson</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/heroku\">heroku</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/visual-studio\">visual-studio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/sublime-text\">sublime-text</a></span></li><li><span class=\"cp-tag\">wifi</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/karunchillz/HackRice2016\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/karunchillz/HackRice2016\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I reverse engineered the stream protocol used by the Nest camera,  which I then used to rip still frames which were then analysed by Watson ", "I helped in integrating the NEST camera with the server and worked on the algorithm in order to know which advertisement to show based on the camera input based on outputs given by the Watson and Google Vision API.", "I created the backend server which will get input from the NEST camera and output the advertisement onto billboards. I created a magic number algorithm which will take into account the different people in the key frame segmented by age, gender and emotions coupled with time and location to display context sensitive advertisements."]], ["who knows", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<p>???</p>\n</div>\n</div>", [""]], ["hackCatApp", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Well, we don't like average images, we like cats. </p>\n<h2>What it does</h2>\n<p>Replaces every image on a webpage with a cat picture</p>\n<h2>How we built it</h2>\n<p>Simple javascript to change the </p>\n<h2>Accomplishments that we're proud of</h2>\n<p>No more average pictures. Only cats</p>\n<h2>What we learned</h2>\n<p>Cats &gt; people</p>\n<h2>What's next for hackCatApp</h2>\n<p>Our real project, hackat</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/Meracoid/hackCatApp\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/Meracoid/hackCatApp\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", "", ""]]]