[["CHOPtimization", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"CHOPtimization – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/445/637/datas/gallery.jpg\"/>\n<p>\n<i>Title Slide</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>Smoothing the flow of patients in and out of hospitals can help reduce overcrowding, prevent poor handoffs, and can avoid delays, all of which affect the patient’s experience at the hospital.  Our project focuses on optimizing patients flow at CHOP, reducing the time it takes for a patient to arrive at the emergency room and then be seen by a doctor. Our goal is to decrease the wait time for patients and improve the customer experience patients have at the hospital. Right now, the process is not very transparent and patients are not given an estimated wait time. With our predictive algorithm, we are able to map the available beds in the emergency room and give the charge nurse and estimate for how long patients will be waiting. We began by creating an algorithm that takes in a set of inputs from the charge nurse and then outputs an estimated wait time for the patients. The inputs include the patient's name, age, and severity of diagnosis, all of which determine how long their wait time will be. We made sure to incorporate the fact that higher severity patients will need to be seen first and also the current availability of beds and when those patients currently in the emergency room will be discharged. This will help improve the ER experience for both nurses and patients.</p>\n</div>\n</div>", [""]], ["WaterMark", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://player.vimeo.com/video/196003300?byline=0&amp;portrait=0&amp;title=0#t=\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"WaterMark – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/251/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>Collecting water samples is a necessary step that precedes any analysis that tests for pesticides, bacteria, or volatile organic chemicals. The traditional method of collecting the samples involves the physical presence of the researcher who fills in a container and brings it back for analysis. But often this procedure represents a huge challenge.</p>\n<p>In fact, especially with increased cognizance of serious environmental and ecological problems, a safe and efficient way of collecting samples is in high demand. Several ideas have been explored where drones strapped with cameras take photos of polluted / damaged sites, but no definitive design has emerged, especially within the realm of physical data collection.</p>\n<p>Our system seeks to combine an unmanned aerial vehicle (UAV) and a water sample collection device to provide a cohesive aerial drone system for collecting water samples at pre-­defined locations. The system includes a quadrotor / hexrotor aerial drone programmed to move to pre­-defined locations based on GPS and water sample collection device that can store multiple samples without cross­-contamination.</p>\n</div>\n</div>", ["Water sampling", "", "", ""]], ["SmartSpace", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://player.vimeo.com/video/195879128?byline=0&amp;portrait=0&amp;title=0#t=\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"SmartSpace – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/295/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>Our web app allows students to explore Penn's study spaces and find which study spots are open. This saves students precious study time and helps optimize the use of Penn's study space resources. We are applying an Internet of Things solution to determine if a study spot is open or taken. More specifically, we are using infrared sensors to determine if a person is sitting at a study spot. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ruby-on-rails\">ruby-on-rails</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c\">c</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/arduino\">arduino</a></span></li></ul>\n</div>\n</div>", [""]], ["FMCW Radar", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"FMCW Radar – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/579/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Abstract</h2>\n<p>Radar systems help drive much of the modern world, especially unmanned vehicles, on land, in the air, and even in space. Measuring distance accurately and robustly is incredibly important for allowing autonomous systems to sense their environment. Radar is one of the most reliable ways to measure distance, as it is not impaired by poor visual conditions (e.g. fog, rain, or bright lights), unlike lidar.</p>\n<p><strong>Frequency Modulated Continuous Wave (FMCW) radar,</strong> can be much more robust than traditional radar. While other systems rely on measuring a signal's change in <em>time</em> (which relies on very precise clocking &amp; is susceptible to noise), FMCW measures a shift in <em>frequency</em> to detect an object's distance (far easier to achieve in real-world environments).</p>\n<p>Our project will demonstrate an FMCW radar system on a Printed Circuit Board (PCB), with transmitted frequencies ranging from 1 to 2 GHz, with target resolution of 1 centimeter at 1.0 meter. The data will be fed into a computer for processing &amp; visualization. We are investigating the possibility of creating an array of antennae, to gather more data about the environment.</p>\n</div>\n</div>", ["", ""]], ["Ecofol.io", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Ecofol.io – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/584/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Ecofol.io – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/587/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p><strong>Project description:</strong> </p>\n<p>The Sustainability Game Project will develop a functional web application that will make individualized suggestions to users about how they can lead more environmentally-friendly lifestyles. Key features of the application are as follows:</p>\n<ol>\n<li> People who are interested in environmental sustainability will input data on their transportation, housing, purchasing habits, and work.</li>\n<li> The web application will suggest specific changes to users based on their inputted data on how they can reduce their environmental impact.</li>\n<li> There will be a gamified incentive system to encourage users to change their behavior by comparing their environmental impact (measured in carbon emissions) to that of other users who can be added as friends.</li>\n</ol>\n<p><strong>Problem statement:</strong></p>\n<p>This project addresses the problem of the negative contributions to the environment by an aggregate number of people not living sustainably. It also addresses the lack of individual responsibility in sustainability (as opposed to corporate responsibility). To date, these problems have been handled via the following ways: \n• Websites/organizations recommending generic set of suggestions on how to reduce environmental impact.\n• Websites/apps calculate a user’s specific environmental impact, but cannot provide specific suggestions to reduce impact.\n• Users taking their own initiative to research specific ways to reduce environmental impact.\n• Limited incentives for individuals to take individual responsibility in sustainability.</p>\n<p>This project will be an improvement to those ways because our web application will calculate a user’s specific environmental impact by leveraging carbon emissions databases and APIs.\nUnlike other existing websites that provide a generic set of suggestions, this application will provide tailored suggestions on how to reduce environmental impact and metrics (carbon emissions) on how user’s action on suggestions reduces environmental impact.\nGamification of web application by comparing a user’s environmental impact to that of other users on the app (who can be added as friends) will grow the user base and incentivize repeated usage.</p>\n</div>\n</div>", ["", "", ""]], ["Team 06 - EdAcá", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/HuB9j_9RbLo?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"Team 06 - EdAcá – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/453/284/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>In today’s era of globalization, the need for developed cross-cultural educational initiatives is more pronounced than ever. Historically isolated regions, in particular, are seeing enhanced educational horizons due to an emerging industrial and nonprofit sector. One such region – coffee-growing Nicaragua – has been the beneficiary of work with the Seeds for Progress Foundation, a 501 (c) (3) nonprofit organization focusing on improving access to quality education and healthcare in Nicaragua.</p>\n<p>The foundation’s flagship program, Digital Seeds is a holistic educational model designed to improve reading, writing and math skills; innovate processes and methods of teaching and learning; and integrate technology into the educational environment through intensive professional development and individual accompaniment of teachers. However, this initiative is currently limited by the technological sophistication of its operation. There is a demonstrated need for a software that will facilitate more efficient, reliable, and robust collection, processing, analysis, and visualization of key educational efficacy metrics. </p>\n<p>This project aims to improve the quality of educational systems in rural Nicaragua by building an end-to-end software solution that will optimize the data collection and evaluation process, including testing metrics and resource utilization. Already underway, the project is currently in the pilot phase, with a functional prototype expected by December 2016. Feedback will then be gathered from end users, which, combined with stakeholder needs, will be used to refine the prototype into a product ready for handoff in Spring 2017. Extended applications of this technology will be explored during this same time frame. It is expected that the software will be broadened to include capabilities in similar educational econometrics across a wide range of countries and initiatives. Ultimately, the future potential of this project equates to a “one-stop-shop” educational tool within the education space on a global scale.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li></ul>\n</div>\n</div>", ["", ""]], ["Team 2: Goalytics", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/Ro41lLRkOTA?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"Team 2: Goalytics – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/738/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Inspired by Moneyball, we plan to create a tool that will take sports analysis from single-player stats to multi-player models. Using a video parsing tool that we built, we will collect data from video recordings of the Penn and Dartmouth's varsity men's soccer team games, analyze it using algorithms that our team builds, and use those results in a graphic application that coaches could use to plan team line-ups.</p>\n<h2>The mathematics behind the model</h2>\n<p>The network model, formally a Markov chain, assigns nodes to each player on the field, and connects these nodes using passing rates estimated from real data. We define additional nodes connected to each player, representing the “gain” or the “loss” of possession, and the “shot” of the ball. Starting from the “gain” state and using the learned rates to determine the likeliness of different ball paths through the network, we estimate the probability that the ball will end in a shot instead of a turnover. We call this metric the probability of shooting before losing the ball (PSL). We empirically validate that this metric is strongly correlated with a team’s win percentage.</p>\n<p>Our model allows to analyze which actions have the most significant impact in improving the winning probability before a game and act accordingly. Managers can learn which lineups provide the highest PSL. By looking at an opponent’s network, a manager can determine the opponent’s PSL and disrupt their chain. Furthermore, our model can be used to value players and player combinations. A manager can be able to tell if an acquisition is worthwhile given the change in PSL or a team can find players on the market that best fit its game strategy, maximizing the value of a purchase and detecting underpriced players. </p>\n<h2>What our technology does</h2>\n<p>We’ve defined a central database as the core component of our project. The idea is that we would use our completed video processing tool to feed data into the database, which feeds important metrics and statistics of “key events” that happen throughout a given game into the database to be stored. The definition of a “key event” consists of, for example, recording passes, shots, shots on target, ball returning to field, and interceptions. In addition, each event has many descriptors. For example, when a pass occurs, it might be important to note which player made the pass and to who, if it was on target, if it was hit with the left or right foot, etc.</p>\n<p>We have also designed a database that consists of these “key events” for individual games. We are preloading it with English Premier League data that we already have. We will later replace this data with that from Penn and Dartmouth soccer games once those videos are fully parsed. Coming out of the database is summary statistics and visualization for our end users to view and play around with.</p>\n<p>There are two parts to visualization: (1) individual player valuation and (2) team valuation. If we think about a soccer team as a Markov chain, the individual player valuation concerns a sensitivity analysis of a node on the Markov chain, while team valuation consists of defensive and offensive strategies to increase the probability of shooting before losing the ball (PSL). We plan on summarizing the statistics for a team both historically and for a given day (ex: Today, the team didn’t work out because a particular player didn’t do as well. If a center forward doesn’t take enough shots in a given day because he/she didn’t get the ball often enough, then we might blame the center forward, but it might not be his/her responsibility.) We want to give a coach a way to graphically modify the soccer team and these modifications’ effects on PSL, and we want to strive to see if we can come up with a way to suggest specific types of players that are good for particular positions and come up with an optimal lineup ourselves.</p>\n<h2>What's next for Goalytics</h2>\n<p>By the end of the fall semester, we plan on having a barebones version of our app completed. We will polish the app afterwards and test it by coordinating with our partners to play around with the app and ask for feedback.</p>\n</div>\n</div>", ["", ""]], ["Tilt Rotors Transportation System", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Tilt Rotors Transportation System – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/744/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>Tilt Rotors Transportation SystemWe plan on modeling the organ transplant system with the constraints of this new vehicle. As tilt rotors have much more favorable parameters and capabilities than traditional helicopters, we seek to compare an optimized transportation model with the current transportation system. The implementation of this model will require 2 major components that we will need to develop:</p>\n<ul>\n<li>Optimization model (potentially using Excel or Matlab) that considers supply and demand parameters to optimize organ transportation routes. \n-Interface that allows the use of the model and the input of different parameters</li>\n</ul>\n</div>\n</div>", [""]], ["Philadelphia Resource Network", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Philadelphia Resource Network – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/742/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>Food insecurity is a major issue in Philadelphia that reaches across many different demographic groups. Current estimates indicate that more than one in five Philadelphians are food insecure. Websites and apps that are currently available to help people find community resources—the most obvious being Google Maps—fail to account for important demographic information. Needy Philadelphians don’t just need the food pantry that is the closest to their homes; the best fit accounts for family size, access to transportation (e.g. ability to afford SEPTA tokens), gender, religion and many other factors. Additionally, many resources require people to bring particular forms of identification, proof of residence, or proof of neediness. People who aren't aware of these requirements could waste time and money getting to a center that ultimately cannot serve them. We aim to address this issue, a filling an “Information Gap,” and create something that will be immediately useable for the community. </p>\n<p>We are working on developing an app and website that can help solve this problem. The technology we develop will accomplish this goal in two primary steps. First, it will return a manageable amount of suggested resources. Second, it will provide the user with important information about these resources, such as what to bring, hours of operation, directions, and reviews from other users. We will also form partnerships with community organizations (such as churches and libraries) to ensure that what we develop is accessible to needy Philadelphians.</p>\n</div>\n</div>", ["", "", "", ""]], ["Predictr", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/zDCJz22qUF0?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n</ul> </div>\n<div>\n<p>In the past few years, digitally-native vertical brands became one of the primary ways people shopped. Think Everlane, Dollar Shave Club, Harry's, Warby Parker, and Casper. All these companies created their brand and following, online, and manage their own supply chain. </p>\n<p>The problem then is, how do they forecast demand for their new products, through only online interactions? Pre-orders work to a certain degree, but how does their online promotional activity affect sales? </p>\n<p>To solve this problem, we've created and designed Predictr.</p>\n<p>Predictr uses multiple models to optimize and find the best one to fit your sales data. Accounting for trend, seasonality, and one-time promotional events, it gives you best estimates for what your future sales will be.</p>\n<p>To build this, we've utilized R forecasting package and full-stack web development to 1) learn and find the most optimal forecasting model and 2) design the front-end tool that e-commerce retailers can use. </p>\n<p>Coming with no backgrounds in R, we buckled down and learned the diverse forecasting models in the forecast package. We've learned of so many statistical models along the way (e.g. BATS, smoothing methods, neural networks, etc).</p>\n<p>Future: We're looking into how this tool can be used to predict sales for new products as well!</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/r\">r</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/excel\">excel</a></span></li></ul>\n</div>\n</div>", ["", ""]], ["Bookworm", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://player.vimeo.com/video/195894474?byline=0&amp;portrait=0&amp;title=0#t=\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"Bookworm – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/456/760/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>The process of buying and selling textbooks is a challenge that most Penn students face every semester, and it has yet to be conquered in a successful way. Oftentimes students spend exorbitant amounts on textbooks at the beginning of each semester, and fail to resell them after use--whether that is because the bookstore will not buy them back, or the students are simply lazy and/or cannot connect with the right buyers. Between the expense, the weight, and the space they take up, having used textbooks around is truly a burden. Existing platforms that enable students to buy and sell textbooks are inconvenient and inefficient, as they require significant effort and often do not result in a transaction--let alone clear the market.</p>\n<p>Thus, Bookworm aims to become the most convenient and efficient solution on the market for all textbook problems. In terms of front-end, Bookworm is a mobile app with an easy-to-use interface and features such as a barcode scanner that speed up the process of uploading books. The back-end of the app employs an algorithm that corresponds to a double auction economic model designed to optimally match buyers and sellers of a given textbook by finding a competitive equilibrium and clearing the market.</p>\n<p>By taking care of the matching process for users, Bookworm eliminates the burden of having to wait for a buyer or seller with the complementary supply or demand, respectively. The algorithm also maximizes the number of transactions possible given the price ranges requested by the users, providing users with the greatest probability of success in solving their textbook problems. With each iteration of the algorithm for a given book, in addition to falling within each user’s requested ranges, the price is consistent for every buyer-seller pair, making the process fair for anyone involved. Both the convenience factor as well as the matching algorithm give Bookworm a competitive edge over existing platforms because they improve user experience in making textbook transactions. </p>\n<p>Fall semester our focus was on developing both this economic model and corresponding algorithm, as well as the fundamental features of the app. The algorithm was tested with data collected from a survey and proved to be efficient in that it cleared 90% of the market, and of the buyers and sellers who were not paired to make a trade, not one of them requested a price that a rational counterpart would accept. We plan to beta test the app in January as students look to sell their books from fall semester and buy their books for spring semester, and we will improve the app accordingly based on feedback regarding user experience.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/objective-c\">objective-c</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xcode\">xcode</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/firebase\">firebase</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li></ul>\n</div>\n</div>", ["", "", ""]], ["DigIt", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/NGt4rSCy6zw?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"DigIt – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/779/datas/gallery.jpg\"/>\n<p>\n<i>Title Slide</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Abstract</h2>\n<p>The DigIt project goal is to develop a website that can be a tool to help people garden in the empty lots throughout the Philadelphia area. By taking in certain inputs such as the size of the land, the time people are willing to commit, and preferences towards crops, the tool will provide a plan showing how many seeds to purchase and when to plant the seeds. Depending on whether the user wants to maximize profit or nutritional yield the model will follow different constraints to maximize the user's choice. </p>\n<h2>Inspiration</h2>\n<p>Currently, grocery markets charge a high price for healthy nutritional produce. As a result, many low income families are unable to get a balanced and nutritional diet, leading to other unhealthy alternatives that could be physically damaging in the future. Simultaneously, there are also a lot of open lots throughout Philadelphia that are not being used. Current research and past efforts suggest that by using empty lost to generate produce, many low income households would be able to purchase produce at a cheaper price. By studying past efforts and examining the reasons for failure, it is possible to create a better system that is able to solve the known difficulties. Our proposed solution is worth trying not only because of the overwhelming benefits it provides to society, but also because the project considers possibilities that were not considered for previous efforts. Ultimately, DigIt will solve the problem of costly nutritional produce by providing an application that gives step by step instructions to farming based off of specified inputs so that local communities can grow their own food.  </p>\n<h2>What it does</h2>\n<p>DigIt is an online tool that individuals in the West Philadelphia area can use to help make the process of planning and implementing a community garden more efficient. There are thousands of vacant lots in the Philadelphia area. It is possible to purchase one of these locations or obtain permission to convert the lots into a community garden, thereby creating a great opportunity to provide nutritional produce to the community at a low cost. Our tool uses the Simplex algorithm to generate a model that will assist users who have information about a plot in optimizing which crops to grow to maximize their preferences, profit, or nutritional return. The site will also send reminders to the user concering actionable items regarding their plot within the garden. In order to obtain a permit to convert one of these plots, individuals must provide the city with a plan for continued attention to the project. Our product will help to increase the number of gardens approved by the city, by providing a clear plan to those interested. The value of our product goes beyond gardens and offers great social and environmental benefits.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/excel\">excel</a></span></li><li><span class=\"cp-tag\">lingo</span></li></ul>\n</div>\n</div>", [""]], ["VariChill ", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"VariChill  – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/771/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>Abstract</p>\n<p>Each year, more than 3 million people die from diseases that can be prevented by widely available vaccines. Approximately 1.5 million of these deaths are in children less than 5 years old. The primary reason for these deaths is that vaccines must be stored at a specific temperature at all times. The goal of our project is to create a solar powered refrigerator that can be used for vaccine storage in developing nations - particularly in areas with limited access to the power grid. As per guidelines set by the World Health Organization, the fridge will maintain an ambient temperature of between 2 and 8 degrees Celsius and will be able to maintain said temperature without access to solar power for up to 5 days.  We hope to achieve this goal through the use of thermoelectric cooling elements, ultra-effective insulation and a passive heat exchange system. A wireless-enabled embedded system will monitor and control the refrigerator's temperature, duty cycle and other key features.  The entire system can be powered via a solar panel array, the battery backup or grid power (when it is available). </p>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://www.youtube.com/watch?v=k8Szf0wJzaE&amp;feature=youtu.be\" rel=\"nofollow\" target=\"_blank\" title=\"https://www.youtube.com/watch?v=k8Szf0wJzaE&amp;feature=youtu.be\">\n<i class=\"ss-icon ss-link\"></i>\n<span>www.youtube.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I work on the Electrical Engineering elements such as circuit and power system design, and solar integration.", "I work mechanical engineering, heat transfer, manufacture and design parts. ", "I work on the Computer Engineering elements such as microcontroller development and online data posting", ""]], ["Pineapple Prodigy", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Pineapple Prodigy – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/792/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Abstract</h2>\n<p>Our project focuses on developing software to find and teach a game theoretically optimal solution (or as close as we can get to that) for a poker variant called “Pineapple Open Face Chinese Poker” (or Pineapple OFC for short). We will create a program that uses combinatorics and probability to analyze the game and also allows users to input situations and view the computer’s analysis of the best move. The game is far too complex to solve through brute-force computation alone, so we will be solving it in pieces-- for the final two turns by exhaustive search of the game tree, and for earlier stages, by implementing good strategies that humans use and refining the strategies by collecting and evaluating data. The game of Pineapple is new, complex, and relatively unprobed from a mathematical and game theoretical perspective, so we anticipate being able to make significant steps toward finding new, better strategies.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c\">c</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/matlab\">matlab</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/r\">r</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/sql\">sql</a></span></li></ul>\n</div>\n</div>", [""]], ["Senior Design Team 19", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Senior Design Team 19 – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/801/datas/gallery.jpg\"/>\n<p>\n<i>Slide 2</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Senior Design Team 19 – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/802/datas/gallery.jpg\"/>\n<p>\n<i>Slide 4</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Senior Design Team 19 – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/803/datas/gallery.jpg\"/>\n<p>\n<i>Slide 6</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Senior Design Team 19 – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/804/datas/gallery.jpg\"/>\n<p>\n<i>Slide 3</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Senior Design Team 19 – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/805/datas/gallery.jpg\"/>\n<p>\n<i>Slide 1</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Senior Design Team 19 – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/806/datas/gallery.jpg\"/>\n<p>\n<i>Slide 7</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Senior Design Team 19 – screenshot 7\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/807/datas/gallery.jpg\"/>\n<p>\n<i>Slide 5</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Game makers have been doing a great job at creating realistic 3-D models of virtual worlds. However, adding real player models/images into those 3-D worlds is still a challenge for the industry. </p>\n<h2>What it does</h2>\n<p>We would like to build a system that could extract realistic player model in real-time and put them in virtual 3-D worlds so that multi-player realistic virtual reality gaming can become true. The particular application that we are thinking of is a simple ball-tossing game. However, the technology can be easily implemented in other multi-player virtual reality games. </p>\n<h2>How we are going to build it</h2>\n<p>We will use multiple depth sensors and cameras to extract user 3-D information in real-time, build model from these information, and put the built 3-D model into a virtual world.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/kinect\">kinect</a></span></li><li><span class=\"cp-tag\">camera</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/oculus\">oculus</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c\">c</a></span></li></ul>\n</div>\n</div>", ["", "", ""]], ["Theragym", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Theragym – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/815/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>The Rehabilitation Robotics lab from Perelman School of Medicine seeks to build an affordable robotics gym for countries where the shortage of rehabilitation professionals and access to them prevents a full recovery post-injury for a large majority of the population. This gym includes a variety of different machines which allow operation without physician oversight leading to strong clinical outcomes, and a fun, interactive therapy in the form of video games. The project has been started, but is not close to completion. </p>\n<p>Our team will focus on working with pedal bikes which will strengthen the lower arm, upper arm, and legs of the patient. These pedal bikes currently do not have any smart features, however we intend on adding an IMU in order to track the speed and number of rotations the patient pedals. Using this information, we will create an algorithm that will then feed back to the bike to power a stepper motor. This stepping motor would allow us to automatically rotate the knob that adjusts the level of resistance the bike pedals have. If time allows, we would also add force sensing to the bike pedals in order to gather information on how the patient grips the handles and use that data to inform us on how the patient is doing as well. Furthermore, as a software component we intend on building a web app that will allow physicians to follow the progress of various patients who are using the machines to see if desired goals and outcomes are being reached. If we have time, we also want to create games for patients who are using the pedal bikes (ie. integrating with a known game such as Temple Run). </p>\n<p>A large component of our project will involve prototyping and testing quickly, because we want to deliver a usable product so getting input from our users and iterating accordingly will be extremely fundamental in our process. Ultimately, we hope our project will help to create a usable smart pedal bike system and our progress will allow the Rehabilitation Robotics lab to complete their vision of an affordable gym for developing countries. </p>\n</div>\n</div>", ["", ""]], ["ESE450-SuperResolution", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"ESE450-SuperResolution – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/817/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Upscaling low resolution video using a super resolution framework to reduce bandwidth.</h2>\n<p>The goal of our project is to build a mobile application that upscales low-resolution images and video. Every day hundreds of millions of  videos travel over wireless networks all around the world. Everyone who has a mobile phone wants to watch video in the highest resolution available, but sending and receiving high resolution video takes an excessive amount of bandwidth. Combine general trends in video communication with the rise of video streaming as a service on mobile devices, and it’s clear why communication networks are strained for bandwidth. Even recently, large companies such as AT&amp;T have forced customers into using lower default resolutions when streaming video. With our product, customers will no longer have to make a decision between using less data and watching higher resolution video. We intend to make it as easy to send/receive/view high resolution video as it is to normally send and watch video. Viewing any video within our application will upscale the video in real-time using state-of-the-art fast super-resolution algorithms, with the option to save the higher resolution video for later. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c\">c</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/matlab\">matlab</a></span></li></ul>\n</div>\n</div>", ["", "", ""]], ["F.I.R.E.", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"F.I.R.E. – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/830/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>Our goal is to implement RSA Encryption on an FPGA to focus on building a low power and small sized encryption module that will operate with limited computational power. We will implement 2048-bit signing and verification from the bottom up to provide security for IOT devices, credit card chips, and many more data sensitive technologies.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag\">verilog</span></li><li><span class=\"cp-tag\">fgpa</span></li></ul>\n</div>\n</div>", ["Verilog implementation", "Algorithms and RSA optimization ", ""]], ["Robotic Indoor Gardening", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Robotic Indoor Gardening – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/832/datas/gallery.jpg\"/>\n<p>\n<i>HydroGro</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>ROBOTOC INDOOR GARDENING SYSTEM</h2>\n<h2>Abstract</h2>\n<p>Per many experts, Philadelphia schools are currently performing below state mandates. This is a result of underfunding and several governmental budget cuts, and in the end the children are the ones who suffer most, especially children who come from low-income families. The School District of Philadelphia is committed to ensuring that all children are adequately educated, despite the budgetary issues the District is facing. They are, however in need of creative and cost effective solutions to this problem that would allow students to learn as much as they can and foster interest in learning as well. Our goal is to provide disadvantaged students with the opportunity to pursue hands-on projects and activities and as an interdisciplinary group of engineers we chose to focus more on the STEM related subjects such as those relating to Botany, Chemistry, Ecology, Taxonomy, Robotics, Energy, Sustainability, Agronomy, etc. We will design and manufacture an automated indoor gardening system that is cost effective and easy to operate. It is to be used as an educational tool on the variety of topics already mentioned and possibly to enable people living in arid, low-income countries to grow a variety of plants with minimal user input. Through our research and manufacture thus far we have found that a well monitored hydroponic system, paired with basic microcontrollers will and a few sensors, will be able to solve the identified problem more than adequately.</p>\n<p><strong>Key words:</strong> Education, Hydroponics, Plants, STEM, Robotics</p>\n</div>\n</div>", ["", ""]], ["Hydro-Gro", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Hydro-Gro – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/834/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>ROBOTOC INDOOR GARDENING SYSTEM</h2>\n<p><strong>Abstract</strong></p>\n<p>Per many experts, Philadelphia schools are currently performing below state mandates. This is a result of underfunding and several governmental budget cuts, and in the end the children are the ones who suffer most, especially children who come from low-income families. The School District of Philadelphia is committed to ensuring that all children are adequately educated, despite the budgetary issues the District is facing. They are, however in need of creative and cost effective solutions to this problem that would allow students to learn as much as they can and foster interest in learning as well. Our goal is to provide disadvantaged students with the opportunity to pursue hands-on projects and activities and as an interdisciplinary group of engineers we chose to focus more on the STEM related subjects such as those relating to Botany, Chemistry, Ecology, Taxonomy, Robotics, Energy, Sustainability, Agronomy, etc. We will design and manufacture an automated indoor gardening system that is cost effective and easy to operate. It is to be used as an educational tool on the variety of topics already mentioned and possibly to enable people living in arid, low-income countries to grow a variety of plants with minimal user input. Through our research and manufacture thus far we have found that a well monitored hydroponic system, paired with basic microcontrollers will and a few sensors, will be able to solve the identified problem more than adequately.</p>\n<p><em>Key words: Education, Hydroponics, Plants, STEM, Robotics</em></p>\n</div>\n</div>", [""]], ["Self Cerv", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/drfLrxW5FO4?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"Self Cerv – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/927/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>We plan to design, build, and test a handheld cervical cancer detection device.With more than a billion women worldwide without access to cervical cancerscreening, hundreds of thousands of women fall victim to this silent killer. Ourdevice could potentially save millions of lives by making it easy and cost efficientfor self screening of cervical cancer.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/raspberry-pi\">raspberry-pi</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/react-native\">react-native</a></span></li></ul>\n</div>\n</div>", [""]], ["WikiTrends", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/EqCnhYjsbhI?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n</ul> </div>\n<div>\n<p>After the presidential election of 2016, the power of the media is clear. Not only were we forced to recognize that the media can greatly shape our beliefs with their biases, we also had to reflect upon how social media is creating isolating chambers of news, where we're fed news that confirms our opinions, instead of challenging them.</p>\n<p>We recognized this problem, and are creating tool that doesn't learn what articles you like, but provides you with the raw information surrounding every event, letting you form and challenge your opinions constantly.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/express-js\">express.js</a></span></li></ul>\n</div>\n</div>", ["", "", ""]]]