[["KinectVR", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Going into a project with the hopes of playing with cool hardware, we decided to combine two pieces of equipment that individual do great things, the kinect and Oculus. Individually, we could make some pretty neat hacks, but when we combined the two pieces of hardware, we realized we would be able to create a cheap, easy to setup virtual interactive environment.</p>\n<h2>What it does</h2>\n<p>KinectVR allows for full room positional tracking of a person, and combined with an oculus, allows for a virtual viewpoint of the room around you. Your entire body becomes part of whatever you create.</p>\n<h2>How we built it</h2>\n<p>Using unity integration for the kinect and the oculus rift DK2, we are able to get some basic features out of the box. We ended up having to write a full skeletal tracking system for the player model. </p>\n<h2>Challenges we ran into</h2>\n<p>After bricking two computers, we learned that the Oculus drivers do not play nicely on windows 10. A couple hours later (and a couple of system restores) and we were still frustrated with the lack of support on windows 10 for the Oculus rift. With support channels claiming the issue to be hardware related on the laptop side, whereas an older download of the driver would allow us to run demo programs perfectly, but would crash on our code. After about 12 hours of debugging, and testing what we could, we were fortunate enough to find a friend that had the same laptop model as us, but with windows 8 installed.\nWindows 8 worked a ton better, but we still had an issue of the Oculus blanking it's screen after a few rapid head turns. Surprisingly, a different HDMI cord fixed this issue, even when we knew the Oculus's HDMI cord was fully functional.\nAlong the way, we also faced issues with inconsistent kinect sdk documentation</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We're really proud of how smooth the overall project is. Delving into this idea, we were scared of latency between the kinect and Oculus, creating motionsickness and disorientness that we saw with many Oculus demos. Overall, the program has no noticeable latency between the kinect and the Oculus, and the desktop program is fully usable on an above average laptop.</p>\n<h2>What we learned</h2>\n<p>Many of us did not know any Unity going into this project. Each of us can now comfortably say that we would be able to make a simple, if not moderately complex unity program. We also got to use some hardware not typically available to us, and learn the features and advantages of each hardware system.</p>\n<h2>What's next for KinectVR</h2>\n<p>Included in KinectVR is some mock ups for an interactive game, as well as a virtual desktop for a more work centered environment. We hope to have the time to expand upon these concepts, and get a fully functional virtual desktop out of what we currently have. We would also, with more processing power and possibly more kinects, would like to get augmented reality integrated into the project. We had some moderate success with this to begin with, but unfortunately lacked the power to do much with it.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/oculus\">oculus</a></span></li><li><span class=\"cp-tag\">csharp</span></li><li><span class=\"cp-tag\">vr</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/kinect\">kinect</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/SamNChiet/KinectVR-Hackathon\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/SamNChiet/KinectVR-Hackathon\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Worked on the hardware setup (and 12 hours of debugging) as well as software, design, and testing.", "I worked on designing the user interface. I helped with the desktop widgets as well. ", "I worked on design in unity, troubleshooting issues on windows and testing.", "I did the programming, including the 3D UI framework, Oculus integration and custom implementation of a Kinect skeletal tracking system."]], ["Reizoko", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Reizoko – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/936/datas/gallery.jpg\"/>\n<p>\n<i>Home Screen</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Reizoko – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/937/datas/gallery.jpg\"/>\n<p>\n<i>Recipe Information</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Reizoko – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/938/datas/gallery.jpg\"/>\n<p>\n<i>Table Entry for Image Identification</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Reizoko – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/939/datas/gallery.jpg\"/>\n<p>\n<i>Recipe thumbnail</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Reizoko – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/940/datas/gallery.jpg\"/>\n<p>\n<i>Sample Ingredient Image</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Reizoko – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/941/datas/gallery.jpg\"/>\n<p>\n<i>Nutritional Information</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Reizoko – screenshot 7\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/942/datas/gallery.jpg\"/>\n<p>\n<i>Related Recipes</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>The Name</h2>\n<p>Reizoko means fridge in Japanese.</p>\n<h2>Inspiration</h2>\n<p>Everyone has food in their fridge, but not everyone knows how to cook. So, in typical millennial fashion, we decided that we never wanted to have to look in a cookbook again.</p>\n<h2>What it does</h2>\n<p>Reizoko allows users to take pictures of the items in their fridge, compiles them into a list of ingredients, and returns the optimal recipe as well as relevant information and suggestions.</p>\n<h2>How we built it</h2>\n<p><strong>Step 1: The Front End</strong> \nWe began our design with the mantra of simplicity. We built an easy to use interface which ultimately leads users to take pictures of food items they would use to cook. The entirety of the front end was written from scratch in Swift in Xcode, which offered us flexibility in coding style.</p>\n<p><strong>Step 2: Image to Text</strong>\nAfter the user took a picture, we used the CloudSight API, an image processing API, to identify which food product was represented in the image and then return raw data representing that product. The next step was to use natural language processing in order to convert that raw data into a form usable by our next API, Spoonacular.</p>\n<p><strong>Step 3: Text to Recipe</strong>\nThe final step in our project, we used the spoonacular API in order to find the optimal recipe based on the list of ingredients, returning the recipe for which we had the most ingredients. The API returned a json object which we then used to extract raw information including the number of ingredients in the recipe that the user owned, the rating of the recipe, and a URL that we could display locally in the app with all relevant instructions.</p>\n<h2>Challenges we ran into</h2>\n<p>The first challenge we ran into was that two of the people on our team did not know Swift for an iOS project. Then, we realized that one member of our team couldn't even run Swift because he has a PC, which we overcame by setting up a connection to a fellow teammate's Swift server, a function developed by one of the mentors (Gautam Mittal) in a previous project. Moreover, many of the API's we planned on using ended up requiring payment or lacked proper documentation, prompting us to email certain companies requesting full access for a Hackathon, a strategy that proved effective in most instances. Even after receiving access to the API's, we had never worked with REST API's, which posed a new challenge and many hours of seemingly pointless debugging, as is common with learning new subject matter. Finally, the quintessential Hackathon challenge of of time forced our team to really come together and outline ambitious but still reachable (through a combination of sleep deprivation and one too many red bulls) goals.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>First and foremost, we as a team had a cool idea and in less than twenty-four hours, we created a fully functional app from scratch. Moreover, we overcame differences in individual visions of the app to create a complete product which combines our passions and viewpoints.</p>\n<h2>What we learned</h2>\n<p>One of the most important things we learned at this Hackathon as the value of having a unified vision. We realized a few hours in that if we were all freelancing different parts of the app, we would end up with five different parts for five different apps. Thus, we had to periodically appoint a new person as the \"head\" of the team, who would put forward their vision for the app and point everyone else in the right direction to reach that end goal. Moreover, we solidified our knowledge of swift and the nuts and bolts of iOS app making. Finally, we learned that the technical aspect of any app is only one part of the user experience. Contrary to our expectations coming into the Hackathon, we spent the most time developing a sleek, elegant, but easy to use design for a product.</p>\n<h2>What's next for Reizoko</h2>\n<p>The core of Reizoko is not the product, but rather the people, and we as a group are highly motivated and prepared only for further growth. Our ideas for expansion include but are not limited to:\n    <strong>1) Take one picture of fridge and separate contents automatically.</strong>\n<strong>2) Make the image identification process faster.</strong>\n<strong>3) Maybe build our own classifier for food.</strong>\n<strong>4) Add filters allowing users to specify cuisine, diet type, and nutritional restrictions among other fields.</strong></p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag\">spoonacular-api</span></li><li><span class=\"cp-tag\">cloud-site-api</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/imgur\">imgur</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/kgupta99/Reizoko\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/kgupta99/Reizoko\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on the front end, as well as fixed various issues with the server calls.", "I worked mainly on the front-end and implemented some back-end web scraping.", "I worked on the backend using Alamofire to send HTTP requests, and I specifically integrated the spoonacular and CloudSight REST API's into our iOS project.", "I worked on using the REST API's, as well as on troubleshooting various technical issues. I learned a lot about Swift, REST API's, and debugging. ", ""]], ["Stats Engine", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Stats Engine – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/341/053/datas/gallery.jpg\"/>\n<p>\n<i>Initial Unloaded GUI for StatsGine</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>While in statistics class we realized inputting data into calculators can be quite menial, and a task that can be easily automated. Further more, students of lower socioeconomic backgrounds sometimes do not have access to tools like the TI84 calculator, which allow them to utilize statistical procedures, whereas they might have access to computers in their schools. We used the synergy of these two principles to inspire the statisticians of tomorrow. </p>\n<h2>What it does</h2>\n<p>Our Java application has the user specify URL with a search term, or something desired to be found on the web page.\nA java web crawler using Jsoup then finds urls, with that search term, and returns any relevant quantitative data to a statistics engine. The statistics engine performs user requested calculations and presents that calculated data in an appropriate format. It can perform basic statistical analysis of one or two links, Z-Test Confidence Intervals and Hypotheses tests, along with the corresponding T-Test Procedures. It can also calculate various forms or regression and upon choosing the optimal equation, display it graphically. </p>\n<h2>How we built it</h2>\n<p>Jsoup- With the help of Jsoup we created a java web crawler that finds the first instance of the inputted search term.\n The program then parses the page the search term is located on, and gets relevant quantitative data with regard to the search term. \n Statistical Engine- Using  the Jsoup web crawler and integrating bing search query, we quickly found functions to use to perform calculations like normal distributions, student's distributions, as well as various regressions.                                        </p>\n<h2>Challenges we ran into</h2>\n<p>Because we only found out about JSoup halfway through the hackathon, our original web-crawler tried checking the content using a rudimentary HTML Parser we wrote ourselves, which was susceptible to code that did not follow standard formatting conventions. To solve this, we researched, and replaced our method with a methods from JSoup that reversed our process and therefore received the same result without compromising memory.</p>\n<h2>Accomplishments that we're proud of</h2>\n<pre class=\"language-nolang\"><code> We are quite proud of the integration with Bing, because we had to study HTTP request protocols to integrate Bing search query with Java, such that our algorithm can get results that are fine-tuned to what the user requests. We are also quite proud of our dysfunctional, self-built HTML parser, but it needs to be refined before we can implement it in an algorithm such as this.\n</code></pre>\n<h2>What we learned</h2>\n<p>We learned search engine query integration, as well as the complexity of many, many statistic formulas we often took for granted, as well as, of course, the importance of teamwork!</p>\n<h2>What's next for Stats Engine</h2>\n<p>We hope to improve the GUI, and include more statistical analysis options. We are also looking into refining the web-crawler such that results are loaded more efficiently and presented in an easy to view and understand fashion.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jsoup\">jsoup</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/json\">json</a></span></li><li><span class=\"cp-tag\">bing-query</span></li></ul>\n</div>\n</div>", ["I created a Content Reader that searched through the HTML for elements containing the search text, and then went up the hierarchy, to take the node, lower in hierarchy to only the body tag, from the HTML file and display it to the user, as well as to separately evaluate any info-graphics for relevant data. I also integrated Bing Web search with our Java program, and designed the front-end.", "I worked back-end utilizing Jsoup, and Java. Primarily, I worked on the web crawler portion of the program, using a Jsoup algorithm to retrieve the document displayed on the URL, and getting links on that document.  ", "I used Riemann Sums to simulate integrals and normal and T Curves (everything pertaining to statistics). I also integrated information from the web-crawler into data tables to make it easier to read."]], ["SwiftAssist", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/nHZcqUjdpNs?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"SwiftAssist – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/470/datas/gallery.jpg\"/>\n<p>\n<i>Notifications work in both the app and out of it.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"SwiftAssist – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/471/datas/gallery.jpg\"/>\n<p>\n<i>Get notified when you can possibly save a life!</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"SwiftAssist – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/472/datas/gallery.jpg\"/>\n<p>\n<i>Instantly notify all the people who are certified or suited to help you in the area.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"SwiftAssist – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/473/datas/gallery.jpg\"/>\n<p>\n<i>Request help when you are in need.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"SwiftAssist – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/474/datas/gallery.jpg\"/>\n<p>\n<i>Get instant directions to the emergency, or use Apple's Maps to get there.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"SwiftAssist – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/488/datas/gallery.jpg\"/>\n<p>\n<i>Login screen allows users to specify if they are certified to help others.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"SwiftAssist – screenshot 7\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/800/datas/gallery.jpg\"/>\n<p>\n<i>Swipe right to automatically respond.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"SwiftAssist – screenshot 8\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/826/datas/gallery.jpg\"/>\n<p>\n<i>Pebble App allows someone to send for help right from their wrist.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"SwiftAssist – screenshot 9\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/837/datas/gallery.jpg\"/>\n<p>\n<i>Pebble App allows someone to send for help right from their wrist.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"SwiftAssist – screenshot 10\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/838/datas/gallery.jpg\"/>\n<p>\n<i>Pebble App allows someone to send for help right from their wrist.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"SwiftAssist – screenshot 11\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/968/datas/gallery.jpg\"/>\n<p>\n<i>Web based control center allows emergency responders to change user data.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"SwiftAssist – screenshot 12\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/969/datas/gallery.jpg\"/>\n<p>\n<i>Web based control center allows certified responders to quickly view and respond to local emergencies</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"SwiftAssist – screenshot 13\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/970/datas/gallery.jpg\"/>\n<p>\n<i>Web based control center allows government emergency centers to view and respond to every emergency around the world.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"SwiftAssist – screenshot 14\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/341/007/datas/gallery.jpg\"/>\n<p>\n<i>Sparkfun photon paired with Microsoft Azure triggers emergency response if humidity or temperature in a house is at a dangerous level.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"SwiftAssist – screenshot 15\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/341/008/datas/gallery.jpg\"/>\n<p>\n<i>Sparkfun photon paired with Microsoft Azure triggers emergency response if humidity or temperature in a house is at a dangerous level.</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>Crowdsourcing emergency response to bring you the help that you need, faster.</p>\n<h2>Inspiration</h2>\n<p>Average 911 emergency response time in the United States is 10 minutes and 17 seconds.</p>\n<p><strong>Serious allergies or asthma attacks can cause permanent damage or death in 5.</strong></p>\n<p>We decided to build this app because we know multiple people who have serious allergies and we know that such an application would make them feel infinitely safer and could potentially save their lives.</p>\n<h2>What it does</h2>\n<p>SwiftAssist crowdsources emergency response so that people who carry allergy medication, EpiPens, are CPR certified, or are a doctor can immediately respond to emergencies close to them, <strong>faster than 911.</strong>\nPeople in dire need of help can send for help through a Pebble or iOS app with an easily accessible button. This request will then be processed, and every person in the area who is certified to help and can reach the location faster than 911 will be notified instantly.</p>\n<p>The Web app is a control center where anybody can view all the emergencies that have been reported and view all activity that is going on, which would be useful to somebody at an emergency response system. In addition to this, it uses the Linkedin API to find concentrations of doctors in each area.</p>\n<h2>How we built it</h2>\n<p>We used Firebase to store user data and for instant notifications. We use Pebble.js for the Pebble app. We use iOS and MapKit for the iOS application. We used Azure and the Photon board for a project to monitor weather data and relate it to emergency frequency.</p>\n<h2>Challenges we ran into</h2>\n<ol>\n<li>iOS Push Notifications. We ran into a lot of problems implementing Azure Notifications Hub for iOS.</li>\n<li>Getting Photon to work with Azure.</li>\n</ol>\n<h2>Accomplishments that we're proud of</h2>\n<ol>\n<li>Getting Photon to work with Azure. None of us had very much C++ experience, but we were very proud when we finally interfaced and transferred weather data that could be analyzed by Azure.</li>\n<li>Getting the app to work fully. We're very proud of this accomplishment and really believe that our app will save lives.</li>\n</ol>\n<h2>Things that we learned</h2>\n<p>We did not have any previous experience with Pebble, and were able to build a fully functional and styled app use Pebble.js. Every member of our team can now confidently say that they know their way around Pebble. In addition to this, using Microsoft Technologies took quite a learning curve, but now much of our team has a greater understanding of how Azure functions.</p>\n<h2>What's next for SwiftAssist</h2>\n<p>Android app, working more with Photon, emergency response directions from Pebble.</p>\n<h2>Demo login and pass</h2>\n<p>Username: <a href=\"mailto:sohan@account.com\" rel=\"nofollow\">sohan@account.com</a>\nPassword: vichare</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/iphone-sdk\">iphone-sdk</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/pebble\">pebble</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/azure\">azure</a></span></li><li><span class=\"cp-tag\">photon</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/firebase\">firebase</a></span></li><li><span class=\"cp-tag\">electron</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css3\">css3</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag\">materialize.css</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/linkedin\">linkedin</a></span></li><li><span class=\"cp-tag\">linkedin-api</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/sohanvichare/SwiftAssist\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/sohanvichare/SwiftAssist\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"https://swiftassist.github.io\" rel=\"nofollow\" target=\"_blank\" title=\"https://swiftassist.github.io\">\n<i class=\"ss-icon ss-link\"></i>\n<span>swiftassist.github.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I built the complete iOS application and worked on backend database structure.", "I did hardware and coding of the Sparkfun photon and helped with the video as well as the backend.", "I learned how to use Pebble.js to build applications for the Pebble smartwatch, and then built our Pebble client. Additionally, I helped debug our web and iOS clients and designed our icons.", "I made the entire web app and integrated firebase and made the backend "]], ["Bitcoin Benefactor", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Doing social good while making a fun game.</p>\n<h2>What it does</h2>\n<p>Allows the user to role play as a wealthy philanthropist bent on granting his entire fortune to organizations working for the greater good. Bitcoin Benefactor attempts to reprogram the average user's consumerist mentality by suggesting that giving can be just as satisfying as getting. At the end of the game, the user is linked to a series of actual charity websites and encouraged to make a real donation.</p>\n<h2>How we built it</h2>\n<p>With the Swift sprite kit on Xcode.</p>\n<h2>Challenges we ran into</h2>\n<p>Learning a completely new programming language.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Learning Swift and finishing the application in time.</p>\n<h2>What we learned</h2>\n<p>How to use Swift to make iOS applications, how to design pixel art, how to work with image and audio files in the Xcode SDK, and how to run iPhone simulations.</p>\n<h2>What's next for Bitcoin Benefactor</h2>\n<p>Making it into an Android application (and worldwide fame).</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/sprite-kit\">sprite-kit</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xcode\">xcode</a></span></li></ul>\n</div>\n</div>", ["", "", ""]], ["m1ssinglink", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>That feeling when the Stack Overflow link is broken.</p>\n<h2>What it does</h2>\n<p>It archives the answers so that this problem will be prevented in the future.</p>\n<h2>How we built it</h2>\n<p>We used a rails API running on AWS, which receives and sends data to the extensions.</p>\n<h2>Challenges we ran into</h2>\n<p>We had trouble hosting the server on AWS.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We finally got AWS to host the server.</p>\n<h2>What we learned</h2>\n<p>How to make extensions on Chrome and Firefox.</p>\n<h2>What's next for m1ssinglink</h2>\n<p>We want to expand our service and potentially make phone apps for it.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ruby\">ruby</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ruby-on-rails\">ruby-on-rails</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/github\">github</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/git\">git</a></span></li><li><span class=\"cp-tag\">redbull</span></li><li><span class=\"cp-tag\">memes</span></li><li><span class=\"cp-tag\">dank</span></li><li><span class=\"cp-tag\">dank-memes</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/DevinMui/lah\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/DevinMui/lah\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"http://m1ssinglink.com\" rel=\"nofollow\" target=\"_blank\" title=\"http://m1ssinglink.com\">\n<i class=\"ss-icon ss-link\"></i>\n<span>m1ssinglink.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["FoodPict", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>The idea of <strong>FoodPict</strong> sprouted from our team when we were mentioning ideas and making an app that would tell the user what the nutrition facts of their food are.</p>\n<h2>What it does</h2>\n<p>It's still in development, but when it's done, it will help people choose better foods to stay healthy and still be able to share the pictures and videos with friends. </p>\n<h2>How we built it</h2>\n<p>One part of our team worked on the Android version of it, while the other team worked on the website. The Android team(of course) used Java and XML, and the Web Dev team used HTML &amp; CSS with the material design</p>\n<h2>Challenges we ran into</h2>\n<p>The biggest challenge that we ran into was being able to find a functional and free API for analyzing &amp; identifying objects in the scene. Other challenges may have taken a bit, but were not as troublesome as the API problem.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>One accomplishment that we're proud of is getting the Android Camera to properly open and correctly save pictures. </p>\n<h2>What we learned</h2>\n<p>One <em>MAJOR KEY</em> that we've learned is to make some type of concept or idea before we come to the hackathon if possible. </p>\n<h2>What's next for FoodPict</h2>\n<p>For FoodPict, we are planning on being able to release the stable app to help individuals in our current society where obesity is a common thing,</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css3\">css3</a></span></li><li><span class=\"cp-tag\">material-design</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xml\">xml</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/jiahaok/Scrappies\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/jiahaok/Scrappies\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"https://github.com/rnehoran/FoodPict\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/rnehoran/FoodPict\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on the Android application for the project, integrating image recognition API's in order to recognize the food that the user is planning to eat.", "", "", ""]], ["Lazy", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Lazy – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/341/048/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Most people are motivated by loss instead of gain - when someone knows that they can gain a reward, no matter how big it is, they'll still have the chance to put it off. But by showing them their losses, they are instantly motivated, because they are devastated with regret instead, and have no choice but to immediately change to make sure that they don't do the same mistake again. Lazy uses this philosophy to enhance the productivity experience and make a unique app unlike the thousands of other productivity apps out there.</p>\n<p>This psychology has also been proven with through a topic in economics and decision theory, called loss aversion. Loss aversion studies also suggest  that losses can be twice as powerful as gains psychologically.</p>\n<h2>What it does</h2>\n<p>Lazy is a simple one touch app. There are 2 modes to it - Work and Slack mode. All you need to do is tap the screen to switch modes, and Lazy will start recording the exact amount of time you are working or slacking off, and then presents it visually in a unique pie chart to show how much of the day you spent working or wasting time. There's also a motivation button at the button that will present fun quotes when tapped. Unlike normal productivity apps, these quotes will scold the user for not working in order to ensure the philosophy of motivation by loss.</p>\n<h2>How I built it</h2>\n<p>I used Xcode and Firebase to build the iOS app, and also built a mini web version companion as well.</p>\n<h2>Challenges I ran into</h2>\n<p>Certain animations were tricky to figure out such as the way the graph animates to fill up based on the different time values. Firebase was also tricky to get it working cross-platform.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<h2>What I learned</h2>\n<h2>What's next for Lazy</h2>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ios\">ios</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xcode\">xcode</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/web\">web</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/firebase\">firebase</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/kirankunigiri/Lazy/\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/kirankunigiri/Lazy/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I programmed and designed the whole app myself."]], ["Foci", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Foci – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/895/datas/gallery.jpg\"/>\n<p>\n<i>Optimal brightness monitoring ensures optimal luminous conditions</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Foci – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/896/datas/gallery.jpg\"/>\n<p>\n<i>Real time audio processing to find a favorable location</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Foci – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/897/datas/gallery.jpg\"/>\n<p>\n<i>Share your perfect location with others</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Foci – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/898/datas/gallery.jpg\"/>\n<p>\n<i>Boost memory retention by eliminating distractions</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>What it does</h2>\n<p>The app will run a test at a location to determine whether the location is a quiet place or not and the brightness of the location. The user can then use this information to determine if he/she would prefer that type of location. For an example, if the user is a student he may prefer a quiet and brightly lit area because those two main factors help with concentration. The app will run a test to determine if the location is adequate for the student's need.</p>\n<h2>How we built it</h2>\n<p>We used Swift to code the tests that the app runs. To code the audio test we recorded the environment for over a period of time and then we analyzed the decibel levels that we got from the voice recording. If the decibel level was below 60 then the environment is quiet, if it is between 60 to 70 decibels then the environment is moderately loud, and if it is greater than 70 decibels then the environment is too loud. For brightness we got the value of the the screen's brightness because the screen's brightness is adjusted automatically based on the environment's lighting. The value of the screen's brightness is between 0-100. If the value of the screen's brightness is below 25 then the location is not optimally lit. If the value is between 25 and 50 then the location is moderately lit and if the screen brightness is above 50 then the room is optimally lit.</p>\n<h2>Challenges we ran into</h2>\n<p>The hardest challenge we ran into was trying to make the test. Converting the voice recording to decibel units was the hardest part.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We are especially proud of getting the maps and current location to show up on our app. The iOS SDK does not allow the programmer to access system values, so we had to use other methods to get some of the values.</p>\n<h2>What we learned</h2>\n<p>We learned how to use the iOS SDK and various commands in the Swift programming language. We learned that iOS protects most of their settings so we had to be creative and think outside the box to get system values.</p>\n<h2>What's next for Foci</h2>\n<p>We are trying to add in a review system where the user at a location can rate the location.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/borisyue1/Foci\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/borisyue1/Foci\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked with creating the graphics and in process I also learned more about Swift", "I helped to debug some logic errors in the program, helped design the images on each view controller, and helped with the pitch of the idea.", "I worked on the UI, microphone, brightness sensor and developed the test  for determining whether a location is good or not for focusing.", ""]], ["Jarate", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Jarate – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/961/datas/gallery.jpg\"/>\n<p>\n<i>Favicon/Logo</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Jarate – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/962/datas/gallery.jpg\"/>\n<p>\n<i>App Image 1</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Jarate – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/963/datas/gallery.jpg\"/>\n<p>\n<i>Phone Image </i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Jarate – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/964/datas/gallery.jpg\"/>\n<p>\n<i>App Image 2</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Jarate – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/965/datas/gallery.jpg\"/>\n<p>\n<i>Background</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Jarate – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/966/datas/gallery.jpg\"/>\n<p>\n<i>Logo</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h1>jarate</h1>\n<p>For 2016 los altos hacks: <a href=\"http://jarate.co\" rel=\"nofollow\">http://jarate.co</a></p>\n<p>Jarate is an intelligently designed web and mobile application that can track the user's urine input and output the user's dehydration rate, amount of water needed to drink, and more (such as sleeping time and accessibility for other applications based on color. Coming soon.).</p>\n<p>With use of machine learning algorithms in order to optimize the difference between the RGB indices of the reference datapoints, we were able to develop an application that was both applicable in purpose and simple to use. These reference points were acquired from several credible sources we found online. We used the Microsoft Azure platform to perform much of the coding in this project.</p>\n<p>In addition, we incorporated the IBM Watson Language Identification API in order to allow user functionality for other native languages, such as Spanish and Chinese (however, this is still a work in progress).</p>\n<p>Overall, Jarate is an application that can bring both great social help to those who want to watch their health as well as maintain a simple and interactive interface with great expansive and helpful possibilities.</p>\n<hr/>\n<p>Sources\nPrevention,. 2014. \"What The Color Of Your Pee Says About Your Health\". Accessed January 31 2016. <a href=\"http://www.prevention.com/health/what-color-your-pee-says-about-your-health\" rel=\"nofollow\">http://www.prevention.com/health/what-color-your-pee-says-about-your-health</a>.</p>\n<p>Images.sampletemplates.com,. 2016. Accessed January 31 2016. <a href=\"http://images.sampletemplates.com/wp-content/uploads/2015/06/Urine-Color-Chart-Dehydration.jpg\" rel=\"nofollow\">http://images.sampletemplates.com/wp-content/uploads/2015/06/Urine-Color-Chart-Dehydration.jpg</a>.</p>\n<p>Cs229.stanford.edu,. 2016. Accessed January 31 2016. <a href=\"http://cs229.stanford.edu/proj2014/David%20Frankl,Machine%20Learning%20In%20JavaScript.pdf\" rel=\"nofollow\">http://cs229.stanford.edu/proj2014/David%20Frankl,Machine%20Learning%20In%20JavaScript.pdf</a>.</p>\n<p>Sciencedirect.com,. 2016. \" A Region Growing And Merging Algorithm To Color Segmentation \". Accessed January 31 2016. <a href=\"http://www.sciencedirect.com/science/article/pii/S0031320396001471\" rel=\"nofollow\">http://www.sciencedirect.com/science/article/pii/S0031320396001471</a>.</p>\n<p>Ccs.neu.edu,. 2016. Accessed January 31 2016. <a href=\"http://www.ccs.neu.edu/home/ekanou/ISU535.09X2/Handouts/Review_Material/zipfslaw.pdf\" rel=\"nofollow\">http://www.ccs.neu.edu/home/ekanou/ISU535.09X2/Handouts/Review_Material/zipfslaw.pdf</a>.</p>\n<p>Domain.com: <a href=\"http://urinedanger.com\" rel=\"nofollow\">http://urinedanger.com</a> </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li><li><span class=\"cp-tag\">apacheconf</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/nathan2wong/jarate\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/nathan2wong/jarate\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on mockups and the design of Jarate.", "", ""]], ["Real Lief", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Real Lief – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/981/datas/gallery.jpg\"/>\n<p>\n<i>main menu</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>The reason as to how we got the idea for this app is from us having too much stress during our school's finals. We wanted to make a really simple app, which would let the user use two different methods to reduce their anxiety. </p>\n<h2>What it does</h2>\n<p>Real-Lief is a stress reliever app, that features two unique stress relieving techniques. The first method, \"color generator\", produces random hex color values using \"math.random\". To use it, the user has to simply tap the blue circular button. As a result, the background will change to a randomly generated color. The process is simple, and easy to use. Moreover, the second method, \"tremble\" is another available option to relieve stress. When the triangular button is clicked, the mobile device vibrates for three seconds. A simple tap, can stop the vibration, and after the three seconds are over, the timer is re-set, and the user can feel free to start again. All of the options provide a back button, to the start screen of the application, allowing a simple transition between each method.</p>\n<h2>How we built it</h2>\n<p>Real-Lief is built through the use of Android Studio, using the language Java.</p>\n<h2>Challenges we ran into</h2>\n<p>We encountered some obstacles when designing the buttons, and implementing the color generator.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We're satisfied to know, that we successfully built an app, that any person can use to fight through a stressful experience.</p>\n<h1>What we learned</h1>\n<p>We learned how to generate random colors, and control the vibration settings in a phone.</p>\n<h2>What's next for Real Lief</h2>\n<p>We're in the process of adding more options a costumer can use to relive their stress. Another possible extension, could be a statistics screen which logs how many times a user clicks in each of the different  modes, displaying the options in usage from greatest to least.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/jas10022/Real-Leif\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/jas10022/Real-Leif\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I programmed the app using android studios. I also helped sameer brainstorm on idea to add on to our original ideas as well.", "I designed the UI of the app. I also, coded the vibration toggle which we used for one of the two stress relief methods."]], ["Feel The Bern", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<p>We were genuinely inspired by how uninvolved the youth are in politics. We wanted to make politics appealing to younger people. And a game where you blow up candidates is a great way to do this! Because who doesn't like blowing up stuff?? Also we're just all for Bernie.</p>\n<p>You play as Bernie the dragon and you shoot candidates that come flying at you with fire.</p>\n<p>We built it in spritebuilder and Xcode. </p>\n<p>Everything. (not knowing swift at all)</p>\n<p>Learning more about swift</p>\n<p>A lot about swift</p>\n<p>Make it better and more levels</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li></ul>\n</div>\n</div>", [""]], ["Evolutionary Code", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/Bqvgn0CggdA?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"Evolutionary Code – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/953/datas/gallery.jpg\"/>\n<p>\n<i>Maze Demo</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Evolutionary Code – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/960/datas/gallery.jpg\"/>\n<p>\n<i>Building your own maze</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p><br/>\nWe were frustrated by the amount of real-world problems that were being done by hand, yet could be automated with genetic algorithms.</p>\n<h2>What it does</h2>\n<p><br/>\nWe set out to create an experimental genetic algorithm that solves mazes. This example algorithm can be applied to a variety of different applications, including urban design, economy dynamics, bioinformatics, and many more optimization problems. </p>\n<h2>How we built it</h2>\n<p><br/>\nWe started with a broken skeleton of a grid-based maze system. We developed the logic behind the genetic algorithm to make it work not only for our purposes, but for a variety of other applications.</p>\n<h2>Challenges we ran into</h2>\n<p><br/></p>\n<ul>\n<li>Time management: Partitioning sleep and work. We ended up sacrificing efficiency by not sleeping. </li>\n<li>Overambition: Overestimating our abilities given the time provided. We originally planned to incorporate more complex applications, but did not have enough time to finish them with a high standard of quality.</li>\n<li>Git: Was a nightmare.</li>\n</ul>\n<h2>Accomplishments that we're proud of</h2>\n<p><br/></p>\n<ul>\n<li>Interactivity of the maze application</li>\n<li>Coordinating this group effort cohesively</li>\n<li>Committing to writing the genetic algorithm from scratch</li>\n</ul>\n<h2>What we learned</h2>\n<p><br/></p>\n<ul>\n<li>Better understanding of version control (Git)</li>\n<li>A <em>thorough</em> understanding of the genetic algorithm</li>\n<li>Taking breaks as a healthy way to relieve stress</li>\n<li>Agile development in minimal time</li>\n</ul>\n<h2>What's next for Evolutionary Code</h2>\n<ul>\n<li>A better question is: \"What <em>isn't</em> next for Evolutionary Code?\"</li>\n<li>Larger scale applications building upon the existing framework</li>\n<li>Expanding to a broader scope of industries</li>\n</ul>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag\">idea</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/mbacvanski/GeneticAlgorithms/tree/master\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/mbacvanski/GeneticAlgorithms/tree/master\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["Correct-Elect", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<p>It all started when Arvind and I were volunteering for Ro Khanna. We were going door to door canvassing for him and we found that all of the younger citizens had no idea what was going on regarding elections. When we asked them why that is the case, most replied that they just did not have time.</p>\n<p>Our app allows a user to see what elections are going on based on their district/zip code. We have combined our front end with government used API's that allows the user to quickly find out information they need. </p>\n<p>This is our first hackathon, and we came into this hackathon knowing very little about code. We attended workshops and were determined to learn. With help from the mentors, and perseverance, we ended up creating a simple website that has a broad target market and many applications.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css3\">css3</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li></ul>\n</div>\n</div>", ["I wrote the whole html and css from scratch. I designed the front-end of the website. Also, I incorporated bootstrap with css to make the website look nicer and add many great features.", "I worked on the back end aspect of the website. This included finding an API which included the criteria we were looking for. This criteria included the first and last name of the congressman, the state the zipcode was in, the party of the congressman, and the district the zipcode is in. Our API also covers a very wide range of information ranging from phone numbers to birthdays. I created a proxy server using crossorgin.me and was able to call my API from my browser. Ultimately I created the backend of the website which included finding APIs, calling APIs, acquiring API keys to access APIs, creating proxys to call those APIs, defining all the criteria desired to be included in the website, and writing the code to ensure the website is able to function. "]], ["Cute Rock Game", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Cute Rock Game – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/908/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>We were bored. Originally we intended to make a 2d game, but we eventually scrapped this project.</p>\n<h2>What it does</h2>\n<p>A cute rock controlled by arrow keys bounces around.</p>\n<h2>How we built it</h2>\n<p>Mostly java-script. We drew the rock ourselves.</p>\n<h2>Challenges we ran into</h2>\n<p>The fact that none of us had any real experience in HTML, JavaScript, and CSS made this very challenging, though we did have help from some great mentors (especially Sam Escapa!!!!!).</p>\n<h2>Accomplishments that we're proud of</h2>\n<h2>What we learned</h2>\n<p>We learned a great deal of JavaScript.</p>\n<h2>What's next for Cute Rock Game</h2>\n<p>Adding actual platforms, a destination goal to get to, and maybe a background and background music?</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li></ul>\n</div>\n</div>", [""]], ["SilentAlert", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"SilentAlert – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/958/datas/gallery.jpg\"/>\n<p>\n<i>SilentAlert is a minimalistic, easy-to-understand web app that allows people to safely contact 911 silently.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"SilentAlert – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/341/002/datas/gallery.jpg\"/>\n<p>\n<i>After users submit their info in SilentAlert, the \"911 operator\" (in this case, our phones), will receive an automated call from Twilio.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"SilentAlert – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/983/datas/gallery.jpg\"/>\n<p>\n<i>SilentAlert sends users a text message depending on the 911 operator's response.</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>After brainstorming social problems in society, we found out that human trafficking and kidnapping are one of the biggest problems. With movies such as Taken and Eden, we realized that were are a multitude of situations in which one may require emergency services but be unable to speak. We decided to make an app which could have the potential to save lives by translating text to speech to an emergency service operator, and thus Emergency Contactor was created.</p>\n<h2>What it does</h2>\n<p>Emergency Contactor allows users to submit text into a web form that asks for information such as location, name, phone number, and description of the situation.  The web form then uses Twilio to convert the text to speech, which will then be relayed to the operator.   The operator can then report the status of the situation by pressing a button on the phone. . </p>\n<h2>Challenges we ran into</h2>\n<p>Figuring out how to use Twilio, Twiml and node.js, how to retrieve the information of a button being pressed on the phone (ie. how to tell the program to do something after a number on the phone keypad, such as 1, is pressed) and how to use GeoLocation to collect location information about the caller.</p>\n<h2>Accomplishments</h2>\n<p>Finally figuring out how to use Twilio, using global variables in node.js and retrieving digits pressed on the phone.</p>\n<h2>What we learned</h2>\n<p>How to use Twilio, how to use global variables, how to create servers, how to retrieve digits pressed on the phone </p>\n<h2>What's next for Emergency Contactor</h2>\n<p>Figure out how to automatically provide location info about the caller, how to get the 911 operator to be able to communicate more extensively with the caller, maybe using Voice to Text services</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/twilio\">twilio</a></span></li></ul>\n</div>\n</div>", ["", "", "", ""]], ["VR Public Speaking Prep", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"VR Public Speaking Prep – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/911/datas/gallery.jpg\"/>\n<p>\n<i>Scene</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Kevin and Matthew, attending the hackathon at first as a pair, met Justin and Marissa during lunch. The four decided to come together and make a team, and build a life changing application. Many ideas were brain stormed, some written down, some thrown away. There were so many possibilities! They decided to target a large problem emerging in today's society, especially the young people-public speaking. </p>\n<h2>What it does</h2>\n<p>The virtual reality application utilizes the power of the Oculus Rift to give a unique experience than any other screen. It gives the user the feeling of standing before a crowd at a podium to deliver a speech. This is to simulate a real life situation. The user is given a customizable script, that he/she will read. The speech recognition software verifies that all the words spoken are correct and accurate. The Myo even furthers the realistic feel. It shows a pair of hands that can be used to rehearse hand gestures, or identify negative hand tendencies. All these core technologies come together into one to deliver a powerful, efficient solution to nervous rehearsals in front of the bathroom mirror.</p>\n<h2>How we built it</h2>\n<p>The application was build with one idea in mind-make the experience as real as possible. Kevin worked on the main scene of the application. All the people, the podium, the building, and the microphone were designed and implemented by him. Matthew worked on the Microsoft Speech API, to ensure that there was a fully functional speech recognition software. Justin worked on the Myo, to make sure that the hand gestures were accurate and precise. Marissa worked on the website, to make a efficient site that was also beautiful. After each part was completed, they were brought together as one, and VR Public Speaking Prep was born.</p>\n<h2>Challenges we ran into</h2>\n<p>Some challenges that were encountered were the issues with making the Microsoft Speech API work well with the Unity scene, having the Oculus Rift work on Windows 10, due to Oculus' non-support of Windows 10, and making the accurate hand gestures for the Myo.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>The team is proud of their hard work and dedication on this project. They worked well together, even going to other similar groups to lend help, and had fun while working on the entire project. They were doing something they enjoyed.</p>\n<h2>What we learned</h2>\n<p>What was learned was that teamwork, hard work, and dedication can go very far. Also, Oculus Rift does not do well with Windows 10.</p>\n<h2>What's next for VR Public Speaking Prep</h2>\n<p>The team is looking to improve upon the design, and clean up a lot of the possible errors. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--2\">c#</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/oculus\">oculus</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/myo\">myo</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/amazon-web-services\">amazon-web-services</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/domain\">domain</a></span></li><li><span class=\"cp-tag\">microsoft-speech</span></li></ul>\n</div>\n</div>", ["I worked on the Microsoft Speech Recognition API in C#, and getting the Oculus Rift to work with other hardware. What I learned was that teamwork and dedication will help you achieve any goal, and that anything is possible. I made new friends during this life changing experience.", "I worked on getting the unity scenes set up. I worked on modeling and building the virtual reality setting. I also cleaned up the speech recognition application, and integrated the Myo and the speech recognition into one. Through this hackathon, i have learned the value of meeting new people and working with them. At every hackathon i've been to, i always stayed with a pre-planned group. This time, we teamed up with others, and met up with many others which made the event all the more exciting. I Also learned that using new hardware can be very tricky, but it can be very rewarding if you get it working. Finally, i learned how to code in c# and use unity", "Linked the myo to Unity 3D and the Oculus Rift, calibrated movement for player, a lot of trial and error until accomplishment. This is my second hackathon and I met a number of great people all  extremely knowledgeable in a variety of computer languages, programs, and hardware. ", "I supported the team by bringing drinks and food. I made sure everybody was well nourished so that they could type faster and have fantastic ideas. Luckily, my groupmates were nice enough to teach me more about coding, for it was my first time. :)"]], ["Mercari", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Mercari – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/886/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Mercari – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/887/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Mercari – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/888/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Mercari – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/889/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Mercari – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/932/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Mercari – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/933/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Mercari – screenshot 7\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/934/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>As high–schoolers, we haven't had the opportunity to work with many companies or startups; however, with Mercari we are trying to connect people with ideas to those that can create the idea in exchange for equity in the company. Instead of working for no salary, anyone can bid on projects; if the seller – the person with the idea – agrees, they exchange contact information and can work together.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xcode\">xcode</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/spring\">spring</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/uikit\">uikit</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bootstrap\">bootstrap</a></span></li><li><span class=\"cp-tag\">materialize</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mapkit\">mapkit</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/parse\">parse</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google-maps\">google-maps</a></span></li><li><span class=\"cp-tag\">apple-maps</span></li></ul>\n</div>\n</div>", ["I built the web app of Mercari with the help of Jai Sankar. We both worked on front-end and back-end while finding strategic solutions to difficult problems along the way. ", "I, along with Sriharsha, worked on the web app. We both worked on backend and frontend, and together we solved many issues along the way.", "I built the entire iOS side of Mercari and filmed the awesome promotional video for the application.\n", ""]], ["Conway's Game of Life", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Our APCS teacher mentioned in class and it sounded interesting. We decided to take it a step further and make a program. </p>\n<h2>What it does</h2>\n<p>It simulates cell growth across as many generations as you like. </p>\n<p>Rules:</p>\n<ol>\n<li><p>A “neighbor” of a cell is defined as any living cell touching that cell. For example, a cell has 8 possible neighbors, but only the ones that are alive count as neighbors.</p></li>\n<li><p>Any living cell with one or zero neighbors will die of loneliness, while any living cell with four or more living neighbors will die from overcrowding. These are \"deaths\".</p></li>\n<li><p>Any living cell with two or three neighbors will continue living into the next generation (no change).</p></li>\n<li><p>Any dead cell with exactly three neighbors will come to life in the next generation. These are \"births\".</p></li>\n<li><p>All births and deaths occur simultaneously. </p></li>\n</ol>\n<h2>How we built it</h2>\n<p>We used IntelliJ as an IDE and Java as our language.</p>\n<h2>Challenges we ran into</h2>\n<p>The graphics were a little difficult to create. The logic for determining neighbors took some time and debugging.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Graphics and the efficiency of the algorithm.</p>\n<h2>What we learned</h2>\n<p>We learned how to write efficient code and turn something simple into a complex structure.</p>\n<h2>What's next for Conway's Game of Life</h2>\n<p>Allow the user to add individual cells whenever they want.\nAdd a pause button.\nMake the grid infinitely sized.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li></ul>\n</div>\n</div>", ["", "", ""]], ["CandidateCatch", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"CandidateCatch – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/847/datas/gallery.jpg\"/>\n<p>\n<i>SOCIALISM!</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"CandidateCatch – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/848/datas/gallery.jpg\"/>\n<p>\n<i>The Donald.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"CandidateCatch – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/849/datas/gallery.jpg\"/>\n<p>\n<i>Born in Canada.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"CandidateCatch – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/850/datas/gallery.jpg\"/>\n<p>\n<i>Chillary Clinton</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"CandidateCatch – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/851/datas/gallery.jpg\"/>\n<p>\n<i>Our app logo.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"CandidateCatch – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/875/datas/gallery.jpg\"/>\n<p>\n<i>The bucket used to catch the heads.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"CandidateCatch – screenshot 7\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/909/datas/gallery.jpg\"/>\n<p>\n<i>Background for the game.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"CandidateCatch – screenshot 8\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/917/datas/gallery.jpg\"/>\n<p>\n<i>Title screen.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"CandidateCatch – screenshot 9\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/341/042/datas/gallery.jpg\"/>\n<p>\n<i>Game in action - candidate heads falling on the bucket</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>On the first day of my Government class, someone asked why Trump was a communist... Clearly, politics wasn't that big of an issue for students in my high school. </p>\n<h2>What it does</h2>\n<p>This bucket-ball game of political trivia increases political awareness among younger generations by \"gamifying\" politics just in time for the 2016 elections. Candidates' faces, represented as balls, fall from the top of the screen as the user tries to catch them in buckets labeled with political statements. If the candidate would agree with the labeled statement on the bucket, the user gets a point! Woohoo! And the user learns more about that certain candidate!</p>\n<h2>How we built it</h2>\n<p>We developed our iOS app on XCode using Swift 2.0. We relied heavily on the Sprite-Kit framework to create our game scene and animate the dropping balls and sliding bucket.</p>\n<h2>Challenges we ran into</h2>\n<p>One of our biggest challenges was accurately positioning the sprites on the screen where we wanted them to be and to get the candidate heads to fall faster the longer they were falling. In addition, we wanted to get the heads to drop in a random order and random spacing—we enlisted Make School for help with this.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We are proud of the idea behind our app and its goal—namely, that we are trying to increase political awareness among high schoolers. Many high school seniors and even some juniors will be able to vote this year, and so it was really important for us to create a game that would be educational as well as fun enough to keep them coming back to the app. We are also proud of what we could accomplish using Sprite-Kit, as it is the first time we used the framework.</p>\n<h2>What we learned</h2>\n<p>We learned how to use Sprite-Kit to develop games and make our apps more interesting. We also went through a series of iterations on our original idea, after which we realized a great app needed to be simple, educational, and overall mindlessly fun!</p>\n<h2>What's next for CandidateCatch</h2>\n<p>We want to include local and state election candidates as well, which typically have even lower voter turnouts. We also want to generate candidates based on geographic location.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/sprite-kit\">sprite-kit</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xcode\">xcode</a></span></li><li><span class=\"cp-tag\">csv</span></li><li><span class=\"cp-tag\">isidewith.com</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/gimp\">gimp</a></span></li><li><span class=\"cp-tag\">textedit</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/github\">github</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/Hackathon-Team/CandidateCatch\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/Hackathon-Team/CandidateCatch\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", "", ""]], ["OnBoard", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/asqzJ82S6oQ?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"OnBoard – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/869/datas/gallery.jpg\"/>\n<p>\n<i>Discussion feature for each of the pinned cards so the biggest design decisions do not get lost</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"OnBoard – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/870/datas/gallery.jpg\"/>\n<p>\n<i>Whiteboard functionality to draw out your design and explain each component, allowing members to visualize and build on ideas</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"OnBoard – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/871/datas/gallery.jpg\"/>\n<p>\n<i>Get OnBoard to bring your ideas to the front</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Why do we hack? To solve problems. We start with a goal, and test our ideas to solve a problem. We start with a brainstorm - we deliberate over our ideas, each of us trying to explain the design, discussing the pros and cons. Post-it notes on a wall, scribbles on a sheet of paper, markers on a whiteboard, but in the end it's hard for everyone to voice their ideas and most of our notes are illegible gibberish. As we build, designs get revised, we continuously go back to the drawing board, repeating this process countless times.</p>\n<p>Ideas get lost, reasoning behind decisions are forgotten, we lose focus, and a seemingly easy project can get held up by the smallest obstacles. <strong>But now, we present to you OnBoard.</strong></p>\n<h2>What it does</h2>\n<p><strong>OnBoard brings your ideas to the front</strong>, allowing you and your team to easily focus on your design and manage your workflow. Get OnBoard with your team, and be able to share visual concepts, clearly explain your thoughts, and be able to bounce ideas off of your team members. Most of all, <strong>OnBoard puts the most important ideas first</strong>. Pinned cards with discussion threads ensure that the biggest design decisions do not get lost. Chat connects group members instantly, allowing for seamless communication. Draw out your design and explain each component, allowing members to visualize and build on ideas. Arrange boards in your workflow as your project evolves.<strong>OnBoard lets you take your ideas and collaborate.</strong></p>\n<h2>How we built it</h2>\n<p>OnBoard is an HTML5 website, powered by Javascript. Drawing functionality is through JQuery and Javascript’s canvas.We use Reactjs as our view library in conjunction with redux to manage the application state. </p>\n<h2>Challenges we ran into</h2>\n<p>OnBoards creation was slowed by not having a discussion forum that could effectively manage ideas and make our workflow efficient. </p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We are most proud of our whiteboard functionality and our discussion threads. By Getting OnBoard, you can use these to optimize your design process.</p>\n<h2>What we learned</h2>\n<p>Working on OnBoard taught us to value the design process. As we thought which functions would be most useful to teams, we were able to apply a lot of these ideas and guidelines to our own development. On the more technical side, we learned how to apply node packages and JS libraries. We gained insight on the most intuitive UI and UX, and we hope that this is evident in your experience with OnBoard.</p>\n<h2>What's next for OnBoard</h2>\n<p>OnBoard endeavours to continue making discussions more intuitive for groups. Additional functionality like a Kanban board, and the ability to join multiple groups will be added. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/windows-10\">windows-10</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/react\">react</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/gulp-js\">gulp.js</a></span></li><li><span class=\"cp-tag\">browserify</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bootstrap\">bootstrap</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/redux\">redux</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/nvisage/Nvisage\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/nvisage/Nvisage\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"http://nvisage.github.io/#/\" rel=\"nofollow\" target=\"_blank\" title=\"http://nvisage.github.io/#/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>nvisage.github.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on the canvas and draw functionality using HTML 5, JavaScript CSS, Jquery and node js packages. I contributed to the overall design and user interface. ", "I worked on the connecting system and modeling the data flows using redux. ", "I worked on the logo design, CSS styling for various aspects, and jQuery implementation into our project.", "Worked to solidify design goals, prioritize features. Developed ui and canvas for drawing, movable text, helped debug the overall user interface"]], ["MyFarm", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"MyFarm – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/863/datas/gallery.jpg\"/>\n<p>\n<i>Plot Area</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"MyFarm – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/843/datas/gallery.jpg\"/>\n<p>\n<i>Main View</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"MyFarm – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/864/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"MyFarm – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/885/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h1>MyFarm</h1>\n<p>MyFarm is an application for farmers in Myanmar that helps them manage their plots and farms of land. In response to the KPCB Social Good challenge at the Los Altos Hacks Hackathon, we built this.</p>\n<h2>Features</h2>\n<ul>\n<li> <strong>Water Management</strong> - Taking into account evaportranspiration and the crop factors, we calculate the liters necessary per day to farm a plot</li>\n<li> <strong>Nitrogen Enrichment</strong> - Based off crop and fertilizer type, exact amount of fertilizer needed is returned</li>\n<li> <strong>Plot Management</strong> - Farmers can delineate and manage plots, focusing on crop rotation</li>\n<li> <strong>Scheduling</strong> - How long and when to harvest a certain plot and crop</li>\n<li> <strong>Simple UI</strong> - Farmers can easily manage their land by walking around a plot, and designating its contents</li>\n<li> <strong>Managing Poor Network Connectivity</strong> - Because network connection in rural areas in Myanmar are not very reliable, all data is stored locally on the device, then synced with a cloud when network connection becomes available.</li>\n</ul>\n<h2>To-do features</h2>\n<ul>\n<li> <strong>Sharing Plot Information</strong> - Farmers can export their plots and plot information in an easy-to-access format, so farmers can share plot and farming information.</li>\n</ul>\n<h2>Contributors</h2>\n<p>Jake Glass, Mihir Trivedi, Louie McConnell, Peter Boennighausen</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li><li><span class=\"cp-tag\">farming</span></li><li><span class=\"cp-tag\">research</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/pboennig/MyFarm\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/pboennig/MyFarm\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"http://anchorparking.co/myfarm/\" rel=\"nofollow\" target=\"_blank\" title=\"http://anchorparking.co/myfarm/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>anchorparking.co</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I researched Burmese farming practices and implemented the calculation of necessary water and fertilizer. Ask me about evapotranspiration!", "I designed and wrote the Android app!", "", ""]], ["CampusDash", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"CampusDash – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/341/013/datas/gallery.jpg\"/>\n<p>\n<i>Landing page</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"CampusDash – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/341/011/datas/gallery.jpg\"/>\n<p>\n<i>To verify the phone number when registering for an account</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"CampusDash – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/341/012/datas/gallery.jpg\"/>\n<p>\n<i>Order screen</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"CampusDash – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/341/062/datas/gallery.jpg\"/>\n<p>\n<i>Raymond's (buyer) screen</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"CampusDash – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/341/061/datas/gallery.jpg\"/>\n<p>\n<i>Cathy's (Dasher) screen</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>We were inspired by the food truck outside the Microsoft building during Los Altos Hacks. We were kind of sad that our previous project didn't work out very well, but we realized that the food truck had food readily available for us, because they were called. We then thought of how our high school campuses are open, allowing students during lunch and free periods to go get food and such outside of campus. We thought it would be a good idea to have instead of a giant mass of people swarming the nearest restaurant, we could have people take orders for each other. It was a win-win situation in our eyes.</p>\n<h2>What it does</h2>\n<p>Our web application allows students to request food and view orders from their classmates. We used the Twilio API to send text messages to the students who order and to notify them of their order status, as well as to the \"Dashers\".</p>\n<h2>Challenges we ran into</h2>\n<p>Before we started CampusDash, we tried a project with the Edison board. We ran it to several issues while connecting the board to the command line.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We are proud of our password and email address verification, our Twilio API integration, and the CSS design.</p>\n<h2>What's next for CampusDash</h2>\n<p>The next step for CampusDash would be to create a chat room with the orderee and the student picking up the order. We would also like to format with different orders and delete the orders after a while.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ruby\">ruby</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/coffeescript\">coffeescript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/catzhang/CampusDash\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/catzhang/CampusDash\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I did the Twilio API integration and the empty/valid text field validation. I also contributed to the CSS.", "I worked on the phone number validation and helped with the CSS. ", "I worked on the backend of the project!", "I did a part of the CSS and I designed the layout of the program. I wasn't proficient in Ruby and Javascript, so I did my best with CSS."]], ["LocalTask", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>As we find it hard to get jobs as sophomores in high school that aren't flexible, we \nmade this app as an alternative for anyone who has a dynamic schedule.</p>\n<h2>What it does</h2>\n<p>An app that connects job specialists with someone in need in the same category. And vice versa.</p>\n<h2>How we built it</h2>\n<p>We made the site using JavaScript, HTML5, CSS and JQuery.</p>\n<h2>Challenges we ran into</h2>\n<h2>Accomplishments that we're proud of</h2>\n<h2>What we learned</h2>\n<h2>What's next for LocalTask</h2>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag\">atom</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://www.localtask.co\" rel=\"nofollow\" target=\"_blank\" title=\"http://www.localtask.co\">\n<i class=\"ss-icon ss-link\"></i>\n<span>www.localtask.co</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["Velocity", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Velocity – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/900/datas/gallery.jpg\"/>\n<p>\n<i>Example 2, but cooler.</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Velocity – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/901/datas/gallery.jpg\"/>\n<p>\n<i>Example 1!</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h1>VELOCITY</h1>\n<h1>A simple android lock screen replacement/overlay</h1>\n<h1>Features a todo list, digital clock, random inspirational quote and background</h1>\n<h1>inspired by Momentum Chrome extension</h1>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/rustielin/Velocity2\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/rustielin/Velocity2\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I created the digital clock, supplied a list of quotes, and created the background images. This was my first time using Android Studio!", "Implemented greeting, time, random background and quote generation, and scrollable to-do list. ", "I worked on the original part to cover the lockscreen, as well as saving the name feature", ""]], ["ElectroFighter", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"ElectroFighter – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/892/datas/gallery.jpg\"/>\n<p>\n<i>Title screen</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"ElectroFighter – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/893/datas/gallery.jpg\"/>\n<p>\n<i>In-game screen</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"ElectroFighter – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/894/datas/gallery.jpg\"/>\n<p>\n<i>Game-over screen</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>INSPIRATION</h2>\n<p>Joe and I had planned for months that we would go to the hackathon together, but once we got here, we realized that we had no idea what we were going to make. Just a few weeks ago, I was invited to a camp at Stanford hosted by <a href=\"http://js.io\" rel=\"nofollow\">JS.IO</a>, which is a platform for making any type of application, whether it be iOS, Android, or a web app. Best of all, it's coded in Javascript. At the camp, I got beta access to it, which is what we used to create this project.</p>\n<p>When we started to brainstorm, we though it would be great to make an application. It would be simple yet addicting, like Flappy Bird. </p>\n<h2>WHAT IT DOES</h2>\n<p>You are an SD card in the middle of a motherboard. The bytes are flying at you like crazy, and you must dodge them in order to not fill up your SD card and overflow your memory!</p>\n<h3>OBJECTIVE</h3>\n<p>Your goal is to get as many points as possible, which is achieved by staying alive. Each binary you successfully dodge is counted towards your score, which is shown at the top of the screen. There's even a high score part at the bottom to try and beat yourself! You have five lives.\nThere are also brackets <code>[]</code> which fly at you. When you collide with the brackets, you will gain points.</p>\n<h3>LEVELS</h3>\n<p>There are five levels. Every 100 points, you level up. When you level up, the maximum lives you have is diminished by one, but your lives are automatically filled to that maximum.</p>\n<h2>HOW WE BUILT IT</h2>\n<p>We built it with a program called <a href=\"http://js.io\" rel=\"nofollow\">JS.IO</a>, which is not public yet.</p>\n<h2>CHALLENGES WE RAN INTO</h2>\n<p>We ran into several challenges, including syntax errors, lack of sleep, hardware bugs (with the JS.IO servers we used) many, <em>many</em>, <em><strong>many</strong></em> bugs, and much more.</p>\n<h2>ACCOMPLISHMENTS WE'RE PROUD OF</h2>\n<p>We're proud that we made it through it, and were proud that we stayed up all night and didn't fall asleep. We're also proud that we made a website to showcase the app, which can be found here: <a href=\"http://electrofighter.co\" rel=\"nofollow\">electrofighter.co</a> (provided by <a href=\"http://pop.co\" rel=\"nofollow\">pop.co</a>!). We finished in time, and we met our standards!</p>\n<h2>WHAT WE LEARNED</h2>\n<p>We both learned how to push to GitHub, which is now where our entire project (500 lines!) is located. We also learned how to debug in a deeper way.</p>\n<h2>WHAT'S NEXT FOR ELECTROFIGHTER</h2>\n<p>Electrofighter has some pretty messy code and will probably get a rewrite soon enough, as well as a boss fight and a few other cool features. We're hoping to release it to the Google Play Store and the App Store soon!</p>\n<h2>WHAT YOU CAN CURRENTLY DO</h2>\n<p>Unfortunately, we don't have the licenses to submit these applications to the Google and Apple stores, but we have built (for free) a web version, which can be accessed below.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bootstrap\">bootstrap</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css3\">css3</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://electrofighter.co\" rel=\"nofollow\" target=\"_blank\" title=\"http://electrofighter.co\">\n<i class=\"ss-icon ss-link\"></i>\n<span>electrofighter.co</span>\n</a></li>\n<li><a href=\"https://weeby-producer-builds.s3.amazonaws.com/aq1g/5734144332005376/index.html\" rel=\"nofollow\" target=\"_blank\" title=\"https://weeby-producer-builds.s3.amazonaws.com/aq1g/5734144332005376/index.html\">\n<i class=\"ss-icon ss-link\"></i>\n<span>weeby-producer-builds.s3.amazonaws.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I contributed to the graphic design and debugging of this project.", ""]], ["cuts", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"cuts – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/841/datas/gallery.jpg\"/>\n<p>\n<i>look through a gallery of the most popular hairstyles</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"cuts – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/842/datas/gallery.jpg\"/>\n<p>\n<i>view hairstyles</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"cuts – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/836/datas/gallery.jpg\"/>\n<p>\n<i>users can like other profiles</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"cuts – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/853/datas/gallery.jpg\"/>\n<p>\n<i>edit your own profile</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"cuts – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/852/datas/gallery.jpg\"/>\n<p>\n<i>add your own photos</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>inspiration</h2>\n<p>inspired by hair</p>\n<h2>what it does</h2>\n<p>shares your haircuts</p>\n<h2>how I built it</h2>\n<p>typed characters via computer</p>\n<h2>challenges I ran into</h2>\n<p>sometimes worked so fast i couldn't read my code</p>\n<h2>accomplishments that I'm proud of</h2>\n<p>collabed on github with only one major mistake</p>\n<h2>what I learned</h2>\n<p>all you have to do is type the correct characters in the correct order</p>\n<h2>what's next for cuts</h2>\n<p>worldwide</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/mingyli34/cuts\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/mingyli34/cuts\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["wrote the whole thing", "Wrote the Profile class, helped debug some other stuff", "Wrote the other whole thing."]], ["Price Ninja", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h1>LAHax</h1>\n<p>Ben and Dylan's Los Altos Hacks hackathon project</p>\n<h2>How this project started</h2>\n<p>Ben and I were brainstorming what we should do at the beginning of the hackathon, and nothing sounded particularly appealing. Thinking back to reddit, I remembered the PriceZombie bot, a bot which replies to any comment with an Amazon link with information about the price of that item. Then, it hit me - why not put a spin on the PriceZombie?</p>\n<h2>What this website does</h2>\n<p>Price Ninja aggregates data from the eBay, Craigslist, and Amazon APIs and sorts the resulting data by price from lowest to highest, giving you the best deal on your search query. The user's city and state are sent with Craigslist requests to ensure the user finds the best results near them.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/dylanm312/LAHax\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/dylanm312/LAHax\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on the frontend and fixed bugs in the CSS.", "I built the backend and helped fix bugs in the javascript for the frontend."]], ["(unpolished) water psa", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>We wanted to make a stupid but fun game that does apply to real life.</p>\n<h2>What it does</h2>\n<p>Our game raises awareness about the need to conserve water because there are people who need it in both developed and developing countries.</p>\n<h2>How we built it</h2>\n<p>We coded the project using Unity and Monodevelop. The map and images were created using an Adobe Photoshop look-a-like, FireAlpaca.</p>\n<h2>Challenges we ran into</h2>\n<p>We did not know how to code games at all, and we had trouble with our initial idea/plan.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We have a functional basis of a game, including movement and a goal/end destination!</p>\n<h2>What we learned</h2>\n<p>There are lots of great alternatives to Photoshop, the Internet provides more resources than anyone could think there would be imaginable. We also learned that Unity has many free made objects with fields of their own and those objects could be applied using physics to control in-game movement.</p>\n<h2>What's next for (unpolished) water psa</h2>\n<p>We hope to improve the graphics and perhaps add a title screen and/or additional levels with new obstacles, like terrain that controls character speed.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/monodevelop\">monodevelop</a></span></li></ul>\n</div>\n</div>", ["I worked on the game's map/user interface using various art programs and learned that there are many fantastic alternatives to common drawing programs (Adobe PS, Paint Tool SAI) like FireAlpaca.", "", ""]], ["I'll Pack A....", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"I'll Pack A.... – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/816/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>Packing tends to be a scramble at the last minute–clothes scattered around the floor, toiletries strewn across the counter, phone chargers left unnoticed by the outlet. With I'll Pack A, we wanted to provide an easier way for people to create a comprehensive packing list and make sure they are prepared for the journey that awaits them. To present a clean, user-friendly experience, I'll Pack A's packing list is entirely visual. Tapping on a \"Shirts\" icon five times, for example, would add five shirts to your packing list. Repacking at the end of your trip is similarly convenient, and ensures that you are not leaving behind any personal items. </p>\n<p>I'll Pack A was created using Swift during the 24-hour Los Altos Hacks hackathon.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li></ul>\n</div>\n</div>", ["iOS App development", "", "", ""]], ["Cadence", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Cadence – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/784/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>In my high school there are always hyperlinks scattered on the wall containing important information. The annoying part is these links are always extremely incoherent and extremely long. I always type a 30 character link only to find out I have made three typos along the way. I'm solving the problem I face almost on a daily basis.</p>\n<h2>What it does</h2>\n<p>Cadence uses optical character recognition to recognize text and sort only the links inside said text. The browser will then open the link automatically so you don't have to waste type manually typing it up.</p>\n<h2>How I built it</h2>\n<p>I used the Google Tesseract API for OCR and made an algorithm the parses through all the text and only leaves out the text that is useful.</p>\n<h2>Challenges I ran into</h2>\n<p>The hard part was finding a way to sort through the text in order to leave out unnecessary information for all cases. This took me a while to figure out but eventually I came up with a solution</p>\n<h2>What I learned</h2>\n<p>I learned how extremely capable the devices in our pockets are. They are able to accurately recognize images, process them and send out information in a matter of seconds. This would never be convenient 5 years ago which shows how much the rate of technological progress is increasing</p>\n<h2>What's next for Cadence</h2>\n<p>Eventually I hope for Cadence to recognize text in real time with little to no input delay. This would drastically improve the ease of use and would also be a challenge worthwhile to solve. The design also needs a bit of touch up but overall I am happy what I created in a day</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li></ul>\n</div>\n</div>", [""]], ["Trill-Play", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>We wanted to create a platform in which the music dJay can directly interact with its attendees. </p>\n<p><strong>Tens of thousands of events occur every single year and we believe that Trill-Play will revolutionize the music world by bridging this gap.</strong>\n<em>This could be the next big thing as it will change how people interact all over the world.</em></p>\n<h2>What it does</h2>\n<p>Trill allows DJs across the globe host a \"party\" during an event where users can join in and Suggest Songs. The suggested songs are updated live into a party playlist where everyone can upvote and downvote songs. The songs are then automatically played in vote order.</p>\n<h2>How I built it</h2>\n<p>We created our own database to store user data and for instant notifications. We created our web-application using materialize and our iOS application was built using Swift. We are using the Youtube and Spotify API's to stream our music data.</p>\n<h2>Challenges I ran into</h2>\n<ol>\n<li>Integrating socket.io with our static products.</li>\n<li>Putting everything together to create a live product. </li>\n</ol>\n<h2>Accomplishments that I'm proud of</h2>\n<ol>\n<li>Getting both our iOS and Web Clients to be synced live, without much lag and streamed music efficiently. </li>\n<li>Creating a very simplistic UI/UX design that is convenient to use. \n## What I learned</li>\n</ol>\n<h2>What's next for Trill</h2>\n<p>We have a lot of ideas planned for Trill. We want to expand to Android platform and we are currently in the process of creating an algorithm that would mix in and out the next songs. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/angular-js\">angular.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li></ul>\n</div>\n</div>", ["I worked on the total front-end of this project. I was in charge of our UI/UX design and I created our iOS layout. ", "I developed a real time backend in node.js and helped make the iOS app"]], ["nonsense-lang", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<p><img data-canonical-url=\"https://raw.githubusercontent.com/molarmanful/nonsense-lang/gh-pages/nonsense.png\" src=\"https://res.cloudinary.com/devpost/image/fetch/s--jNXFX2eS--/https://raw.githubusercontent.com/molarmanful/nonsense-lang/gh-pages/nonsense.png\"/></p>\n<p>A stack-based language that really doesn't make sense. Made at Los Altos Hacks 2016!</p>\n<h2>Examples</h2>\n<pre class=\"language-nolang\"><code>cH p ce p cl p cl p co p c, p c\\s p cw p co p cr p cl p cd p c! p\n</code></pre>\n<p>A \"Hello, world!\" program.</p>\n<pre class=\"language-nolang\"><code>i p h�\n</code></pre>\n<p>Outputs the input.</p>\n<pre class=\"language-nolang\"><code>g�\n</code></pre>\n<p>Infinite loop.</p>\n<pre class=\"language-nolang\"><code>ce s o r c\n p l h�\n</code></pre>\n<p>Counts down from 100 to 0.</p>\n<h2>Tutorial</h2>\n<p>Nonsense is stack-based, meaning that it uses an array (or stack) as memory storage instead of variables. The stack only holds numbers, and virtually all operators work using the stack. In this case, the stack is of infinite length and all stack items are initialized to 0.</p>\n<p><strong>TIP</strong>: Look at <code>interpreter.js</code> to help speed up the learning process.</p>\n<h3>Syntax</h3>\n<p>All commands are space-separated. The first character in each \"word\" is the command, and the second character is only evaluated as an argument if the command takes one. <code>\\s</code> is used in place of a space character if necessary as an argument. All other characters after are ignored.</p>\n<p>Here's an example of a program:</p>\n<pre class=\"language-nolang\"><code>i p\n</code></pre>\n<p>However, the same code can be written as:</p>\n<pre class=\"language-nolang\"><code>illegal potatoes\n</code></pre>\n<p>because only <code>i</code> and <code>p</code> (neither of which take arguments) are evaluated.</p>\n<h3>Operators</h3>\n<h4>Stack Pointer</h4>\n<ul>\n<li><code>l</code> and <code>r</code>: Move pointer to left/right one item. Example: if the stack is <code>[5,6,7]</code> and the pointer is pointing at <code>5</code>, then <code>l</code> moves pointer to point at <code>0</code> (remember: the stack is padded with 0's!), while <code>r</code> moves the pointer to point at <code>6</code>.</li>\n<li><code>n</code>: Takes 1 character as an argument and moves to the pointer to the stack index as defined by the character's charcode. Example: if the stack is <code>[5,6,7]</code>, <code>n�</code> would move the pointer to point at <code>6</code>, regardless of where the pointer was before.</li>\n</ul>\n<h4>I/O</h4>\n<ul>\n<li><code>i</code>: Shift the first character from the input and push to the stack at the pointer.</li>\n<li><code>o</code>: Output number at the pointer.</li>\n<li><code>p</code>: Output charcode representation of number at pointer. Example: If <code>55</code> is under the pointer, <code>p</code> would output 7.</li>\n</ul>\n<h4>Arithmetic</h4>\n<ul>\n<li><code>a</code> and <code>s</code>: Increment/decrement number under pointer.</li>\n</ul>\n<h4>Control Flow</h4>\n<ul>\n<li><code>g</code>: A <code>goto</code> command. Takes 1 character <code>n</code> as an argument and goes to <code>n</code>th command in the code. This could be used as a way to create an infinite loop.</li>\n<li><code>h</code>: Conditional <code>goto</code> command. Works like <code>g</code>, except it only executes <code>goto</code> if the number at the pointer isn't 0. Otherwise, the code continues as normally.</li>\n</ul>\n<h4>Stack Pushing</h4>\n<ul>\n<li><code>c</code>: Takes 1 character as an argument and pushes its charcode to the stack under the pointer.</li>\n<li><code>x</code>: Sets number under pointer to the index at the stack.</li>\n</ul>\n<h4>Logic</h4>\n<ul>\n<li><code>G</code>, <code>E</code>, and <code>L</code>: Greater than, equal to, and less than operators. Modifies the stack at the pointer with either 1 or 0 depending on the criterion.</li>\n<li><code>A</code>, <code>O</code>, and <code>X</code>: Bitwise AND, OR, and XOR. Modifies the stack at the pointer accordingly.</li>\n<li><code>N</code>: Logical not. Modifies the stack at the pointer accordingly.</li>\n</ul>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://molarmanful.github.io/nonsense-lang\" rel=\"nofollow\" target=\"_blank\" title=\"https://molarmanful.github.io/nonsense-lang\">\n<i class=\"ss-icon ss-link\"></i>\n<span>molarmanful.github.io</span>\n</a></li>\n<li><a href=\"https://github.com/molarmanful/nonsense-lang\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/molarmanful/nonsense-lang\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I did it all from scratch. I have created a monster."]], ["LAHS App", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"LAHS App – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/683/datas/gallery.jpg\"/>\n<p>\n<i>Map of school</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"LAHS App – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/340/684/datas/gallery.jpg\"/>\n<p>\n<i>Courses List</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>We were inspired by our old and hard to use school website and how hard it was to navigate and access data from it.</p>\n<h2>What it does</h2>\n<p>It takes all the information on the website and condenses it to make it easier to find. </p>\n<h2>How we built it</h2>\n<p>We used Swift and Java</p>\n<h2>Challenges we ran into</h2>\n<p>Finding information from our school's website. Also, adding all that data to the app.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Gathering all the data we needed for the application and making the map that is scrollable and able to pan.</p>\n<h2>What we learned</h2>\n<p>How to make images scrollable and able to pan. Navigation side bar.</p>\n<h2>What's next for LAHS App</h2>\n<p>Talk with the school to see if any additional information could be added.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li></ul>\n</div>\n</div>", ["I learned Android Studio to create the Android counter-part app", "Worked on the Swift code in Xcode", "I collected the data used in the app, which required searching through the website currently in use by LAHS.", "I found data and made the arrays. "]], ["The Wackiest Adventure Game You'll Ever Play.", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"The Wackiest Adventure Game You'll Ever Play. – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/341/051/datas/gallery.jpg\"/>\n<p>\n<i>Gameplay.</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>This project was created for Krizia Araracap, Sam Joffe, and Yann Sartori to learn JavaScript. <a href=\"http://darryl-yeo.com\" rel=\"nofollow\">Darryl Yeo</a> served as their mentor, guiding the three young apprentices through the mystical land as they embarked on their first JavaScript experience. He also used this as an opportunity to practice his slick CSS design skills.</p>\n<p>Krizia, Sam, and Yann brainstormed ideas to add to the game and implemented them using their newfound JavaScript knowledge. Whenever they ran into an issue or had a question, Darryl was there to aid.</p>\n<h2>Inspiration</h2>\n<p>Wanted to apply newly learned JavaScript skills in a fun and interactive way.</p>\n<h2>What it does</h2>\n<p><code>prompt()</code>s a question to the player and awards EXP points for correct answers. Questions vary from arithmetic problems to geography trivia.</p>\n<h2>How we built it</h2>\n<p>Three of us (Krizia, Sam, and Yann) took a crash course in JavaScript on Codecademy. We used JSFiddle to collaborate on the project and bounced ideas off each other as we worked. We tried to incorporate as many features of JavaScript as possible in order to demonstrate our newfound skills.</p>\n<h2>Challenges we ran into</h2>\n<p>We had a lot of choices to make in terms of how to incorporate each language feature into our quiz game. We had a very wide range of experience levels and had to help each other get up to speed, but in the end, we worked very well together.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Learning JavaScript in 3 hours and being able to incorporate it into a full-fledged game right away. The flexibility of our team and how well our jumble of ideas were put together so coherently.</p>\n<h2>What we learned</h2>\n<p>JavaScript, and how to incorporate it into an HTML webpage in order to make it interactive.</p>\n<h2>What's next for The Wackiest Adventure Game You'll Ever Play.</h2>\n<p>One idea we would like to have implemented is a battle system, where the player's attack power was directly related to how many points he/she has earned from the challenges. Of course, most of us have just started with JavaScript and wouldn't mind refactoring and rewriting the code as we gain more skills.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jsfiddle\">jsfiddle</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/codecademy\">codecademy</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://fiddle.jshell.net/krizia/wv6zm2ar/18/show/light/\" rel=\"nofollow\" target=\"_blank\" title=\"https://fiddle.jshell.net/krizia/wv6zm2ar/18/show/light/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>fiddle.jshell.net</span>\n</a></li>\n<li><a href=\"https://fiddle.jshell.net/krizia/wv6zm2ar/18\" rel=\"nofollow\" target=\"_blank\" title=\"https://fiddle.jshell.net/krizia/wv6zm2ar/18\">\n<i class=\"ss-icon ss-link\"></i>\n<span>fiddle.jshell.net</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I was one of the the debuggers throughout this project, helping point out and identify flaws that would make our code less than its best. I also helped a bit with the console output (i.e. what people would see when they actually play) to make the game more understandable to those who played it.", "As a seasoned web developer and designer, I worked on the styling of the webpage that hosted our game as well as the user interface. I provided lots of feedback on the code my teammates wrote and offered ways to make it more efficient.", "I brainstormed ideas, and wrote the *messy* code, which would later be debugged by other members. "]]]