[["Book Spy", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>During my first semester at college I observed multiple students that were not able to reach their academic potential because they did not have the means to buy expensive school textbooks. While listening to Mr. McEligot speak about striving to solve problems instead of make money, I realized that my software development skills can be used to help my low-income friends who either cannot afford textbooks or become financially burdened my them. The project also incorporated iOS design which I am interested in learning about.</p>\n<h2>What it does</h2>\n<p>Book Spy monitors online textbook prices for its users. This not only alleviates users of searching for affordable textbooks, but results in cheaper textbooks as Book Spy is capable of scouting deals constantly and independently. Book Spy also utilizes a range of productivity algorithms to make searching faster and more efficient. For example, Book Spy's data source is interchangeably derived from multiple free web APIs to offer a diversity of results and allow the app to be free. Additionally, Book Spy approaches categorizing profits in multiple ways. For example, the user is only emailed about a profitable opportunity if they have not been exposed to it on the app. Likewise, Book Spy determines the in-app profitability of a textbook based on long-term average prices and short-term ones. the majority of Book Spy's functionality is contained in the backend between the PHP and the MySQL. I did this so that I can easily add an Android app and website without re-designing its functionality.</p>\n<h2>How I built it</h2>\n<p>I first built as much of the front end (in Swift) as I could. This does not mean the visually appealing aspects, but the user inputs and the software's outputs. I found this method of programming to be beneficial because I was able to gain a thorough and concise understanding of the data structures and interactions necessary for the app to perform well, remain streamlined, and be completable in just 36 hours of work. It became apparent very quickly that one single API service would not be sufficient for Book Spy as it often submits multiple queries at a time between single user searches and the far more demanding and constantly running script to allocate and analyze data about the users' textbooks as quickly as possible without being IP throttled. </p>\n<h2>Challenges I ran into</h2>\n<p>Book Spy's frequency of API requests exceeded the limits of any API I could find. After a bit of thinking, I wrote a script that cycles API keys in coordination with API time limits. This allowed me to access all of the data that I needed without dividing the requests among a wide range of APIs which compromises the app's simplicity, security, and speed. Another challenge that I encountered was how to define a 'profitable' book. I realized that there is no one 'perfect' way to define a profitable textbook, therefore I needed multiple algorithms to determine profitability depending on the user's involvement and and age of the users' textbooks. Lastly, I ran into the problem of having to utilize with a database not only on another platform and responsive to a different programming language, but having to communicate with it entirely through character-restricting URLs. This forced me to tediously analyze every form of user input because not only was the URL sensitive to a range of characters, but it was a direct connection to my relatively unsecure database due to the hackathon's time constraints.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>I am most proud of my database schema. It is very clean, relationally grouped, and easy to transition between. I am also very proud of the script I wrote that analyzes about 3 textbooks per second and collects about fifteen pieces of data each. I am also very proud of myself that I completed this project in only 34 hours. Although I feel like I will sleep for at least twenty hours when I get home.</p>\n<h2>What I learned</h2>\n<p>I learned how to intelligently approach complex projects involving lots of data. This was the first project I truly feel comfortable about that incorporates multiple scripts running simultaneously most of the time.</p>\n<h2>What's next for Book Spy</h2>\n<p>I will be submitting it to the iOS app store after a few revisions in a more relaxed environment. After that, I plan to make a website and Android app. I anticipate both to be relatively easy as the overwhelming majority of the algorithmic processes crucial to the service's functionality are complete, and easily accessible from a wide variety of platforms. I also plan to incorporate many more unique textbook APIs. I anticipate that this will yield more profitable results for the users and enable Book Spy to support a larger user-base while remaining free of charge.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mysql\">mysql</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/phpmyadmin\">phpmyadmin</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/amazon-web-services\">amazon-web-services</a></span></li><li><span class=\"cp-tag\">api</span></li><li><span class=\"cp-tag\">email</span></li><li><span class=\"cp-tag\">automation</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xcode\">xcode</a></span></li><li><span class=\"cp-tag\">xampp</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xml\">xml</a></span></li><li><span class=\"cp-tag\">database</span></li><li><span class=\"cp-tag\">users</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/nickpitoniak9/bookSpy\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/nickpitoniak9/bookSpy\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I designed and developed everything"]], ["Interactive Pile Of Trash", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Paper Toss on iOS</p>\n<h2>What it does</h2>\n<p>Challenges the user to throw a bag into a dumpster</p>\n<h2>How I built it</h2>\n<p>Using various strategies and the game engine Unity</p>\n<h2>Challenges I ran into</h2>\n<p>Having not completed two semesters of programming courses so far, I was definitely challenged to learn new methods of programming</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>All assets, Prefabrications(other than VRTK and SteamVR) were created by myself. Successful level transitions and rather fluid object interactivity. None of this was made before the hackathon and none of it was even thought of until an hour post arrival. Doing it all by myself with occasional guidance when  puzzled by certain c# syntax.</p>\n<h2>What I learned</h2>\n<p>Never Give up, even an inexperienced programmer like myself can make something decent if He puts the time to it. There is always a solution, and take breaks every few hours. </p>\n<h2>What's next for Interactive Pile Of Trash</h2>\n<p>More Levels, Sound design, and more intuitive physics puzzles to come!</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li><li><span class=\"cp-tag\">htc-vive</span></li><li><span class=\"cp-tag\">vr</span></li></ul>\n</div>\n</div>", [""]], ["York bike lock", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Darrens bike was stolen and he wanted to create a project to prevent bike theft. </p>\n<h2>What it does</h2>\n<p>Helps prevent bike theft, alerts when bike is being stolen.</p>\n<h2>How I built it</h2>\n<p>Using Arduino technology and simple sensors and to achieve better lock.</p>\n<h2>Challenges I ran into</h2>\n<p>Getting the Arduino to connect to a smartphone via Bluetooth.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Password reset system and a (mostly) bug free code.</p>\n<h2>What I learned</h2>\n<p>How to become more efficient in coding style and how to manage priorities to complete a job on time.</p>\n<h2>What's next for York bike lock</h2>\n<p>To make it better by implementing Bluetooth technology down the road.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/arduino\">arduino</a></span></li></ul>\n</div>\n</div>", ["", ""]], ["Avoiding the Danger ", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>To aid in avoidance of mistakes which could potentially be life threatening.</p>\n<h2>What it does</h2>\n<h2>How we built it</h2>\n<h2>Challenges we ran into</h2>\n<h2>Accomplishments that we're proud of</h2>\n<h2>What we learned</h2>\n<h2>What's next for HealthFirst</h2>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/yelp\">yelp</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li></ul>\n</div>\n</div>", ["Designed Android application for avoiding the danger.", "", ""]], ["Safety Net", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Safety Net – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/668/datas/gallery.jpg\"/>\n<p>\n<i>Safety Net</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Safety Net – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/851/datas/gallery.jpg\"/>\n<p>\n<i>Heat Map</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Safety Net – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/669/datas/gallery.jpg\"/>\n<p>\n<i>iOS version</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Safety Net – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/612/datas/gallery.jpg\"/>\n<p>\n<i>Android version</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Safety Net – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/431/586/datas/gallery.jpg\"/>\n<p>\n<i>Overview of our technologies</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>During the Fall 2016 YCPHacks Hackathon, our team conceived the idea for an application that would meet the requirements of a platform benefiting the community and impacting the lives of those within it. The inspiration behind our minimalistic and concise app drew from our previous experiences with functionally diverse applications as well as our experiences with incorporating complexity such as third party APIs. Safety Net is meant to be able to interact with other applications with also being easy to use and to understand as a standalone mobile app.</p>\n<h2>What it does</h2>\n<p>Safety Net is a personal safety awareness application. Designed to work well as a standalone mobile application or in tandem with other larger applications, Safety Net is a valuable tool for developers and everyday users. As a standalone app, Safety Net can determine the general safety of a user's current location at the push of a button. Based on metrics such as geographic location, the number of recent local crimes and the time of day, the app assigns a value between one and five to represent the level of safety the user can expect. These features can also be used to create useful data sets such as heat maps for Google Maps to use in navigation around high-risk areas.</p>\n<h2>How we built it</h2>\n<p>We hosted our data on Amazon's Web Services with our mobile app being built on the iOS and Android platforms. Using AWS, we had a single backend database that was accessible by both mobile applications, incorporating a Redis database that was queried by functions written in Python. Using SpotCrime's API, we had our mobile application call the API, returning the user's geographic location while also returning crime statistics relevant to their current location. With our functions, we processed all the data to generate a safety rating for the user. Our algorithms also hold certain crimes such as shootings and arson, with more weight than crimes such as vandalism. </p>\n<h2>Challenges we ran into</h2>\n<p>A large challenge we came across was through using SpotCrime's API. Originally, our EC2 instance called the API and parsed through it, selecting specific sets of data for our functions. We were very comfortable having our instance performing these calculations and just posting the data to our mobile devices. During late Saturday afternoon, our connection with the API and our EC2 instance suddenly became severed, giving us 403 Forbidden errors every time we tried to call the API. After trying to switch our backend environment and not having success with that, our team decided to go back using AWS but called the API through the mobile devices, communicating back to our Linux instance and acting as a proxy. We were successful in this attempt to keep the environment we built a majority of the project on, while implementing a 'hack' to circumvent momentary confusion.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>In experiencing the hardships of almost having to restart our project due to unforeseen events, we are proud of our persistence in not giving up and playing around forces out of our control. Additionally, our project also functions as its own API, in which data sets that we parsed through machine learning to build informational value that can be accessed through methods built on the server. This allows other applications to query GETS towards Safety Net and derive their own analytics. </p>\n<h2>What we learned</h2>\n<p>A takeaway from this project is the intense processes of building a cross platform mobile application. It becomes vital that both applications can interact with our database functions, while being programmed in two different languages. Furthermore, we learned that being able to adjust after setbacks allows us to look at the project through a different perspective, which can be very beneficial. </p>\n<h2>What's next for Safety Net</h2>\n<p>Future plans for Safety Net include the ability to track different locations, heat maps, and a website displaying conglomerated data. We also plan to further refine both our iOS and Android applications, ensuring a consistent user experience while adding more features.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/amazon-web-services\">amazon-web-services</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/redis\">redis</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/git\">git</a></span></li></ul>\n</div>\n</div>", ["I built the Android application and researched the API that we used to find our crime data. ", "I worked on the backend, working with Python and Flask for the API. Also worked on the iOS application & helped with the website.", "I built the backend API endpoint and parsed the return object to calculate the scoring metric. ", "Worked with backend, setting up the AWS environment, and Redis database. Assisted in implementing the API interaction between database and mobile devices."]], ["York Hacks", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>800 miles later, and still, no ideas for a hack. That was us on Friday night, and honestly, we weren't too worried. With the incredibly talented and creative people surrounding us, it was hard to see a world in which we couldn't come up with something. After asking around, we realized that York is facing a challenge. With the advent of Silicon Valley, almost all big name tech companies have migrated to the West Coast, leaving even the strongest of Eastern cities high and dry in recent years. York has seen this more than most, and this problem is starting to manifest itself in other ways. Heroin addiction, crime, violence and tensions have skyrocketed in the community. Hearing about these tragic trends motivated us to do something for the city. We want, no, need to bring tech back to the east coast, and York has everything that is required to make that happen. Since two floors of the Yorktowne Hotel will be renovated and repurposed (as we understand it), we thought it fitting to locate our endeavor here, where YCP Hacks was hosted. However, this business venture could be carried out in any of the unused industrial complexes still in York.</p>\n<h2>What it does</h2>\n<p>Helps connect people to the hacking community and lays out a plan to develop a hacker space in York PA, with the intended result of economic growth stimulation.</p>\n<h2>How we built it</h2>\n<p>Started by developing a website skeleton on bootstrap, then modified it beyond what bootstrap's IDE was capable of to fit the needs of our website.</p>\n<h2>Challenges we ran into</h2>\n<p>Bootstrap's clunky GUI that wasn't exactly intuitive. Trying to interpret the 'object oriented' html (I know, right?)</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Learning a bunch of html, designing a project that has a tangible, positive impact on the community of York.</p>\n<h2>What we learned</h2>\n<p>A LOT of html, and networking/systems. Also, how to manipulate object oriented html scripts.</p>\n<h2>What's next for York Hacks</h2>\n<p>Hopefully design approval from the hotel owner to turn one of the 'repurposed' floors into a hacker lab that brings the community together over profitable collaboration and design.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://104.131.70.220/\" rel=\"nofollow\" target=\"_blank\" title=\"http://104.131.70.220/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>104.131.70.220</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["Provino, Auditions Made Simple", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>The local non-profit theater, Dreamwrights</p>\n<h2>What it does</h2>\n<p>It allows auditionees to apply to audition and then allows the theater to view and print those applications in real time</p>\n<h2>How I built it</h2>\n<p>Using premade plugins on WordPress</p>\n<h2>Challenges I ran into</h2>\n<p>I don't have very much experience with web design, so I wasn't able to custom build much.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>The layout and the fact that is works</p>\n<h2>What I learned</h2>\n<p>How to use WordPress, and a little HTML</p>\n<h2>What's next for Provino, Auditions Made Simple</h2>\n<p>Connect it to a better hosting site, make it mobile friendly,and add the ability to add notes about an audition to an application.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/wordpress\">wordpress</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://provinoauditionercom.000webhostapp.com/\" rel=\"nofollow\" target=\"_blank\" title=\"https://provinoauditionercom.000webhostapp.com/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>provinoauditionercom.000webhostapp.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["USB Rubber Ducky fun exploit", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>This tool and exploit is not know about and truly deserves recognition in the world of Cyber Security</p>\n<h2>What it does</h2>\n<p>Runs Chrome, goes to a certain youtube video, turns the sound all the way up, full screens, then runs note pad and types the lyrics on screen in sync</p>\n<h2>How I built it</h2>\n<p>I used the online DuckyScript encoder, and imagination</p>\n<h2>Challenges I ran into</h2>\n<p>syncing the lyrics and having to fix all the polishing. While this project is simple, it requires a lot of polishing to use on all windows 10 systems</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>coding the entire thing and coming up with the idea</p>\n<h2>What I learned</h2>\n<p>a lot of keyboard shortcuts</p>\n<h2>What's next for USB Rubber Ducky fun exploit</h2>\n<p>Actual exploits that can harm computers. This one is just for fun to show people what is possible with this attack</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag\">duckyscript</span></li></ul>\n</div>\n</div>", [""]], ["TurbineEDU", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>It's really expensive to buy an airturbine and it's costly for schools to buy one so we made a low cost version of it.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag\">arudino</span></li><li><span class=\"cp-tag\">boxes</span></li><li><span class=\"cp-tag\">potentiometer</span></li><li><span class=\"cp-tag\">servos</span></li><li><span class=\"cp-tag\">propeller</span></li><li><span class=\"cp-tag\">esc</span></li></ul>\n</div>\n</div>", ["", ""]], ["Reddit News Ticker", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Wanted a reddit companion to my rainmeter</p>\n<h2>What it does</h2>\n<p>shows the titles of the top 4 reddit posts after you login</p>\n<h2>How I built it</h2>\n<p>wrote it using python, Tkinter and the reddit API wrapper PRAW</p>\n<h2>Challenges I ran into</h2>\n<p>Threading, OAuth</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>The window is transparent, something thought impossible on stackoverflow</p>\n<h2>What I learned</h2>\n<h2>What's next for Reddit News Ticker</h2>\n<p>Not a whole lot</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag\">praw</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/reddit\">reddit</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/json\">json</a></span></li><li><span class=\"cp-tag\">tkinter</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/YoungMaker/NewsTicker/\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/YoungMaker/NewsTicker/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["EventFactory", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"EventFactory – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/431/363/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>The inspiration for this project came out about from the sheer necessity of a convenient planning tool which would be effective for keeping people up to date at events such as YCP Hacks.</p>\n<h2>What it does</h2>\n<p>Event Factory is a web app that generates APK files based on certain criteria set by the user in the web environment. This APK file will allow you to install an Android app that allows you to see the events planned by the Organizer and receive notifications based off of the Start and End dates/times previously configured.</p>\n<h2>How we built it</h2>\n<p>We used a Jetty WebServer to host our web application, using JSPs and servlets. We also used Android Studio to develop the android front end.</p>\n<h2>Challenges we ran into</h2>\n<p>JavaScript syntax proved to be quite finicky and caused snags throughout development, however we quickly analyzed the problems presented and resolved the numerous issues JavaScript caused. Also, during development using Android Studio we had problems trying to locate files on the Android File system.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We were able to achieve an aesthetically and programmatically pleasing product which serves a positive purpose for the community, and in a very short amount of time despite having a short amount of time to develop an idea for the project and communicate ideas before development.</p>\n<h2>What I learned</h2>\n<p>More in-depth understanding of how JavaScript, JSPs, and Java Servlets function.</p>\n<h2>What's next for EventFactory</h2>\n<p>More in depth app functionality, reconfigurable events and occasions, administrator privileges,  tablet support, more varied areas of event attributes from the main organizer.'</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/mrjones2014/EventFactory\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/mrjones2014/EventFactory\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["My tasks involved  creating the JSPs and servlets used to transfer the data from the user on our website to the backend for processing. In addition to styling the front-end and coding all the JavaScript.", "I worked on the back end, making sure the model was effective. I had contributions all around the project because I helped assist the team members in any of the classes they were working in ", "I worked on the Android project template code and the regular expressions to modify it, as well as the server back-end, and programmatically running the Gradle build scripts to generate the APK server-side. ", ""]], ["Feeder", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>My inspiration for this project hit one day before grocery shopping when I saw my mom pull out a box of index cards with recipies on them, muttering \"what havent we had in a while...\" to herself while flipping through them. I decided I was going to create an easier way for her with my own two hands.</p>\n<h2>What it does</h2>\n<p>The program stores your recipies and restaurants you like, and psudorandomply draws from this data to plan your week's meals. It will not give duplicate choices within a week or on back-to-back weeks. It plans out 8 meals for 7 days tooffer flexability within the week on what you want to eat.</p>\n<h2>How I built it</h2>\n<p>I built this in JAVA in the Eclipse Keplar IDE, along with my fingers, my laptop, sleep depravation, and a toxic level of caffine in my blood for almost 35 hours by the time you're reading this. </p>\n<h2>Challenges I ran into</h2>\n<p>Methods that gave me a hard time were the io formatting, the restrictions on the randomization, and the compiling of the ingrediants into a single printed list.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>It may not be pretty yet, but it's fully functional. And I didn't kill myself in the process so that's a thing too.</p>\n<h2>What I learned</h2>\n<p>I learned that by far the biggest pain in the kiester is trying to figure out within 15min of waking up, what the heck you were thinking when you wrote something 3hrs ago that makes no sense whatsoever.</p>\n<h2>What's next for Feeder</h2>\n<p>GUI's! The next step is to add a GUI and have the program live as an .exe file, not depending on any IDE  to run on your computer. After that? Phones! It's going to be a full blown app when I'm done with it.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/eclipse\">eclipse</a></span></li></ul>\n</div>\n</div>", [""]], ["Good Citizen", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration- sometimes you feel like you should get involved with the community, but you don't no how. That's why this app was created to help you, help others.</h2>\n<h2>What it does- Goal was to find events that are posted for community services opportunities, but that point was not reached in time.</h2>\n<h2>How I built it- Struggled with the tedious process of building with the Android Studio and finding good enough resources for it.</h2>\n<h2>Challenges I ran into- Outdated resources using old versions of Android Studio were confusing, this made it harder to learn than i expected. I also needed to add other components that I did not anticipate.</h2>\n<h2>Accomplishments that I'm proud of- Got a user interface mostly done.</h2>\n<h2>What I learned- I should practice more before using a new development platform.</h2>\n<h2>What's next for Good Citizen- Develop location service for the app along with a database.</h2>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://drive.google.com/file/d/0B8cU-5CZG26kUjd2cUtXQnIweW8/view?usp=sharing\" rel=\"nofollow\" target=\"_blank\" title=\"https://drive.google.com/file/d/0B8cU-5CZG26kUjd2cUtXQnIweW8/view?usp=sharing\">\n<i class=\"ss-icon ss-link\"></i>\n<span>drive.google.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["Sidescroller", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>I did not have any project ideas planned beforehand. I brought my laptop that had unity on it. I decided that I would do something with Unity on it if I didn't find something that I could actively do with a group. I wanted to do something that is challenging but actually doable within the time given. After a hour or so on Friday I made a spur of the moment decision, to make a 2d game in Unity so that I do not waste my time doing nothing. </p>\n<h2>What it does</h2>\n<p>It is game where the objective is to get to the green platform on the map. There are three levels that increase in difficulty as you progress. There are three types of enemies. Type 0 moves vertically. Type 1 moves horizontally. They change direction when they either get too far from their origin point or they bump into another object. Type 2 are stationary, but they rotate.</p>\n<h2>How I built it</h2>\n<p>I built it in the Unity engine. I used default objects. I used C# as the programming language. I spent most of Friday night, Saturday and a good portion of really early morning Sunday.</p>\n<h2>Challenges I ran into</h2>\n<p>I did not have much experience with Unity or c#. The only real experience I previously have had is only writing a simple one level Frogger clone. I had a problem with my type 1 enemies a few times. You see I had made an empty object to hold the type one enemies. I accidentally extended the enemy component to it, which affected all the type 1 enemies to follow the directions for both type 1 and type 0. I made the enemy class have a field for type that chose the actions that each type preform. Since the field defaults at 0, the object extended the zero field to the objects that followed the 1 field. That caused the type ones to follow both type 0 and type 1's movement.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>I made a game with multiple levels and had features that are above what my previous experience with unity would probably suggest for the next project (granted there was a lot more hours put into Sidescroller).</p>\n<h2>What I learned</h2>\n<p>I learned various commands in the C# language and more of a different way to code than I usually do. The language I have the most expierence and therefore has affected my programming the most is Java.</p>\n<h2>What's next for Sidescroller</h2>\n<p>Maybe more levels and a start menu (at some point).</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--2\">c#</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/mhtf19/Sidescroller\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/mhtf19/Sidescroller\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["Rambars.com", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>I got the idea from two of my peers.</p>\n<h2>What it does</h2>\n<p>It's a proof of concept for a real site that will promote deals at local bars, driving local economy.</p>\n<h2>How I built it</h2>\n<p>With C# and a lack of sleep.</p>\n<h2>Challenges I ran into</h2>\n<p>None.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>I actually finished it.</p>\n<h2>What I learned</h2>\n<p>A lot about Angular.JS</p>\n<h2>What's next for Rambars.com</h2>\n<p>On to the real world!</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/asp-net\">asp.net</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--2\">c#</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/angular-js\">angular.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css3\">css3</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/sql\">sql</a></span></li></ul>\n</div>\n</div>", [""]], ["YCP Mobile", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"YCP Mobile – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/315/datas/gallery.jpg\"/>\n<p>\n<i>Main Menu</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"YCP Mobile – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/317/datas/gallery.jpg\"/>\n<p>\n<i>Campus Map</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"YCP Mobile – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/430/318/datas/gallery.jpg\"/>\n<p>\n<i>News and Events</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>I was rather perturbed by the official York College Mobile app and how slow, clunky, and useless it ended up being, so I wished to devise a replacement</p>\n<h2>What it does</h2>\n<p>This app provides the user with everything that a student of York would need to get around: a map, an e-mail directory (to be organized by department later), online news and events, and the YCP Spartans portal containing news and announcements for the YCP Spartans intramural teams.</p>\n<h2>How I built it</h2>\n<p>This app was build from scratch using android studio, with resources from the android developers portal and the Google API.</p>\n<h2>Challenges I ran into</h2>\n<p>Registering the app to be capable of using Google Maps as a way to show off campus effectively, as well as determining the exact global coordinates and zoom that the app would be optimized for</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>I'm proud of creating an app that has basic functionality within 36 hours of beginning the project, and incorporating WebView, MapView, and Table objects in its design</p>\n<h2>What I learned</h2>\n<p>The basics of Android App programming, time management, and the importance of testing before deployment</p>\n<h2>What's next for YCP Mobile</h2>\n<p>Full access to the York Shuttle system, Moodle integration for grades, an effective bug-report system, and an efficient landmark overlay for the Campus Map.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xml\">xml</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/gradle\">gradle</a></span></li></ul>\n</div>\n</div>", [""]], ["Health Stat Tracker", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Our inspiration was that people need something that they can use to track every aspect of their health so that they can get the best out of life. </p>\n<h2>What it does</h2>\n<p>The Health Stat Tracker (HST), records and updates your personal health information to inform you when\nyou need to take/refill medications, go to the gym, or even inform you of an illness you could have caught.</p>\n<h2>How I built it</h2>\n<p>My teammate, Hunter Willingham, and I brainstormed on what it holds. Then used a Java switch to make the GUI so\nthat it could display the information needed. After that we just implemented a few text methods so that the user could\ninput their personal data into the GUI.</p>\n<h2>Challenges I ran into</h2>\n<p>The main challenge we ran into was trying to figure out how to let the user input their own data into the GUI, and having it display the information in the correct order and place.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>I am proud that my teammate and I finished our program with a lot of time left to go back and refine it. It took us about 24 hours to build, and we did it.</p>\n<h2>What I learned</h2>\n<p>I learned that no matter how impossible a task may seem, there is always a way to beat it. And no matter how frustrated you can get, never give up.</p>\n<h2>What's next for Health Stat Tracker</h2>\n<p>Hunter Willingham and I are going to implement a GPS system into the system, build a database to store and load all the data, and also build a chart/graph so that the user can see their progress grow each day.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li></ul>\n</div>\n</div>", ["", ""]], ["Trump: An Interactive Experience", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Making hackathons great again.</p>\n<h2>What it does</h2>\n<p>It moves,</p>\n<h2>How we built it</h2>\n<p>We used unity and paint.net to make it look super good.</p>\n<h2>Challenges we ran into</h2>\n<p>Unity.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Super good art.</p>\n<h2>What we learned</h2>\n<p>Unity.</p>\n<h2>What's next for Trump-Simulator</h2>\n<p>A lot.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--2\">c#</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li><li><span class=\"cp-tag\">paint.net</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/gimp\">gimp</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/dmg9626/Trump-Simulator\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/dmg9626/Trump-Simulator\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on the background.", "I worked in Unity, converting all the game art into functioning game objects.", "I worked on the pixel art. "]], ["The White Rose", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>The story is</h2>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/twilio\">twilio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css3\">css3</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mongodb\">mongodb</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/sendgrid\">sendgrid</a></span></li></ul>\n</div>\n</div>", ["", ""]]]