[["Wind Power", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/57S4g_P_7A4?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"Wind Power – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/435/946/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Wind Power – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/435/947/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Wind Power – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/435/948/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>The idea was to make a low cost wind tunnel that can be used in a wide variety of applications. This is especially beneficial to educational institutions who do not necessarily need a research level wind tunnel.</p>\n<h2>What it does</h2>\n<p>This will measure wind speed, temperature, and humidity of the air in addition to allowing you to view the air around the object in question. </p>\n<h2>How we built it</h2>\n<p>We gathered our strong minds and found resources from various everyday objects around Georgetown. We constructed the actual tunnel from goldfish boxes. We used a motor and propeller to simulate wind. Cups with a magnet are used to detect wind speed.  </p>\n<h2>Challenges we ran into</h2>\n<p>A major challenge for us was getting the cups to spin on an axis.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Completing a functional wind tunnel was nice. The supplies for the tunnel cost under $50.</p>\n<h2>What we learned</h2>\n<p>How to be resourceful.</p>\n<h2>What's next for Wind Power</h2>\n<p>Publish the project online so that science teachers around the world will be able to use our idea in their classrooms.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/arduino\">arduino</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/raspberry-pi\">raspberry-pi</a></span></li><li><span class=\"cp-tag\">goldfish</span></li><li><span class=\"cp-tag\">heart</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/love\">love</a></span></li><li><span class=\"cp-tag\">soul</span></li><li><span class=\"cp-tag\">wire</span></li></ul>\n</div>\n</div>", ["I came up with the idea + I helped lead the team to successful implementation through agile techniques as well as a well equipped hardware inventory that I brought along with me. I led the design and had final-say over most of the pieces, but my largest impact was the functionality of the motor, the parsing of the data into JSON format, and idea generation. Overall, we as a team did great work.", "Planning, Building, Programming the sensors via Arduino, Programming the webcam via OpenCV", "Learned a lot on serial ports for arduino and getting data from arduino to rpi. Helped mostly on the hardware side with designs and some python code review. Great team effort overal", ""]], ["Leap of Faith", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>We wanted to learn something this weekend, and neither of us had made a game before</p>\n<h2>What it does</h2>\n<p>The game is a 10 level challenging platformer that becomes increasingly difficult. The user is forced to make leaps of faith if they want to progress through the levels. </p>\n<h2>How we built it</h2>\n<p>Using the Unity3D Game Engine, we coded the game from scratch and used online images as assets. </p>\n<h2>Challenges we ran into</h2>\n<p>Due to our little knowledge in Unity, C# and game development, it was extremely hard to put all this new knowledge together to create a full-fledged successful game. </p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We are proud to complete our first full game in just about 2 days time. With our lack of experience in the technologies used, we were able to overcame all obstacles. </p>\n<h2>What we learned</h2>\n<p>We learned how to use Unity3D, program using C#, use pre-made online media to create in-game assets, game design and put everything together to create a presentable game. </p>\n<h2>What's next for Leap of Faith</h2>\n<p>We are looking into porting the game on IOS and Android so the world has access to our product. This will take some time, but we know this is a very enjoyable game that has great potential. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li></ul>\n</div>\n</div>", ["", ""]], ["SocioScore", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"SocioScore – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/803/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"SocioScore – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/855/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"SocioScore – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/856/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<div class=\"alert-box alert\">\n        This image is currently processing. Please be patient...\n      </div>\n<img alt=\"SocioScore – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"https://devpost-challengepost.netdna-ssl.com/assets/defaults/software-d4334efb72013df43784baffede9d379.gif\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>The anonymity that online social media provides is often misused by many to harass other users. The porblem is so commonplace and rampant that in a survey 6 out 10 people claimed to have faced some form of harassment online with women and memebers of certain ethnic and racial being the most vulnerable targets. Any mechanism that can help to document and identify offenders would be a deterrent against this.</p>\n<h2>What it does</h2>\n<p>The application is a combination of a chrome plugin , mobile app and a custome made backend service and api that is open and can be integrated with any application. THe chrome pulgin tracks abusive tweets on twitter and asssigns user handles a score that we call the \"SocioScore\" this is measure of how poilte they are on twitter. The plugin scraps the twitter page, and sends the tweets on the page to the backend service and figure out if the tweet is absuive in nature and flags abusive users and block ausbive tweets. It also dynamically adds a score to the twitter handle.</p>\n<p>The mobile app which uses the same backend service alerts people if the caller is know to be a habitiual harasser in a way like trucaller but instead of spam shows the \"SocioScore\". </p>\n<h2>How I built it</h2>\n<p>We decided to provide this as a REST-API service so that it can be used as a platform to develop various other applications. The whole application has been splitted into a nodejs REST API project, chrome plugin and android application. The chrome plugin and android application that consume the REST APIs. REST API is built using nodejs with POSTGRES AWS as database. </p>\n<h2>Challenges I ran into</h2>\n<ol>\n<li>Scalablity issues.</li>\n<li>Since the stack is very deep we had latency issues which we solved using caching techniques.</li>\n<li>Few of us are very new to the stack used.\n## Accomplishments that I'm proud of\nBuilding a chrome pulgin and an android app that use the banckend services we built from scratch over the day and a half. Making the backend services open and free so that it can integrated with any other application.</li>\n</ol>\n<h2>What I learned</h2>\n<p>Desigining a chrome pulgin, android app and using AWS </p>\n<h2>What's next for socioscore</h2>\n<p>Since SocioScore has been built as a REST API service, it can be extended to other platforms like facebook and other social networks. This can be used similar to the credit score of finance world.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/twitter\">twitter</a></span></li><li><span class=\"cp-tag\">bark</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css3\">css3</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/chrome\">chrome</a></span></li><li><span class=\"cp-tag\">chrome-plugin</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/postgresql\">postgresql</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/amazon-web-services\">amazon-web-services</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li></ul>\n</div>\n</div>", ["", "", ""]], ["RaptorPi", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>We were tired of the having to sit through roll call during every class and thought that we could improve the process of checking attendance.</p>\n<h2>What it does</h2>\n<p>Scans a student's QR Code and adds the info to a spreadsheet.</p>\n<h2>How we built it</h2>\n<p>Connected a USB webcam to a Raspberry Pi and then intergrated Google's Spreadsheet Api </p>\n<h2>Challenges we ran into</h2>\n<p>Writing the python code that would ultimately capture the QR Code information and write it to our spreadsheet.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Before we started this project we didn't have much knowledge about Python and now we have a better understanding of the language.</p>\n<h2>What we learned</h2>\n<p>We learned how to program a QR Code reader, write programs in Python and how to bring different platforms together.</p>\n<h2>What's next for RaptorPi</h2>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag\">google-sheets-api</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/raspberry-pi\">raspberry-pi</a></span></li><li><span class=\"cp-tag\">usb-webcam</span></li></ul>\n</div>\n</div>", ["-Configuration of Raspberry pi\n-Installing Zbar QR scanner\n-Implementing Google API for Google Spreadsheet \n-Python", ""]], ["Automated TCP Reset attacker", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Network security has always been something of a glittery black box for us. We figured it'd be fun to crack open the box and see what's inside. The TCP Reset attack is one of the oldest and most widely understood attacks around, so implementing it from scratch seemed like a good start.</p>\n<h2>What it does</h2>\n<p>This project is a packet parsing library and a script that uses it to conduct TCP reset attacks.</p>\n<h2>How we built it</h2>\n<p>The parser and attacker are built in pure python 3 using the standard socket module.</p>\n<h2>Challenges we ran into</h2>\n<p>As it turns out, using regular sockets to receive Ethernet frames is only possible on Linux. In order to work on other platforms, the module would have to be re-engineered using libpcap or a similar bare-wire library.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>As of the end of our initial work, the script is capable of completely shutting down any usable form of TCP connection that lasts longer than a few milliseconds.</p>\n<h2>What we learned</h2>\n<p>Speed matters - on our test network of virtual machines, the zero-latency network allowed them to communicate fast enough that our RST packets were out of the window by the time they were sent.</p>\n<p>TCP stacks are finicky. If you don't set exactly the right combination of flags and sequence numbers, your packet will fall on deaf ears.</p>\n<p>Byte-ordering is a non-trivial issue. Making sure that integers are interpreted the correct way without regard to the system's native byte order is very important and easy to mess up.</p>\n<h2>What's next for Automated TCP Reset attacker</h2>\n<p>We're considering porting the attack script to use libpcap so it can work on several platforms, and we have the bare beginnings of a GUI that presents the user with a list of connections they can click on to attack.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/sheybey/hoyahacks-tcp-reset\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/sheybey/hoyahacks-tcp-reset\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I performed moral support and a soundboard for ideas.", "", ""]], ["Anita Makeover!", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Anita Makeover! – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/198/datas/gallery.jpg\"/>\n<p>\n<i>Anita Jones reppin' Hoya Hacks!</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Anita Makeover! – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/888/datas/gallery.jpg\"/>\n<p>\n<i>Anita Jones as an astronaut!0</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Anita Makeover! – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/892/datas/gallery.jpg\"/>\n<p>\n<i>Anita Jones as an astronaut!1</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Anita Makeover! – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/896/datas/gallery.jpg\"/>\n<p>\n<i>Anita Jones as a businesswoman!</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>This idea was inspired by Mackenzie’s now-six-year-old next door neighbor, Brianna, whom she babysits quite often. Brianna would constantly ask her, “You have games?” “Can I see your phone?” “What games do you have?” “Can I show you something? Here, give me your phone.” Each time Mackenzie saw her, Brianna would want to download the same kind of game: A makeover app. \nAccording to the Bureau of Labor Statistics, 25% of professional computing occupations in the 2015 U.S. workforce held by women, yet 57% of the overall 2015 U.S. workforce is women. Our team, We4We, believes that starting interest in STEM at a young age might make those startling statistics better. </p>\n<h2>What it does</h2>\n<p>Before you play the game, you’re given an eBook. This book follows Anita Jones (homage to Anita Borg), “the smartest girl in the world!” and her desire to find her “dream job.” Her mom tells her to “try everything to see what she loves,” so she tries being an astronaut, a businesswoman, a chef, and more. At the end of the book, it says that Anita Jones can do anything, “and so can you!” This is to give young girls with aspirations some validation that they can and will achieve anything they put their heart and mind to. \nAfter the girl closes the book, she’s ready to conquer the world. We teach her basic coding principles by letting her tinker with function values, while and for loops, and much more. \nThe big picture is that coding can be fun, girly and beautiful too– the code she writes can be whatever she wants it to be. It’s time to drop the gender-based stereotypes and pick up making the world a better place.</p>\n<h2>Challenges we ran into</h2>\n<p>We originally started making our game using Unity, but as of Saturday night at 10:30pm we decided to start over and make it with JavaScript and HTML5. Overall it was the better call and we're all glad we made that switch. \nAnother challenge we ran into was creating the drawings. Elly is an incredibly talented artist and we wanted to showcase her abilities with Anita Makeover!, but we didn't have access to a drawing tablet. After most of Friday and some of Saturday morning, we decided it was best for Elly to draw everything freehand on paper, take a picture of it, then upload that picture to Photoshop for edits. It was a somewhat low-tech way of going about things but it was the most efficient and we think it turned out well. Photoshop was kind of confusing at first, since none of us have used it in quite some time, but we got it working with some help from Rob Pongsajapan. </p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Aforementioned, we are all very proud of Elly's illustrations. We are also proud of the fact that we brainstorm well together. It doesn't seem like something to be all <strong>that</strong> proud of, but getting four strangers to come together and think as one was very impressive to us. We all listened to each other's ideas and opinions and the game really reflects that. We're also proud of our team's motivation, despite the hardships we faced. We built each other up, and no one was more motivating than Adam; he kept us focused and excited about our hack until the very end. We are also proud of Mackenzie's ability to communicate her idea to the team and take criticisms and suggestions. </p>\n<h2>What we learned</h2>\n<p>Most of us came to Hoya Hacks not knowing how to code in JavaScript, but Tim taught Mackenzie, Elly and Adam the basics. Quickly changing from C# with Unity to JavaScript was tough but we caught on quickly due to great teaching. </p>\n<h2>What's next for Anita Makeover!</h2>\n<p>Ultimately, we want to be able to make Anita Makeover! cross-platformed, which is why we initially chose Unity. We also want to add more models with different races, heights, and body types, each with a different story to tell. We hope to also make more stories and games for Anita Jones and continue to inspire young girls into pursuing STEM.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/processing\">processing</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/photoshop\">photoshop</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/love\">love</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://ec2-52-91-228-45.compute-1.amazonaws.com/\" rel=\"nofollow\" target=\"_blank\" title=\"http://ec2-52-91-228-45.compute-1.amazonaws.com/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>ec2-52-91-228-45.compute-1.amazonaws.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", "", ""]], ["HOYAHiker", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"HOYAHiker – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/850/datas/gallery.jpg\"/>\n<p>\n<i>Login Page Background</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"HOYAHiker – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/851/datas/gallery.jpg\"/>\n<p>\n<i>Map with levels - city, forest and mountain</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"HOYAHiker – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/852/datas/gallery.jpg\"/>\n<p>\n<i>App Icon</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Pokemon Go for adult fitness!\nWe have technologies to help track and sift through our health related data, but how do we motivate people to actually use these technologies on a consistent basis to improve their health?\nBy providing a story-esque goal along with gamification of exercise, we can build a unique and compelling experience that will hold users interests long enough to build up the habit of regular exercise. </p>\n<h2>What it does</h2>\n<p>The app tracks your fitness activity with the Fitbit API. The app has levels to complete based on physical activity. The first level is the easiest, in the city landscape and progressively gets harder with the next levels, in the jungle and in the mountains. You can pass a level if your Fitbit tracks a certain number of steps, a certain heartrate, etc. Each level has a 30 day fitness challenge to complete. We also plan to include a feature which will suggest fitness classes in your area to attend as part of a level or a challenge.</p>\n<h2>How we built it</h2>\n<p>Used the Fitbit API, Android Studio and Java</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>This is our first hackathon and first time building an Android app!</p>\n<h2>What we learned</h2>\n<p>We learned about the OAuth process and worked with the OkHttp library. We also became familiar with using git version control on Android Studio.</p>\n<h2>What's next for HOYAHiker</h2>\n<p>We will continue to work on it and hope to develop a stable APK. We would like to extend the capabilities to build a community of users. We believe this is a compelling solution that makes exercise more competitive and appealing. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag\">fitbit-api</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xml\">xml</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/mimran2/HoyaHiker1.0\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/mimran2/HoyaHiker1.0\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", "", ""]], ["HomeAway", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"HomeAway – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/862/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>The homeless are obviously an underserved population, but they are more connected than most people think. With mobile phone penetration at &gt;50% overall and weekly internet usage at &gt;80% in youth populations, we thought it was a great opportunity to make a difference in the world with our traditionally \"first world facing\" skillset. There is also a paucity of data on how the homeless interact with information technology and the effects it has on their lives. We set out to find a web based solution to both problems. </p>\n<h2>What it does</h2>\n<p>HomeAway is a map-based web app to help homeless people find events and services near them. Features include filters for gender restrictions and services offered (e.g. showers, food, beds, support for domestic abuse victims.) Our stack was built to maximize data collection and minimizing payload size for those who have limited data plan resources</p>\n<h2>How we built it</h2>\n<p>Fueled by RAMEN(React, Alt, Mongo, Express, Node) and Google Maps</p>\n<h2>Challenges we ran into</h2>\n<p>The Twilio service we wanted to integrate into our app (SMS query of our database for those who don't have readily available internet access) was not free. As a result, we couldn't fully implement it, but we intend to do so in in the future.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Great backend, solid UI/UX once we finish frontend. But above all, we think that our project can have a real impact for both the homeless and those who analyze data on their behalf</p>\n<h2>What we learned</h2>\n<p>We should have allocated more time for front end development. Our backend is ready to go, but the react interface is not complete (yet.) We also learned a lot about homelessness and its effect on society.</p>\n<h2>What's next for HomeAway</h2>\n<p>The future is probably what we're most excited about: we really think we can do something with this project. Any prize money or gift cards will go to customer development in the form of launch event(s) where guests will enjoy a nutritious meal and offer us advice as to their needs and those of their peers. This information will be used to guide future development with the needs of our customers in mind. We envision a product that helps the homeless find resources while simultaneously providing data for the government and researchers.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/react\">react</a></span></li><li><span class=\"cp-tag\">alt</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mongodb\">mongodb</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/express-js\">express.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li></ul>\n</div>\n</div>", ["Schema development, front end wireframing and business model development", "RAMEN chef."]], ["ScoreSight", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"ScoreSight – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/549/datas/gallery.jpg\"/>\n<p>\n<i>This is the visual representation of music that we created. It can be viewed live at noteroll.com.</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>A combination of a past in music and a present interest in artificial intelligence and machine learning brought us to want to explore genetic algorithms to generate music.  What's cooler than mixing together our two biggest passions?</p>\n<h2>What it does</h2>\n<p>Midi files are abstracted and flattened into a form in which a powerful, light-weight machine learning algorithm known as \"augmented n-gram modeling\" can analyze and compare multiple songs.  The ability to compare songs allows us to use this model as a test of fitness for a genetic algorithm, which evolves slowly towards being a \"legitimate\" song of similar style to the training data (from where we got the model).</p>\n<p>Just as important as creating the song, the presentation of data can allow new music students to learn more effectively.  There is no more accessible platform than a simple web browser on the internet, and so we have chosen a warm, friendly design to display online that can read and play midi files, including ones generated by the A.I.</p>\n<h2>How we built it</h2>\n<p>This project was multi-faceted and has four main components:\nHardware: 20 odroids are networked together to allow for parallel processing to expedite the machine learning process.  This took time to make disk images for each mini-computer, as well as a lot of configuring just to physically connect all the wires.  On top of this, special scripts were written to distribute computational processes efficiently amongst all the odroids.</p>\n<p>Data cleansing: Open source, publicly available midi files were chosen due to their discrete nature.  Symbolic music is much easier to manipulate than wave forms, but there is still a lot of data to parse.  So, after much brainstorming, we came up with an algorithm to flatten and parse the midi files until they were in a very manageable state.</p>\n<p>Machine learning: A two-step process, the machine learning aspect first developed a test of fitness using an augmented n-gram, and then used this test of fitness for a genetic algorithm to compare against.  Tricky calculations allow for the genetic algorithm to mutate, evolve, and eventually converge to a song.</p>\n<p>Visualization and application: Once a song has been generated, it needs to be shared or learned.  A web interface was developed that can read midi files, show their musical representation, and actually play the music as well.  A piano was chosen as the instrument due to its efficacy for teaching music to people fo all ages.  The keys on the piano light up in anticipation of upcoming notes, and quickly flash exactly in time with the music, providing an intuitive user-experience. This interactive representation of music could potentially be more effective than traditional sheet music for those who are more visually inclined. </p>\n<h2>Challenges we ran into</h2>\n<p>With so many moving parts and interlaced layers, it was very challenging to get everything to \"wire together\" properly.  Disk images took time to set up.  Data collection and cleansing eats time as well.  And one of the downfalls of coding in multiple languages among multiple people was getting these different languages to interface cleanly and quickly with one another.</p>\n<p>Algorithm design was also a big hurdle, since before code can come to screen, a clear idea of the goal and path to it is needed.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Out of nowhere, a bunch of code was written that worked.  Data was clean.  Analyses were made.  The server rack that holds the odroids is well-designed and is both visually-appealing and highly functional.</p>\n<h2>What we learned</h2>\n<p>How to work as a team and get code to work amongst several people.  A lot of technical tricks regarding specific programming languages.  Cluster set up.  Machine learning algorithm design (n-gram, genetic algorithm).  What it really means to work nearly nonstop and under pressure. That this is definitely the right line of work for us.</p>\n<h2>What's next for ScoreSight</h2>\n<p>We plan to continue our work with this algorithm and approach to music analysis.  If music can be represented in more efficient and better ways, more people will be able to learn and study music.  In addition to this, as the quality of music generation increases, more and more interesting combinations of new songs can be written by A.I., and this can be shared by friends to others in a future social networking platform.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--3\">c++</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css3\">css3</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://noteroll.com/\" rel=\"nofollow\" target=\"_blank\" title=\"http://noteroll.com/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>noteroll.com</span>\n</a></li>\n<li><a href=\"https://github.com/micahhauge/HackathonDreamTeam\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/micahhauge/HackathonDreamTeam\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I created the dynamic visual representation of the music. I chose to developed this as a web application so that it would be accessible to anyone as a learning tool. I was also responsible for writing the script that parsed the midi files into clean data that could be used in the genetic algorithm. ", "Helped setup Knex/Odroid 20 node rack for parallel processing in our project. Setup parallel generation of the n-gram model setups. Developed n-gram model analysis to compare songs in the fitness function of the genetic algorithm.  Assisted with various other issues that came up.", "I did algorithm design and data collection / cleaning. Scripts and code were written to make tools to help with this. This was my first hackathon and so I learned a lot about working with a team and under pressure. It was my first time using github with a group and I got to experience sharing code with others.", "I worked on the Genetic Algorithm that utilized the augmented n-gram modeling in order to cause the music to 'evolve'. I also was responsible for calling all other functions and integrating the process into a single call."]], ["HeartBuddy", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<p>{\n  \"intents\": [\n    {\n      \"intent\": \"AnswerIntent\",\n      \"slots\": [\n        {\n          \"name\": \"Answer\",\n          \"type\": \"LIST_OF_ANSWERS\"\n        }\n      ]\n    },\n        {\n      \"intent\": \"AnswerOnlyIntent\",\n      \"slots\": [\n        {\n          \"name\": \"Answer\",\n          \"type\": \"LIST_OF_ANSWERS\"\n        }\n      ]\n    },\n    {\n      \"intent\": \"AMAZON.StartOverIntent\"\n    },\n    {\n      \"intent\": \"DontKnowIntent\"\n    },\n    {\n      \"intent\": \"AMAZON.RepeatIntent\"\n    },\n    {\n      \"intent\": \"AMAZON.HelpIntent\"\n    },\n    {\n      \"intent\": \"AMAZON.YesIntent\"\n    },\n    {\n      \"intent\": \"AMAZON.NoIntent\"\n    },\n    {\n      \"intent\": \"AMAZON.StopIntent\"\n    },\n    {\n      \"intent\": \"AMAZON.CancelIntent\"\n    }\n  ]\n}</p>\n<p>AnswerIntent the answer is {Answer}\nAnswerIntent my answer is {Answer}\nAnswerIntent is it {Answer}\nAnswerIntent {Answer} is my answer\nAnswerOnlyIntent {Answer}</p>\n<p>AMAZON.StartOverIntent start game\nAMAZON.StartOverIntent new game\nAMAZON.StartOverIntent start\nAMAZON.StartOverIntent start new game</p>\n<p>DontKnowIntent i don't know\nDontKnowIntent don't know\nDontKnowIntent skip\nDontKnowIntent i don't know that\nDontKnowIntent who knows\nDontKnowIntent i don't know this question\nDontKnowIntent i don't know that one\nDontKnowIntent dunno</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/amazon-web-services\">amazon-web-services</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/alexa\">alexa</a></span></li></ul>\n</div>\n</div>", ["", ""]], ["The Ninja Report", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"The Ninja Report – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/658/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>After several hours of reflection upon issues found at our university and a far to in depth solution for our weekend project. We found ourselves lost with a simple idea. After a conversation  with Scott and some stories about twitter scraping we found a new problem to solve. Detecting wireless blackouts in the Georgetown University Area. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/express-js\">express.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/angular-js\">angular.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jade\">jade</a></span></li><li><span class=\"cp-tag\">responsive-skeleton</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/redis\">redis</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/stripedhoya/top-secret-twitter-thing-api\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/stripedhoya/top-secret-twitter-thing-api\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I wrote the api and frontend", "I worked on creating a hookin into twitter using python to get specific data we want to get.  I also worked on pushing the information we want to our Redis database.", ""]], ["BizzConnect", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/KSAJX2KZnaI?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n</ul> </div>\n<div>\n<p>BizzConnect is an app that allows a user to network with professional on varies fields.</p>\n<h2>Inspiration.........It's to support business to be more efficient reaching to professionals in various fields</h2>\n<h2>What it does.....It's allows the user to find and connect with professionals in various fields , and events</h2>\n<h2>How I built it........We used android studio to make the app with a java, c++,c language, and java Script,html, php to build the website.</h2>\n<h2>Challenges I ran into.......We had to learn a few programming language that were new like php, and JavaScript</h2>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li></ul>\n</div>\n</div>", ["", "", "", "", "", ""]], ["$plittr", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>It's hard to keep track of all the costs associated with LIFE</p>\n<h2>What it does</h2>\n<p>Keeps track of all the costs associated with LIFE</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mongodb\">mongodb</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/flask\">flask</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bootstrap\">bootstrap</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/Daniel-Hoerauf/splittr\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/Daniel-Hoerauf/splittr\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["GPA Predictor", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>High school and college students are unable to calculate their grades. This tool can help them predict their grade or tell them the minimum grade they must get on their next exam to achieve their desired grade.</p>\n<h2>What it does</h2>\n<h2>How I built it</h2>\n<h2>Challenges I ran into</h2>\n<h2>Accomplishments that I'm proud of</h2>\n<h2>What I learned</h2>\n<h2>What's next for GPA Predictor</h2>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li></ul>\n</div>\n</div>", [""]], ["Hoopla", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Hoopla – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/895/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>Make your journey come alive:\nUsers  generate and upload audio stories of places based on their geo-location.\nOther users can access the stories related to a specific geo-location.\nStories can be tagged by category.\nHoopla shows the best rated stories first.\nUsers get suggestions based on interests and history.</p>\n<p>HOOPLA\nExperience the city through the spoken stories of local people</p>\n<p>How does it work?\nIt´s an app that with a repository of user generated stories about a city or community</p>\n<p>User experience:\nUsers have access to a wide number of audio tracks with stories related to a specific location\nUsers could filter the stories based on their own interest choosing categories such as: Urban, Culture, Gastronomy, Architecture, Kids, political, Mystery, Romance, Party, women empowerment, iconic tours, celebrities, personal stories, etc.\nRate and review your best stories\nGet stories’ suggestions based on your interests\nBuild your own stories and use tags to get users to find them easily. Get new followers</p>\n<p>Capabilities (Tech-oriented use tech language)\n·         User auto generated content\n·         Geo location\n·         Predictability\n    Searching functionality based on tags\n    Seamless functionality to upload content by story creator</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li></ul>\n</div>\n</div>", ["", "", "", ""]], ["Project Lambda", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration The fact that you have access to all of the worlds information in your bedroom</h2>\n<h2>What it does Turns all your files into a fun and virtual library space</h2>\n<h2>How I built it</h2>\n<p>Unity, C#, Blender</p>\n<h2>Challenges I ran into</h2>\n<p>Finding the code to move the objects</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Working together with my dedicated and passionate team</p>\n<h2>What I learned</h2>\n<p>C#</p>\n<h2>What's next for The-Library</h2>\n<p>To make this the library to use when humans go to Mars</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--2\">c#</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/blender\">blender</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/kl2723/The-Library\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/kl2723/The-Library\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Head of Version Control, Helped with the C# programming, added music to game", "I help with writing the script in c#. I also helped with the interaction for leap motion.", "I am the creative director and team leader. I articulated the vision to the team and contributed to every aspect of development. I also did all the 3d mesh modelling, animation, and audio interfacing."]], ["QuotaiOS", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h1>QuotaiOS</h1>\n<p>Quota - a practical to-do list app for iOS and Android. (HoyaHacks 2016 Project)\nSee accompanying Android app: <a href=\"https://github.com/nasalomons/QuotaAndroid\" rel=\"nofollow\">https://github.com/nasalomons/QuotaAndroid</a></p>\n<p>Quota is a typical to-do list app for rather forgetful people; the user creates an account (with email and password),\nwhich connects to Firebase. Then the user can add tasks to their list and remove them as he or she\ncompletes them.</p>\n<p>INCOMPLETE FEATURES:\nScoring system: In future updates, app will keep a score for the user's productivity. As the user completes\nmore tasks, their score will increase which creates an incentive to continue using the app.</p>\n<p>Firebase integration: As of right now the user can register for, sign in to, and create an account\nwith Quota (which is simply connected to Firebase). However the tasks are not saved or loaded to or from\nthe Firebase database right now.</p>\n<p>Saving any kind of data: As of right now the data stored in the app is temporary, that is when the user\ncloses the app, the tasks will not save. Obviously this makes the app nearly useless, but that will\nbe coming in future versions.</p>\n<h1>HoyaHacks was our very first hackathon, so we really did not know what to expect. Although our app was not fully completed, we really enjoyed the experience. Thanks HoyaHacks!</h1>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/matthewmuccio/QuotaiOS\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/matthewmuccio/QuotaiOS\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["Photo Sort", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Photo Sort – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/864/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>we made different filters and fourier transforms on 2d grayscale to calculate blur, compressions of different kinds for compression for grouping</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag\">java-core-api</span></li></ul>\n</div>\n</div>", ["", ""]], ["QuotaAndroid", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h1>QuotaAndroid</h1>\n<p>NOTE: If master branch seems incomplete, go to Noah branch. Attempted to make the branch the master, but unsure if it worked correctly. The Noah branch has the most updated version.</p>\n<p>Quota - a practical to-do list app for iOS and Android. (HoyaHacks 2016 Project)\nSee accompanying iOSapp: <a href=\"https://github.com/matthewmuccio/QuotaiOS\" rel=\"nofollow\">https://github.com/matthewmuccio/QuotaiOS</a></p>\n<p>Quota is a typical to-do list app for rather forgetful people; the user creates an account (with email and password),\nwhich connects to Firebase. Then the user can add tasks to their list and remove them as he or she\ncompletes them.</p>\n<p>INCOMPLETE FEATURES:</p>\n<p>Firebase integration: \nThe tasks are not saved or loaded to or from the Firebase database right now.</p>\n<p>Saving any kind of data: As of right now the data stored in the app is temporary, that is when the user\ncloses the app, the tasks will not save. Obviously this makes the app nearly useless, but that will\nbe coming in future versions.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/nasalomons/QuotaAndroid\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/nasalomons/QuotaAndroid\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["hoyahacks", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>No Time</p>\n<h2>What it does</h2>\n<h2>How we built it</h2>\n<h2>Challenges we ran into</h2>\n<h2>Accomplishments that we're proud of</h2>\n<h2>What we learned</h2>\n<h2>What's next for hoyahacks</h2>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/tylermaross/hoyahacks\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/tylermaross/hoyahacks\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["Relief Map (Android)", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<p>Find public toilets near you when you don't know where you are!</p>\n<p>ReliefMap allows users to find public toilets. Users add to the public toilet database by reporting toilet locations, similar to Waze.</p>\n<h2>What's next for ReliefMap:</h2>\n<p>Ratings, pictures, more data on public toilets beyond location</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/firebase\">firebase</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/dsmolyak/ToiletLocator\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/dsmolyak/ToiletLocator\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["Locus", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h1>Locus</h1>\n<p>HoyaHacks - making the world a spacious place</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/danidghoya/Locus\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/danidghoya/Locus\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", "", ""]], ["BusiMap", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>BusiMap was inspired by our desire to provide entrepreneurs with an easy way of determining potential locations to start or expand their businesses.  While we do not necessarily account for demand of products by calculating the population densities of regions in question, we do allow the user to analyze the level of competitiveness of their desired market in the particular region.</p>\n<h2>What it does</h2>\n<p>It shows you all locations of types of businesses you search for in the area surrounding Georgetown University.</p>\n<h2>How we built it</h2>\n<p>All of BusiMap is in JavaScript.  We also use Google Place's Web JavaScript API and Web Services Location API.  We used Sublime text 3 for editing the HTML and JavaScript Files.</p>\n<h2>Challenges we ran into</h2>\n<p>We frequently ran into trouble with merging our separate pieces of code through GitHub.  Often times, the merges resulted in a crucial file to the program to go missing, causing us to restart from scratch to ensure success.\nWe were also overflowing with ideas concerning useful features that could be added to the program, but had to decide on a core few due to a lack of sufficient time to implement all of them.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We succeeded in learning the fundamentals of JavaScript and smoothly incorporating Google APIs into our program. We are also proud of successfully working as a team on a complex project.</p>\n<h2>What we learned</h2>\n<p>For the majority of our team, this project was our introduction and first real experience with JavaScript.  We gained vital experience with interpreting and utilizing APIs</p>\n<h2>What's next for BusiMap</h2>\n<p>BusiMap currently focuses on the region of Washington D.C. surrounding Georgetown University, but we would like to allow the user to enter their desired region into a text box, permitting much more utility.  We would also like to account for the population densities of the regions in question, and thereby improve the program's utility as a determinant of potential business locations.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google-maps\">google-maps</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google-places\">google-places</a></span></li></ul>\n</div>\n</div>", ["My contribution was primarily in coding the front-end and back-end part of creating colored markers on the map, with each having a name and a description. I also made the method for pulling in the data.", "", "", ""]], ["Slack Wake-up bot - Master Oogway edition", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Teams often need to ensure everyone is awake and prepared, but it can be hard to coordinate someone ensuring everyone is awake. This bot automates the wake up process. </p>\n<h2>What it does</h2>\n<p>Given a slack team. The bot asks everyone at a set time if they are awake. The users will then respond to Master Oogway if they are awake. Once a set time passes, Master Oogway announces the teammates that are not awake and prepared to the general chat so someone can wake them up.</p>\n<h2>How we built it</h2>\n<p>We used an open source framework that is used in making slackbots with Javascript: <a href=\"https://github.com/howdyai/botkit\" rel=\"nofollow\">https://github.com/howdyai/botkit</a></p>\n<p>We hacked away at the available commands until we created Master Oogway.</p>\n<h2>Challenges we ran into</h2>\n<p>To ease the development process, the Botkit framework only offers a small set of actions that its bots can perform. We ran into the problem of trying to utilize the given commands that were available for our aspirations.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Master Oogway works and is relatively fun to use!</p>\n<h2>What we learned</h2>\n<p>While frameworks for building bots is relatively easy, the investment to create the bot from scratch would go a long way.</p>\n<h2>What's next for Slack Wake-up bot - Master Oogway edition</h2>\n<p>More functionality</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li></ul>\n</div>\n</div>", ["", ""]], ["VR News", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"VR News – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/859/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"VR News – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/644/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"VR News – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/660/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>After seeing pages like <a href=\"http://newsmap.jp/\" rel=\"nofollow\">http://newsmap.jp/</a> which hope to organize the huge stream of news out there, we realized the potential of this mapping news trends. Both researchers and consumers alike struggle with finding relevant data in news articles. We decided to give more flexibility in the visualization of this data, we would use VR.</p>\n<h2>What it does</h2>\n<p>Our VR app allows you to explore trending news articles in virtual reality.</p>\n<h2>How I built it</h2>\n<p>There are two parts to our app: the app itself and a web service. The web service is hosted on AWS and gathers relevant information including news categories and trends. It then aggregates the information into an easy-to-use JSON output for the app. The app requests this information at periodic intervals. It translates the data into objects and displays news articles in order based on trending topics. \n`## Challenges I ran into\nUnities version of C# does not support parsing nested object in JSON data, so we had to use workarounds and external libraries to parse this data.</p>\n<p>In addition, we had planned to use an Oculus to demo as it would have a better resolution and framerate, but we're not able to boot the Oculus up on any computers we had access to.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Our product has a solid base implementation and should be easily expandable. The web service can easily package more data, sort by complex parameters, and retrieve news by category. More data visualization can be implemented into the app simply by interpreting the new data and setting properties such as color and size relatively.</p>\n<h2>What I learned</h2>\n<p>We previously had no experience in news APIs and only minimal experience using Unity for VR. Everyone on our team got a good chance to explore these new fields and their product landscapes.</p>\n<h2>What's next for VR News</h2>\n<p>More data visualization and personalization can be packaged into the app, differentiating it more from current news aggregators and exemplifying the advantages of VR. In addition, allowing the user to see trending news through time adds another level to the data visualization applications of the app. VR allows a huge potential for data visualization, since the location, physical properties, and the world itself can change with one change of a parameter. This immerse experience allows users to experience the data, rather than just read numbers.</p>\n<p>More media integration can also make our app more visually appealing and better use VR tech. Many news sources are starting to include 360 video and other VR techniques so by adding, regular media and this VR media, the user can have a better all around experience of the news rather than just reading the news.</p>\n<p>Overall this app is about the experience. We want to continue improving UX and making users feel more immersed in this massive feed of data.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/amazon-web-services\">amazon-web-services</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--2\">c#</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li></ul>\n</div>\n</div>", ["", "", ""]], ["Blox.io", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Blox.io – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/845/datas/gallery.jpg\"/>\n<p>\n<i>Background Image To Be</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>I/O Games such as Agar.io and Slither.io</p>\n<h2>What it does</h2>\n<p>Allows you to fight/defend against NPC monsters in real time with other users on separate computers</p>\n<h2>How we built it</h2>\n<p>Frontend: javascript Backend: socket.io and node.js</p>\n<h2>Challenges we ran into</h2>\n<p>Integrating visuals (front end) with code (back end), detecting collisions, github merging, deploying to server</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Collisions between players and NPCs, integrated visuals, actually having a presentable and usable product</p>\n<h2>What we learned</h2>\n<p>How to use Github, network sockets, server side vs client side coding differences.</p>\n<h2>What's next for Blox.io</h2>\n<p>To integrate a map/background image and consider collisions between players and NPCs.\nMore people, more fun!</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/socket-io\">socket.io</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://phumd.org/\" rel=\"nofollow\" target=\"_blank\" title=\"http://phumd.org/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>phumd.org</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on Background Image To Be, Monster NPC Visual, Sword and Shield Visual", "I worked on the client side graphics.", "", ""]], ["CardinalMed", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/mIZOJ8lby80?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Patients of heart diseases can find a doctor, make an appointment and communicate with them easily  after the appointment. For example, a patient can check the medicines doctor's prescription in our app to get related information about adverse effects and recall records and talk to the doctor through our app.</p>\n<h2>What it does</h2>\n<p>Allow patients to find a doctor to make an appointment and also encourage direct connection with the doctor via the app.</p>\n<h2>How we built it</h2>\n<p>Using Mockingbot to build a prototype of our app.\nUsing HTML add CSS to build a web demo.</p>\n<h2>Challenges we ran into</h2>\n<p>We need to figure out how to link openFDA data to our website.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>It will be convenient for patients to get more information about the medicine they are taking.</p>\n<h2>What we learned</h2>\n<p>We learn how to make a website by using HTML and CSS and make an app prototype with Mockingbot.</p>\n<h2>What's next for CardinalMed</h2>\n<p>We are willing to make this app available in the market for people to use.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/zz659749/CardinalMedWeb\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/zz659749/CardinalMedWeb\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"https://github.com/zz659749/cardinalMedWebResult\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/zz659749/cardinalMedWebResult\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["ReliefMap", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h1><a href=\"https://html5boilerplate.com\" rel=\"nofollow\">HTML5 Boilerplate</a></h1>\n<p><a href=\"https://travis-ci.org/h5bp/html5-boilerplate\" rel=\"nofollow\"><img alt=\"Build Status\" data-canonical-url=\"https://travis-ci.org/h5bp/html5-boilerplate.svg\" src=\"https://res.cloudinary.com/devpost/image/fetch/s--TCWzBPFU--/https://travis-ci.org/h5bp/html5-boilerplate.svg\"/></a>\n<a href=\"https://david-dm.org/h5bp/html5-boilerplate#info=devDependencies\" rel=\"nofollow\"><img alt=\"devDependency Status\" data-canonical-url=\"https://david-dm.org/h5bp/html5-boilerplate/dev-status.svg\" src=\"https://res.cloudinary.com/devpost/image/fetch/s--k4DskC9g--/https://david-dm.org/h5bp/html5-boilerplate/dev-status.svg\"/></a></p>\n<p>HTML5 Boilerplate is a professional front-end template for building\nfast, robust, and adaptable web apps or sites.</p>\n<p>This project is the product of many years of iterative development and\ncombined community knowledge. It does not impose a specific development\nphilosophy or framework, so you're free to architect your code in the\nway that you want.</p>\n<ul>\n<li>Homepage: <a href=\"https://html5boilerplate.com\" rel=\"nofollow\">https://html5boilerplate.com</a></li>\n<li>Source: <a href=\"https://github.com/h5bp/html5-boilerplate\" rel=\"nofollow\">https://github.com/h5bp/html5-boilerplate</a></li>\n<li>Twitter: <a href=\"https://twitter.com/h5bp\" rel=\"nofollow\">@h5bp</a></li>\n</ul>\n<h2>Quick start</h2>\n<p>Choose one of the following options:</p>\n<ol>\n<li>Download the latest stable release from\n<a href=\"https://html5boilerplate.com/\" rel=\"nofollow\">html5boilerplate.com</a> or create a\ncustom build using <a href=\"http://www.initializr.com\" rel=\"nofollow\">Initializr</a>.</li>\n<li>Clone the git repo — <code>git clone\nhttps://github.com/h5bp/html5-boilerplate.git</code> - and checkout the\n<a href=\"https://github.com/h5bp/html5-boilerplate/releases\" rel=\"nofollow\">tagged release</a>\nyou'd like to use.</li>\n</ol>\n<h2>Features</h2>\n<ul>\n<li>HTML5 ready. Use the new elements with confidence.</li>\n<li>Designed with progressive enhancement in mind.</li>\n<li>Includes:\n\n<ul>\n<li><a href=\"https://necolas.github.com/normalize.css/\" rel=\"nofollow\"><code>Normalize.css</code></a>\nfor CSS normalizations and common bug fixes</li>\n<li><a href=\"https://jquery.com/\" rel=\"nofollow\"><code>jQuery</code></a> via CDN, with a local fallback</li>\n<li>A custom build of  <a href=\"http://modernizr.com/\" rel=\"nofollow\"><code>Modernizr</code></a> for feature\ndetection</li>\n<li><a href=\"https://github.com/h5bp/server-configs-apache\" rel=\"nofollow\"><code>Apache Server Configs</code></a>\nthat, among other, improve the web site's performance and security</li>\n</ul></li>\n<li>Placeholder CSS Media Queries.</li>\n<li>Useful CSS helper classes.</li>\n<li>Default print styles, performance optimized.</li>\n<li>An optimized version of the Google Universal Analytics snippet.</li>\n<li>Protection against any stray <code>console</code> statements causing JavaScript\nerrors in older browsers.</li>\n<li>\"Delete-key friendly.\" Easy to strip out parts you don't need.</li>\n<li>Extensive inline and accompanying documentation.</li>\n</ul>\n<h2>Browser support</h2>\n<ul>\n<li>Chrome <em>(latest 2)</em></li>\n<li>Edge <em>(latest 2)</em></li>\n<li>Firefox <em>(latest 2)</em></li>\n<li>Internet Explorer 8+</li>\n<li>Opera <em>(latest 2)</em></li>\n<li>Safari <em>(latest 2)</em></li>\n</ul>\n<p><em>This doesn't mean that HTML5 Boilerplate cannot be used in older browsers,\njust that we'll ensure compatibility with the ones mentioned above.</em></p>\n<p>If you need legacy browser support (IE 6+, Firefox 3.6+, Safari 4+) you\ncan use <a href=\"https://github.com/h5bp/html5-boilerplate/tree/v4\" rel=\"nofollow\">HTML5 Boilerplate v4</a>,\nbut is no longer actively developed.</p>\n<h2>Documentation</h2>\n<p>Take a look at the <a href=\"dist/doc/TOC.md\" rel=\"nofollow\">documentation table of contents</a>.\nThis documentation is bundled with the project, which makes it readily\navailable for offline reading and provides a useful starting point for\nany documentation you want to write about your project.</p>\n<h2>Contributing</h2>\n<p>Hundreds of developers have helped make the HTML5 Boilerplate what it is\ntoday. Anyone and everyone is welcome to <a href=\"CONTRIBUTING.md\" rel=\"nofollow\">contribute</a>,\nhowever, if you decide to get involved, please take a moment to review\nthe <a href=\"CONTRIBUTING.md\" rel=\"nofollow\">guidelines</a>:</p>\n<ul>\n<li><a href=\"CONTRIBUTING.md#bugs\" rel=\"nofollow\">Bug reports</a></li>\n<li><a href=\"CONTRIBUTING.md#features\" rel=\"nofollow\">Feature requests</a></li>\n<li><a href=\"CONTRIBUTING.md#pull-requests\" rel=\"nofollow\">Pull requests</a></li>\n</ul>\n<h2>License</h2>\n<p>The code is available under the <a href=\"LICENSE.txt\" rel=\"nofollow\">MIT license</a>.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/dsmolyak/ReliefMap\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/dsmolyak/ReliefMap\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"https://dsmolyak.github.io/ReliefMap/\" rel=\"nofollow\" target=\"_blank\" title=\"https://dsmolyak.github.io/ReliefMap/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>dsmolyak.github.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["n430.github.io", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<p>This site is to help refugees that come to America find meaning jobs. We are testing for skill and creating a database that companies who need to fill positions can use to find employees.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/n430/n430.github.io\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/n430/n430.github.io\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on the research components, and integration of the different quiz's used to identify skills with employer databases. Followed up with policy recommendations on how companies and the government can use the information to better streamline hiring processes for refugees.", "", ""]], ["SpartyNomNom", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<h2>What it does</h2>\n<p>Texts you every day which cafeterias have your favorite meals</p>\n<h2>How I built it</h2>\n<p>Caffeine</p>\n<h2>Challenges I ran into</h2>\n<p>Everything</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Building it start to finish in 9 hours</p>\n<h2>What I learned</h2>\n<p>How to work fast and schedule crontabs through Python</p>\n<h2>What's next for SpartyNomNom</h2>\n<p>Eating NomNomNom</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/flask\">flask</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag\">web-scraping</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/twilio\">twilio</a></span></li></ul>\n</div>\n</div>", [""]], ["TrashToTreasure", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"TrashToTreasure – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/662/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"TrashToTreasure – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/663/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>The motivation for Trash2Treasure is a prevalent problem among retail businesses, excess inventory. Brian's family owned laundromat hoards copious amounts of clothing leftover everyday. It sucks. Not only laundromats, but also bookstores and restaurants have leftover food and merchandise that go to waste. Oddly enough, there are organizations and businesses that collect excess inventory, but there is a disconnect between hoarders and collectors. </p>\n<p>To solve this problem, Trash2Treasure will acquaint desperate business to get rid of their \"Trash\" and organizations/business that \"Treasure\" that trash. Donators, businesses with excess inventory, can quickly search for collectors through our web app simply by taking a picture and briefly describing their trash vocally and vice versa.</p>\n<p>In the future, we would like to implement geolocation services on real data so that businesses may describe their waste with speech and take a picture, with our app recording their location to place them on a map, for collectors to see.  The minimizes the amount of time businesses spend on their waste, the penultimate objective.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/firebase\">firebase</a></span></li></ul>\n</div>\n</div>", ["", ""]], ["Last Man Flying", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>After a long string of hackathon projects devoted to my new programming language, I decided to go back to game development.</p>\n<h2>What it does</h2>\n<p>Last Man Flying is a first person aerial combat game in which you are the last soldier of a fleet that has all but been wiped out. But instead of dying in vain, you take to the skies for revenge.</p>\n<h2>How I built it</h2>\n<p>Last Man Flying is built using my own game engine: Kaeon ACE Ascent.</p>\n<h2>Challenges I ran into</h2>\n<p>There are several more things I wanted to implement, but overall I'm satisfied with how it turned out.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>A lot of people seemed to like the game.</p>\n<h2>What's next for Last Man Flying</h2>\n<p>Steam. Maybe.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/opengl\">opengl</a></span></li></ul>\n</div>\n</div>", [""]], ["TwitterWebScraping", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h1>TwitterWebScraping at Hoya Hacks 2016 (Washington, D.C.)</h1>\n<p>We want to analyze realtime twitter feed within the Chesapeake Bay area to report on events (crime, natural disaster, etc.) before news agencies have time to do so themselves. Our app looks at geo location-enabled tweets posted in the area and places it on Google maps with a red marker. With this technology, we want to help people avoid danger by informing them of the danger zones near them</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/ashleyyiu/TwitterWebScraping\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/ashleyyiu/TwitterWebScraping\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["HTML, CSS, Google maps API, frontend JavaScript", "", ""]], ["Mirror Mirror", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>After reading about HeforShe and hearing Emma Watson's opening speech, we thought that we would take our own personal spin on how to achieve gender parity. </p>\n<h2>What it does</h2>\n<p>Mirror, mirror is a cross platform application that seeks to empower the younger generation in realizing their full potential through continuous positive messages. We've built a working website and would like to push out an app as well as physical product into the market. </p>\n<h2>How I built it</h2>\n<p>We are first time hackers and we built a website using brackets. We also used arduinos and other hardware to try and prototype the mirror. </p>\n<h2>Challenges I ran into</h2>\n<p>We are first timers and spent a lot of time brainstorming as well as figuring out code &amp; hardware. Everything was a learning process for us. It was frustrating to have an idea but not know how to fully implement it. </p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>We were able to build a website with live webcam feature that we hope to expand upon in the future. </p>\n<h2>What I learned</h2>\n<p>A lot. But seriously, everything we did this project we learned during this time period so that was really awesome. </p>\n<h2>What's next for Mirror Mirror</h2>\n<p>We've detailed that in our submission, but we're hoping to build an app as well as launch a physical product. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css3\">css3</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bootstrap\">bootstrap</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/arduino\">arduino</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://alexanderchiang.com\" rel=\"nofollow\" target=\"_blank\" title=\"https://alexanderchiang.com\">\n<i class=\"ss-icon ss-link\"></i>\n<span>alexanderchiang.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["Split", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>All of the applicable scenarios start with \"Hey, check out this cool song!\" or \"Check out this cool video!\" and end with users either untangling headphones or playing audio over the low quality laptop speakers. No one wants to carry another dongle, a headphone splitter, around. What if there was another way to share audio out?</p>\n<h2>What it does</h2>\n<p>The backend to 'Split' is the client and server side implementation of what happens behind the scenes to share audio between multiple devices. The client side sends the audio out from the client device to the server. The server receives the data and distributes it to listening clients.</p>\n<h2>How I built it</h2>\n<p>Everything was written in C. Because I was dealing with low level audio, I was forced to build my own rudimentary server with web sockets for testing. The audio was handled by Alsaaudio.</p>\n<h2>Challenges I ran into</h2>\n<p>This is just 'the backend' because I did not have enough time to build the user interface that empowers this technology.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Building something in C (a language I don't use often. Deciphering the structure of this program with limited example code.</p>\n<h2>What I learned</h2>\n<p>C, Alsaaudio</p>\n<h2>What's next for Split</h2>\n<p>Dock mounted use, specify listeners with Facebook.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c\">c</a></span></li><li><span class=\"cp-tag\">sockets</span></li><li><span class=\"cp-tag\">alsaaudio</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/noahchristiano/headponesplit\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/noahchristiano/headponesplit\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["Scholar Abroad", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Scholar Abroad – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/243/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>The inspiration comes from listening to the problems of many of my international student friends who encounter difficulty transitioning into America.</p>\n<h2>What it does</h2>\n<p>It is a social networking platform where international students can share their insights with other international students of their university of prospective educational institutional.</p>\n<h2>How we built it</h2>\n<p>We used Figma for the Wireframe.</p>\n<h2>Challenges we ran into</h2>\n<p>We could not get into the backend stuff.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We are proud of our design layout and objective goal.</p>\n<h2>What we learned</h2>\n<p>cooperation and leadership is key.</p>\n<h2>What's next for Scholar Abroad</h2>\n<p>I am pitching this to an investor soon.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag\">figma</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/GabrielShaad/ScholarAbroad\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/GabrielShaad/ScholarAbroad\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I am the Project Manager for this Hack.", "I worked as the UX Designer of the project.", "", ""]], ["favorMe", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"favorMe – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/196/datas/gallery.jpg\"/>\n<p>\n<i>Logo for project</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"favorMe – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/221/datas/gallery.jpg\"/>\n<p>\n<i>GIF of favorMe app in action</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Humans for millennia have lived in small communities, tribes and villages of less than a few hundred people. Only relatively recently in human history have we become technologically advanced and started living in bigger communities. But living closer together has not improved communities. We have paradoxically become more isolated as our living arrangements have become more compact. Everyone faces problems in their lives that could others nearby could easily help with but it is more often than not impractical and too awkward to ask for help. </p>\n<p>How many times have you desperately needed a stapler? Or ran out of milk? Or needed help getting luggage up flights of stairs? There needs to be a way for people to harness the power of their immediate community to help solve these small problems.</p>\n<p>People need to feel needed! Apparently, the elderly are 3x more likely to die if they don’t feel needed.</p>\n<h2>What it does</h2>\n<p>favorMe allows people to give and ask for small favors. Users can download the app and create an account from which point onwards they can access the favor marketplace. The radius of the favor marketplace in miles/km can be adjusted in the settings screen. They can make a request by typing it in a search function. After making a request a feed is updated and everyone with the app in the favor marketplace radius is notified of the new request. Other users can then choose to accept the request, if they do so they are then given a time limit to fulfil the favor. If the time limit runs out, the favor request is returned to the feed for another user to fulfil.</p>\n<p>(Rewards system: Users are given favorPoints when they first sign up. Afterwards, users must do favors for others in return for more favorPoints which they can redeem for favors themselves.)</p>\n<h2>How I built it</h2>\n<p>We built favorMe app using MIT App Inventor 2, a language that uses a graphical interface that lets users drag-and-drop visual objects to build an application for Android.</p>\n<h2>Challenges I ran into</h2>\n<ol>\n<li><p>While Patrick Blinkhorn had experience with App Inventor in the past, he needed to review the language for several hours before he was comfortable using it again. In addition, he helped address several challenges his teammates encountered with App Inventor.</p></li>\n<li><p>None of us have android phones, so we needed to use the Android Emulator to test our app. It takes approximately 2-3 minutes to load the Android Emulator, so we spent a significant amount of time waiting for to test our app on the Emulator.</p></li>\n<li><p>On Saturday night, we encountered a major scaling issue with the layout of the app on the Android Emulator. It took us several hours to a) deduce the source of the bug, and b) to restructure and reformat the parameters so that all of the components fit on the screen. </p></li>\n</ol>\n<h2>Accomplishments that I'm proud of</h2>\n<ol>\n<li><p>Worked in a group setting to brainstorm a potentially revolutionary app that could connect individuals to exchange favors and regain the human connection that we are losing--ironically--as we live in more compact spaces. </p></li>\n<li><p>Identified a platform, MIT’s App Inventor, to produce the app considering the strengths and weakness of the group.</p></li>\n<li><p>Discussed the possible weaknesses in our proposed idea beforehand in order to produce an app with the best possible features.</p></li>\n<li><p>Learned to navigate through the platform’s functions and comprehend its full capacity.</p></li>\n<li><p>App Aesthetics--logo design, sizes of icon, font, etc</p></li>\n</ol>\n<h2>What I learned</h2>\n<ol>\n<li><p>Learned to use a new platform to make an Android app.</p></li>\n<li><p>The necessity for attention to detail! </p></li>\n<li><p>Experiment until you get it right! 1) Identify the problem you want to solve, 2) Observe what variables you can control to change results, 3) Try changing a small sample, 4) Continue to experiment until you recognize patterns, 5) Solve problem </p></li>\n<li><p>Hacking as a group can be difficult unless you have a clear and organized action plan. </p></li>\n<li><p>That there are platforms made to make coding easy. The idea behind App Inventor is to help people who do not know programming make an app! Coding is likely to become more and more friendly to the common person. </p></li>\n</ol>\n<h2>What's next for favorMe</h2>\n<ol>\n<li><p>Figure out effective strategies to attract users, i.e. rewards points when first register, invite friends, daily rewards for check-in.</p></li>\n<li><p>Test in communities in various scales to further clarify users’ demands and collect feedback of user experience</p></li>\n<li><p>Upgrade various functions and make them more sophisticated, e.g: the rewards system, an interesting update would be to scale the amount of favor points received for each favor with the time taken to fulfil the request. The favor feed could be a dynamic animated screen where items and services move around and can be tapped on to expand and to view more details before accepting</p></li>\n<li><p>Create polls/surveys to gauge user satisfaction and next steps for improving the app.</p></li>\n<li><p>Add a platform that will allow the app on a iOS device. </p></li>\n<li><p>Add a GPS feature that gives directions for individuals who are not familiar with the location to give or receive favor. \nClean up the interface with the help of a UX designer. </p></li>\n</ol>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mit-app-inventor\">mit-app-inventor</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/blinkhorn/favorMe\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/blinkhorn/favorMe\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I pitched the initial idea and developed the vision of the project. Helped the design aspects and thinking about functionality and execution.", "I helped on the backend of the app. I also helped design ux and the layout.", "", ""]], ["MediumPlay", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"MediumPlay – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/435/851/datas/gallery.jpg\"/>\n<p>\n<i>Trending View</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"MediumPlay – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/435/852/datas/gallery.jpg\"/>\n<p>\n<i>Listening View</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"MediumPlay – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/435/853/datas/gallery.jpg\"/>\n<p>\n<i>Search View</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"MediumPlay – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/436/479/datas/gallery.jpg\"/>\n<p>\n<i>Listening View</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Millions of people read Medium, a website that curates user generated articles, every single day for tech/political/artistic/educational/miscellaneous news and updates. Unfortunately, Medium supports only a limited API, and since all the content is user-generated, there is no way to listen to the articles podcast-style while on the go. Thus, I decided to build a mobile app to take care of this.</p>\n<h2>What it does</h2>\n<p>The app scrapes and parses Medium's website, and then runs a text-to-speech conversion, allowing users to listen to Medium articles on the go. This is also quite helpful for those with accessibility concerns. The app has a dedicated interface for displaying trending stories and also enables searching for articles of interest.</p>\n<h2>How I built it</h2>\n<p>I built this using React Native for the mobile app itself, and I implemented a scraping and parsing system written in python that is hosted using Amazon Web Services' Amazon Lambda. I also used Amazon Web Services' API Gateway to make my Lambda function accessible via an endpoint that my mobile app could access.</p>\n<h2>Challenges I ran into</h2>\n<p>The biggest challenge for me was figuring out a way to host the processes that would scrape, parse, and return data about Medium's website to my mobile app. Fortunately, Amazon Lambda provided exactly the sort of functionality I needed, and after experimenting with it for a little while, it ended up being the perfect solution. In addition to this, I had to hack the text-to-speech software to allow for a good listening experience.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>I'm very pleased that I and others will now be able to listen to Medium on the go! I get a large portion of my news from this website so I'm excited that I can now also consume that information audibly. Also, I'm incredibly happy that I now have a thorough understanding of AWS and Amazon Lambda in particular that I can draw on for projects in the future.</p>\n<h2>What I learned</h2>\n<p>I learned a lot about serverless computing through AWS Lambda, how to work with text-to-speech conversion on a mobile app, and how to carefully scrape and sanitize user-generated data.</p>\n<h2>What's next for MediumPlay</h2>\n<p>Now that I have constructed this initial framework, I see no reason that I can't build this out to support lots of other interesting content-driven sites that people want to listen to instead of reading. After some scaling work and security improvements, I'm going to launch it to the app store!</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/amazon-web-services\">amazon-web-services</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/react-native\">react-native</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/willdeuschle/MediumPlay\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/willdeuschle/MediumPlay\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Built end-to-end."]]]