[["Power Scheduler", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Power Scheduler – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/415/datas/gallery.jpg\"/>\n<p>\n<i>Home Dashboard with power graph and assets</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Power Scheduler – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/418/datas/gallery.jpg\"/>\n<p>\n<i>calendar with predictions</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Our inspiration came from wanting to deliver a combination of automatic scheduling for both machines and people. People and businesses are extremely busy due to being constantly connected, but the one thing that seems to keep people on track is their calendar. Additionally, machines aren't yet fully aware of how they should run to optimize power usage from the grid. Nest and other utilities have made an attempt at this, but we wanted to provide an app that would provide power schedules for machines too.</p>\n<h2>What it does</h2>\n<p>It reads in live power data from a resource, such as a solar grid, and then evaluates any IIoT connected assets that are producing power consumption figures. At planned intervals (15 mins right now) a real time analytic runs on the streaming data to determine a projected operation schedule(s) for the connected devices. Users can evaluate the schedule and determine whether the operational schedule fits their needs or is unreasonable. Multiple schedules and user feedback is taken into account and then retrains the analytic to become smarter.</p>\n<h2>How we built it</h2>\n<p>We built on GE Predix and used some of our favorite coding tools such as ReactJS and NodeJS. It's a simple two tiered design. The assets and real time time series data are stored in the predix-asset and predix-timeseries services respectively. We then created a front end in ReactJS that uses a reverse proxy to access the REST apis of the aforementioned services. Our real time analytic is currently run in the front end as the volume of data is small, however; we found that we could easily port the algorithm that we wrote to the Analytics Catalog.</p>\n<h2>Challenges we ran into</h2>\n<p>We had several CORS issues when dealing with the predix services. Figuring out how to make React talk to the backend REST services proved very time consuming and set us back coding. We also found that there was a lack of real time pricing data for the electrical industry and thus we had to work with batch data sets from utilities.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We feel very accomplished on a number of things but we would like to highlight a few. First, we believe the overall concept of a real time power scheduler that uses real time analytics and streaming data on predix is incredibly valuable and could be used and scaled for multiple residential and business assets. Additionally, our scheduling algorithm was a unique merge of algorithms from the \"Quarter, Nickle, Dime - problem\" and active matrix correlation. Finally, we're proud of the icon, vision statement, and theme we developed for the product.</p>\n<h2>What we learned</h2>\n<p>We learned a lot about the predix eco system and the services that it offers. Additionally, we felt that we really came together as team Arundo and we found that we were able to accomplish a lot despite several ambiguities and adversities in coding.</p>\n<h2>What's next for Power Scheduler</h2>\n<p>We're hoping to fine tune the algorithm a bit more and add an additional features for users to add their own assets in real time. We then plan on pushing to the GE App Store.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/react\">react</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css3\">css3</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://geh16.run.aws-usw02-pr.ice.predix.io\" rel=\"nofollow\" target=\"_blank\" title=\"https://geh16.run.aws-usw02-pr.ice.predix.io\">\n<i class=\"ss-icon ss-link\"></i>\n<span>geh16.run.aws-usw02-pr.ice.predix.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I was working on the dashboard, including the layout, adding gadget and displaying the chart properly with input data. ", "I worked on setting up the various libraries (eg react-redux, react-big-calendar, etc).  Helped integrate the calendar and worked on the styling there.  Helped with general issues overall on the front-end.  Helped to investigate the various libraries used.", "", "", ""]], ["FLO Force One", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"FLO Force One – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/509/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>We believe that everything should be automated and connected. We let that mentality drive us forward in our idea generation.</p>\n<h2>What it does</h2>\n<p>Our application monitors the locations of static and dynamic assets in the field. Each static asset has a location field inside the Predix Asset model. Our dynamic assets are roaming service teams. These service teams locations are constantly updating inside the Dynamic Mapping service as the teams are moving through the field.</p>\n<p>When a sensor on one of our static assets crosses a threshold (say, the temperature exceeds a certain amount), it automatically looks up the nearest service team (based on latitude and longitude) to the asset, and dispatches the team to the asset location. Upon arrival, the team is able to scan the asset via barcode and place the asset into service mode, which is reflected on the asset dashboard in real-time.</p>\n<h2>How we built it</h2>\n<p>We built the forward-facing app using Node, Express, and JavaScript. Predix Workflow/Azuqua was used for creating integrations to Predix services, and to move data between the Asset, Time Series, and Dynamic Mapping service.</p>\n<h2>Challenges we ran into</h2>\n<p>Running out of time before we could fully implement some of our app features. Mainly, the lack of the Google Distance Matrix, which would have allowed us to display the exact amount of driving time required for a crew to reach an asset that is in need.</p>\n<h2>Accomplishments that we're proud of</h2>\n<ul>\n<li>Taking three different Predix services (Time Series, Dynamic Mapping, Asset) and creating reusable integrations/connectors. Creating these connectors allows us to not only power our solution, but to create/enable other solutions in the future.</li>\n<li>Real-time dashboard that reflects data contained within Dynamic Mapping and Assets. </li>\n</ul>\n<h2>What we learned</h2>\n<ul>\n<li>Predix Time Series</li>\n<li>Predix Asset</li>\n<li>Predix Dynamic Mapping</li>\n<li>Integrating all three of those services into one awesome family!</li>\n</ul>\n<p>Philosophical learnings: not every feature is going to make it into the app. Focus on the core of the idea first. It's fun to try to take on the world, but you shouldn't try to do it one day! </p>\n<p>We're excited to experiment further with the catalogue of Predix services that are now available. </p>\n<h2>What's next for FLO Force One?</h2>\n<p>We want to fully close the loop on the automated service dispatch system, including the integration of analytics to optimize the dispatch process.</p>\n<p>We'd like to also round out the app by adding a few additional features that didn't make it due to time constraints.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jade\">jade</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/json\">json</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/predix\">predix</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/express-js\">express.js</a></span></li><li><span class=\"cp-tag\">azuqua</span></li><li><span class=\"cp-tag\">timeseries</span></li><li><span class=\"cp-tag\">asset</span></li><li><span class=\"cp-tag\">dynamicmapping</span></li></ul>\n</div>\n</div>", ["I built connectors to Predix Asset, Predix Dynamic Mapping, and Predix Timeseries providing a quick, reusable method to leverage these services. On top of those connectors, I built out a suite of FLOs in Azuqua to implement business logic and orchestrate the services which are exposed as endpoints for use by the frontend.", ""]], ["Part Repair through Digital Twin and Mixed Reality", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/43qGRf2lB1M?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"Part Repair through Digital Twin and Mixed Reality – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/472/datas/gallery.jpg\"/>\n<p>\n<i>Intro</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Part Repair through Digital Twin and Mixed Reality – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/473/datas/gallery.jpg\"/>\n<p>\n<i>Business Problem</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Part Repair through Digital Twin and Mixed Reality – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/474/datas/gallery.jpg\"/>\n<p>\n<i>End to End Idea and Solution flow</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Part Repair through Digital Twin and Mixed Reality – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/476/datas/gallery.jpg\"/>\n<p>\n<i>Turbine Monitoring solution - Digital Twin</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Part Repair through Digital Twin and Mixed Reality – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/477/datas/gallery.jpg\"/>\n<p>\n<i>SMS Notification functionality</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Part Repair through Digital Twin and Mixed Reality – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/478/datas/gallery.jpg\"/>\n<p>\n<i>Field Repair using Hololens</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Part Repair through Digital Twin and Mixed Reality – screenshot 7\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/479/datas/gallery.jpg\"/>\n<p>\n<i>Predix Components and Services used</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration - The Quest to solve industrial problems and leveraging Predix Platform to do the same motivated us to conceptualize and ideate for one of the most mobile and important persona in Industrial Businesses - Field Service Engineers</h2>\n<h2>What it does - Business Problem: About 60Bn of Services Backlog and operations cost and productivity is a big play today.</h2>\n<p>Solution: Enable the FS engineer with Real time data and insights for Optimization of the Model through Digital Twin and also enabling them to initiate part repair through Mixed Reality on a Hololens. \nGain: Target to get atleast 1% overall productivity benefit for GE’s 60Bn Services business and for a world industrial Services economy of $11.9 Trillion</p>\n<h2>How we built it : As part of the solution, we have a model prototype of a Gas Engine with 4 Piston rods and we have connected Vibration and Noise sensors onto the same and pushing that data into time series database. From there, we are running Analytics using algorithms for Expected behavior vs actual behavior for optimization of the asset and also, we have built an algorithm for Workforce analytics to identify the right skill for the right service request using a SMS Notification. Once the FS receives the notification, he wears a Hololens device where we have coded an app on the device for the FS engineers to see the Digital Twin of the Turbine in 3D and expand the turbine, see the heat map overlay of the parts and parts that are due for service. Once that is done, he initiates part repair through Mixed reality</h2>\n<h2>Challenges we ran into - One of the challenges that we ran into was around the Pieze vibration sensor that we had was not sensitive enough for the malfunction that we were trying to impersonate on the model prototype, so we had manually calibrate the sensor (hard) and mitigate that challenge. Also, we wanted to have a Rotation sensor in place but the Grove kit didn't come with the Rotation sensor.</h2>\n<h2>Accomplishments that we're proud of: The biggest USP of our solution in terms of what we were able to accomplish is the usage of Predix Components and Services as below...</h2>\n<ol>\n<li>Predix Machine - Vibration sensors and Noise sensors</li>\n<li>Used 2 Predix Catalog Services - Anomalies, Run time aggregation</li>\n<li>Predix Asset Model</li>\n<li>Used 7 Predix Services - (Postgres, UAA, Analytics Catalog, Analytics Run Time, Analytics UI, Time series, Asset database, PX)</li>\n<li>Digital Twin with Mixed Reality on Hololens and iPAD</li>\n<li>Predix Analytics - Time of Expected Arrival Workforce Analytics, 2 Algorithms contributed to Platform</li>\n</ol>\n<h2>What we learned - Oh! It's been amazing learning experience with all Predix components but primarily with the Algorithms for Digital Twins for optimization and the usage of next gen technology like Mixed Reality using Predix Services to solve the Field Service engineer issues today</h2>\n<h2>What's next for Part Repair through Digital Twin and Mixed Reality- We want to take this solution to all of GE businesses and bigger world and make it a product.</h2>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag\">springboot</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/polymer\">polymer</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/angular-js\">angular.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/microsoft-hololens\">microsoft-hololens</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--2\">c#</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/predix\">predix</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ios\">ios</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://tcs2-mmhack-ui.run.aws-usw02-pr.ice.predix.io/\" rel=\"nofollow\" target=\"_blank\" title=\"https://tcs2-mmhack-ui.run.aws-usw02-pr.ice.predix.io/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>tcs2-mmhack-ui.run.aws-usw02-pr.ice.predix.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Concept Ideation merging Digital Twin , IOT and Workforce of future into one single use case showing end to end connected value, Defined the functional architecture and the UX design", "Ideated with Solution, Architecture, Tech Stack and Predix services, envisioning the solution with augment reality on Hololens and analytics to calculate the Turbine piston actual time of cycle with vibration and noise from sensor. Developed the Augment Reality application which was the key component to the solution enabling service engineers  address service requests with mixed reality in form of gestures and voice commands", "", "", ""]], ["Tom", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Tom – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/434/datas/gallery.jpg\"/>\n<p>\n<i>Conversation 1</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>We believe that the ultimate user interface is one that is always available and gives you access to information in a natural way, that is why we created:</p>\n<p>Tom, the industrial assistant.</p>\n<p>Tom can assist you while executing a technical procedure, or help you query services on the Predix platform such as Time Series.</p>\n<p>Use case example:</p>\n<p>A group of field services engineers has a scheduled maintenance to perform in a Gas Plant, instead of packing with paper guides they have a headset with the Predix Bot - Tom.</p>\n<p>Tom gives them the list of pending procedures to execute and assists step by step, when everything is done, Tom saves all the data in the Predix platform.</p>\n<p>By making the maintenance procedures more efficient Tom saves time which translates to more energy produced.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/intel-edison\">intel-edison</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/natural-language-processing\">natural-language-processing</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/websockets\">websockets</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/predix\">predix</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://tombot.run.aws-usw02-pr.ice.predix.io/\" rel=\"nofollow\" target=\"_blank\" title=\"https://tombot.run.aws-usw02-pr.ice.predix.io/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>tombot.run.aws-usw02-pr.ice.predix.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["Ship Twin", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Ship Twin – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/823/datas/gallery.jpg\"/>\n<p>\n<i>Fight Piracy</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Ship Twin – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/824/datas/gallery.jpg\"/>\n<p>\n<i>Vessel Tracking</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h3>Predix IIoT to Fight Piracy on board Cargo Ships</h3>\n<p>\nPredix solution addresses the great need to monitor on a regular basis cargo ships. \n</p>\n<ul>\n<li><p>Provides Piracy Alert and Protection</p></li>\n<li><p>Digital Twin of a Ship in the Control Room on shore</p></li>\n<li><p>Fleet Management, including position, Real-Time Data, and Periodic Data Sync\n</p></li><li><p>Alerts sent out when Control Room stops hearing from on-board Predix machines</p></li>\n<li><p>Business worth <b>$120M</b> to Somali Pirates</p></li>\n<li><p>Costs the consumer <b>$3.3B</b></p></li>\n</ul>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/json\">json</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xml\">xml</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/predix\">predix</a></span></li><li><span class=\"cp-tag\">openlayer</span></li><li><span class=\"cp-tag\">intelligent-mapping-service</span></li><li><span class=\"cp-tag\">twilio-sms-api</span></li><li><span class=\"cp-tag\">predix-uaa</span></li><li><span class=\"cp-tag\">predix-timeseries-api</span></li><li><span class=\"cp-tag\">predix-asset-service</span></li></ul>\n</div>\n</div>", ["I am Vijay Rathna, Software Solution Architect at Chateaux. I was primary coder on the team on the application converting ideas to reality. Developed Predix solution using Predix Micro Services like Asset data service, TimeSeries, Intelligent Mapping Service and UAA. Integration of application with Twilio text message, Data Simulation and Data Ingestion services. ", "I led the team, generated the idea, pitch and architected the seed app. The seed application provided connectivity to various predix services including Intelligent Mapping (ships were shown on a map), Timeseries, User Authentication (UAA), and Asset API which was further developed to integrate SMS functionality using Twilio. I also developed a data simulator / ingestion micro service in predix to  simulate piracy event.", ""]], ["Digital Power Plant Forecast", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Digital Power Plant Forecast – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/495/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>There are already applications within the Power business that allow health and status monitoring of a power plant and its assets (i.e.- Operations Optimizer). There are also applications that enable asset modeling, or the ability to view the entire install base composition (i.e.- Power Digital Passport). </p>\n<p>What is missing, however, is the ability to forecast potential gains from equipment additions and upgrades that GE offers within its product catalog. With the Alstom acquisition and the usage of Digital Twin, GE Power is in a position to provide balance-of-plant solutions to any customer.</p>\n<h2>What it does</h2>\n<p>This tool uses preexisting data (such as the data that lives in the Operations Optimizer application), as well as the install base.  Digital Twin functionality is then utilized to replicate current operating scenarios on different equipment models, allowing identification of potential gains or losses on upgrades or replacements. </p>\n<h2>How I built it</h2>\n<p>We utilized the given timeseries Waukesha dataset as inspiration to visualize as-is performance and forecast to-be scenarios.</p>\n<p>Using Predix microservices such as timeseries, we augmented the dataset to create multiple product lines to replicate Digital Twin scenarios.</p>\n<p>In line with modern application architecture, we pushed two separate Predix applications: 1 client &amp; 1 server. Each application is independent of the other and allows for full GE store capability. </p>\n<h2>What's next for Digital Power Plant Forecast</h2>\n<p>The digital power plant forecast will hopefully be integrated into the \"killer apps\" of the business, allowing for full integration of both asset health monitoring and full product line comparison. </p>\n<p>Using the mobile-ready front end technologies that Predix provides, this application will be mobilized in order for different audiences (plant managers, customers, GE sales, etc.) to take advantage of its capability. Mobilization will be especially meaningful for those audiences on the floor.</p>\n<p>By providing the integration into the GE store, this application can utilize historical trending and analysis to predict more accurate financial outcomes as a result of our growing product catalog. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/polymer\">polymer</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/json\">json</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/predix\">predix</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://www.github.com/helizabethwhite/mmhack\" rel=\"nofollow\" target=\"_blank\" title=\"https://www.github.com/helizabethwhite/mmhack\">\n<i class=\"ss-icon ss-link\"></i>\n<span>www.github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", "", "", ""]], ["ECOFIT", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"ECOFIT – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/504/datas/gallery.jpg\"/>\n<p>\n<i>ECOFIT</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>Our view of an Intelligent Environment</p>\n<p>DESIRED OUTCOMES (for citizens):\nHealthier lifestyle\nReduced healthcare costs\nEnergy consciousness\nLower energy bills\nLower carbon footprint</p>\n<p>DESIRED OUTCOMES (for governments):\nLower healthcare cost burden\nEnergy efficient cities\nHealthy citizens</p>\n<p>Gamification is powerful in motivating behavior change – to save energy &amp; live healthy. We have built an app consolidating data from sensors for people to compete.</p>\n<p>What next?</p>\n<p>Self powering gyms\nLink to additional data like health\nSophisticated analytics to predict health outcomes\nPartnerships for rewards</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/predix\">predix</a></span></li><li><span class=\"cp-tag\">predix-ui</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/intel-edison\">intel-edison</a></span></li><li><span class=\"cp-tag\">predix-sql</span></li></ul>\n</div>\n</div>", ["I worked on the back end predix services for moving data between the front end and back end databases.   I also set up the environment in predix for UAA and microservices", "", ""]], ["Predix + Solano CI (Continuous Integration)", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Predix + Solano CI (Continuous Integration) – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/438/datas/gallery.jpg\"/>\n<p>\n<i>Predix + Solano CI Workflow</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Best practices in software development include continuous integration and deployment. We saw this as a great opportunity to make the Solano CI platform build and test Predix applications, then use AWS to test them in the cloud and deploy the apps to CloudFoundry.</p>\n<h2>What it does</h2>\n<p>We built two reference applications in the \"Digital Twin\" space and tested them with Solano CI.\n• The first application is based on the RMD reference application, and uses various services including time series, UAA/ACS for access control, and assets; and automatically generates random data consistent with both the reference application compressor and the digital twin data provided for the hackathon.\n• The second application uses time-series, UAA, and assets for the engine data provided.</p>\n<p>Moreover, Solano CI runs all the Predix unit tests. If they pass, it deploys the app to a staging environment on CloudFoundry and runs the integration tests. If those all pass, then it deploys the app to production. It can run many of the tests in parallel to save time, and displays the JUnit outcomes and Selenium browser sessions in a nice UI.</p>\n<h2>What to try</h2>\n<p>• Fork the Node.js starter at <a href=\"https://github.com/solanolabs/predix-nodejs-starter\" rel=\"nofollow\">https://github.com/solanolabs/predix-nodejs-starter</a>\n• Follow the instructions on <a href=\"http://docs.solanolabs.com/Setup/predix/\" rel=\"nofollow\">http://docs.solanolabs.com/Setup/predix/</a> and other docs to install Solano CI\n• Run the tests in Solano\n• Also take a look at the full Predix reference app at <a href=\"https://github.com/semipermeable/predix-rmd-ref-app\" rel=\"nofollow\">https://github.com/semipermeable/predix-rmd-ref-app</a> , including public sessions showing how the Solano CI automatically tests and deploys the application. For example, see <a href=\"https://ci.solanolabs.com/reports/3198008#tab=session\" rel=\"nofollow\">https://ci.solanolabs.com/reports/3198008#tab=session</a> , <a href=\"https://ci.solanolabs.com/reports/3197364#tab=session\" rel=\"nofollow\">https://ci.solanolabs.com/reports/3197364#tab=session</a> </p>\n<h2>How we built it</h2>\n<p>• We started with the Solano CI platform and customized it to work with the Predix toolchain. Then we made sure to thread all the Predix/CF authorization tokens throughout the application.</p>\n<h2>Challenges we ran into</h2>\n<p>• Getting all of the authorization tokens correct was challenging\n• Limitations in CF made it hard to deploy more than 10 services at a time\n• Some of the Predix reference apps changed over the course of the past few days</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>• We have a complete devops pipeline with GitHub, Solano CI, Predix and CloudFoundry.\n• We have Selenium browser testing working on the reference app, to ensure that UI/UX works\n• We can automatically detect regression errors in the applications before they get deployed</p>\n<h2>What we learned</h2>\n<p>• We learned a TON about Predix and CloudFoundry\n• We learned how to manage authorization</p>\n<h2>What's next for Predix + Solano Continuous Integration</h2>\n<p>• Solano Labs is going to officially support Predix applications on its cloud CI platform\n• Documentation here:</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag\">solano-ci</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/predix\">predix</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://docs.solanolabs.com/Setup/predix/\" rel=\"nofollow\" target=\"_blank\" title=\"http://docs.solanolabs.com/Setup/predix/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>docs.solanolabs.com</span>\n</a></li>\n<li><a href=\"https://ci.solanolabs.com/reports/3197364#tab=session\" rel=\"nofollow\" target=\"_blank\" title=\"https://ci.solanolabs.com/reports/3197364#tab=session\">\n<i class=\"ss-icon ss-link\"></i>\n<span>ci.solanolabs.com</span>\n</a></li>\n<li><a href=\"https://github.com/solanolabs/predix-nodejs-starter\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/solanolabs/predix-nodejs-starter\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"https://cat-rmd-ref-app-ui.run.aws-usw02-pr.ice.predix.io\" rel=\"nofollow\" target=\"_blank\" title=\"https://cat-rmd-ref-app-ui.run.aws-usw02-pr.ice.predix.io\">\n<i class=\"ss-icon ss-link\"></i>\n<span>cat-rmd-ref-app-ui.run.aws-usw02-pr.ice.predix.io</span>\n</a></li>\n<li><a href=\"https://u252-predix-nodejs-starter.run.aws-usw02-pr.ice.predix.io/\" rel=\"nofollow\" target=\"_blank\" title=\"https://u252-predix-nodejs-starter.run.aws-usw02-pr.ice.predix.io/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>u252-predix-nodejs-starter.run.aws-usw02-pr.ice.predix.io</span>\n</a></li>\n<li><a href=\"https://ci.solanolabs.com/reports/3198008#tab=session\" rel=\"nofollow\" target=\"_blank\" title=\"https://ci.solanolabs.com/reports/3198008#tab=session\">\n<i class=\"ss-icon ss-link\"></i>\n<span>ci.solanolabs.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["Smart Field Services Ops", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Smart Field Services Ops – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/456/datas/gallery.jpg\"/>\n<p>\n<i>Predix Mobile App</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Smart Field Services Ops – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/457/datas/gallery.jpg\"/>\n<p>\n<i>Smart Service App Field Logo</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Smart Field Services Ops – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/463/datas/gallery.jpg\"/>\n<p>\n<i>Capgemini Predix Transformers</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Smart Field Services Ops – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/470/datas/gallery.jpg\"/>\n<p>\n<i>Wearable Hazard Detection Gadget</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Smart Field Services Ops – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/471/datas/gallery.jpg\"/>\n<p>\n<i>Drone</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Field Operator Face lot of challenges in Day to Day Field Operations which include risk to their lives as well. We want to transform field operations into Disney Experience aiming at Field Operator Safety, Productivity and Skill Enhancement.</p>\n<h2>What it does</h2>\n<p>Data Driven Smart Field Services Operations</p>\n<h2>How we built it</h2>\n<p>Built using digital technologies using Predix Cloud, Gadgets, Drone, IPAD, Predix Machine, Hazard Detection Wearable using sensor</p>\n<h2>Challenges we ran into</h2>\n<p>UAA Setup\nPredix Mobile\nIntel Edison Board Circuit Damage</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Integration of Drone with Predix Machine and Intel Edison Board\nCustomization of Predix Machine</p>\n<h2>What we learned</h2>\n<p>We need to handle Edison Board Carefully, Waukesha Services and Intelligent Mapping Services</p>\n<h2>What's next for Smart Field Services Ops</h2>\n<p>Short Term Goal- Enhance App Features</p>\n<p>Enhance Current Incident Management with Service NOW\nDevelop Digital Twin for troubleshooting and guided assistance\nIntegrate with Wearable Glass Device for real time information access</p>\n<p>Intermediate Goal - Technology Scaling\nEnhance with DevOps services\nIntegrate Drone with Edison Board as single module\nAugment with additional wearables\nDevelop app for android mobiles</p>\n<p>Long Term Goal -  Domain Scaling\nScale app for multiple industries\nAugment with Field Services New Use Case Scenarios</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/predix\">predix</a></span></li><li><span class=\"cp-tag\">mobile</span></li><li><span class=\"cp-tag\">machine</span></li><li><span class=\"cp-tag\">timeseries</span></li><li><span class=\"cp-tag\">asset</span></li><li><span class=\"cp-tag\">waukesha</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/polymer\">polymer</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/angular-js\">angular.js</a></span></li><li><span class=\"cp-tag\">workflo</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://smart-fieldservice-ops.run.aws-usw02-pr.ice.predix.io\" rel=\"nofollow\" target=\"_blank\" title=\"https://smart-fieldservice-ops.run.aws-usw02-pr.ice.predix.io\">\n<i class=\"ss-icon ss-link\"></i>\n<span>smart-fieldservice-ops.run.aws-usw02-pr.ice.predix.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", "", "", ""]], ["Chain Of Custody for Protection of Physical Assets", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/Q5HUTaXFLwg?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"Chain Of Custody for Protection of Physical Assets – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/404/datas/gallery.jpg\"/>\n<p>\n<i>Application Flow Diagram</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Chain Of Custody for Protection of Physical Assets – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/515/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Chain Of Custody for Protection of Physical Assets – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/516/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Chain Of Custody for Protection of Physical Assets – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/517/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>There is a need to ensure protection over physical assets as they operate and are managed in the field</p>\n<ul>\n<li>Non-repudiated records of anomalous activity </li>\n<li>Non-repudiated records of service requests and completion</li>\n<li>Non-repudiated records of configuration and changes</li>\n<li>Tracking and movement of physical assets into and out of the field</li>\n</ul>\n<h2>What it does</h2>\n<p>Identifies anomalies within operating physical assets, generates service requests, tracks modifications on those physical assets and tracks assets moving in and out of the field. This information is then captured as part of a blockchain transaction to ensure non-repudiation of these activities. </p>\n<h2>How we built it</h2>\n<p>The application primarily is developed using Java and Node.js as well as the following Predix services:</p>\n<ul>\n<li>UAA </li>\n<li>Asset</li>\n<li>Timeseries</li>\n<li>Dynamic Mapping</li>\n<li>Shift Anomaly Detector</li>\n<li>Analytics Catalog</li>\n<li>Analytics Runtime</li>\n<li>Analytics UI</li>\n<li>Predix Machine</li>\n</ul>\n<h2>Challenges we ran into</h2>\n<ul>\n<li>Limitations of Predix with regard to number of instances in a space</li>\n<li>Dynamic Mapping service had an issue retrieving data (non-UAA related)</li>\n<li>Analytics UI failed after authentication and returned to login screen</li>\n</ul>\n<h2>Accomplishments that we're proud of</h2>\n<ul>\n<li>Most of the team didn't even know what Pivotal or Predix was 2 weeks ago.</li>\n<li>In discussing the use case for our project, a number of CSC team members in the company identified additional customers who would be interested in this type of scenario and how it satisfies a real world requirement.</li>\n</ul>\n<h2>What we learned</h2>\n<p>How suitable Predix was to rapid development of multiple types of applications related to tracking of assets and real-time data analysis</p>\n<h2>What's next for Chain Of Custody for Protection of Physical Assets</h2>\n<p>We're taking the show on the road after GEMM16. We now have many customers interested in seeing the work we have done here.</p>\n<h2>User Information For Demo</h2>\n<p>app_user_2 for user and password</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/json\">json</a></span></li><li><span class=\"cp-tag\">tierion</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://csc-chainofcustody.run.aws-usw02-pr.ice.predix.io/\" rel=\"nofollow\" target=\"_blank\" title=\"https://csc-chainofcustody.run.aws-usw02-pr.ice.predix.io/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>csc-chainofcustody.run.aws-usw02-pr.ice.predix.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["My main contribution was tracking anomalous events produced from the detection detection algorithm by creating non-repudiable blockchain proofs of existence.  Tricky conditional logic in UI to illustrate immutability violations to device event data.", "", "", ""]], ["Power Prediction, Monitor & Optimization", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Power Prediction, Monitor &amp; Optimization – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/450/datas/gallery.jpg\"/>\n<p>\n<i>Dashboard</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Power Prediction, Monitor &amp; Optimization – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/451/datas/gallery.jpg\"/>\n<p>\n<i>Demand Simulator</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Power Prediction, Monitor &amp; Optimization – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/452/datas/gallery.jpg\"/>\n<p>\n<i>GEJSON Services</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Power Prediction, Monitor &amp; Optimization – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/453/datas/gallery.jpg\"/>\n<p>\n<i>Kit With All Sensors</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>We want to build E2E use case for showing how data from Physical Asset can be ingested into Predix Timeseries, analytics and visualizations to predict MW Power and optimize the process to control the Asset.</p>\n<h2>What it does</h2>\n<p>It reads data from Intel Edison Chip Board using Predix Machine.data for Turbine Speed, Inlet and Outlet temperature. RPM is simulated by using different sensor.  All tags are ingested into time series. With a time interval, analytics run and calculate the Predictive power in MW that would have been generated in those operating conditions. Using MQTT,  a real time graph is displayed which shows predicted power vs power demand. The delta between the Predicted Power and the Actual Power in this graph will represent the scenarios that need tuning of the Asset like increasing the RPM or outflow/inflow to generate more power.</p>\n<h2>How we built it</h2>\n<p>Flow of application is \n1.We used Edison Board &gt;&gt; Timeseries &gt;&gt; Analytics (Catalog/Runtime) &gt;&gt; Messaging MQTT &gt;&gt; Schedulers &gt;&gt; Predix Seed User interface and Intel IOT Software to control the Step Motor\n2.Edison Board :  We used Predix Machine and Intel IOT Java libraries to run on same machine by reading and writing data.\n3.Timeseries &amp; Analytics : Integrated Time series with Power Curve Analytics that predicted the MW generation\n4.MQTT: Messaging backbone. Processing time based on 2 event streams &amp; predicted MW Power from Analytics  and Demand Simulator by simulating the power demand\n5.Creating a Web socket  based implementation on MQTT to connect User interface and show the graph on run-time.</p>\n<h2>Challenges we ran into</h2>\n<p>1.Local WIFI Setup and connectivity with Intel Edison board\n2.Issues with PostgreSQL Connection issues.</p>\n<h2>Accomplishments that we're proud of</h2>\n<ol>\n<li>Step Motor that can be controlled from Cloud - show how Predix Asset can improve and optimize its operations</li>\n<li>Complete setup of Intel board and changes done in the Pre Processor to capture &amp; change different sensors to simulate the running turbine. like Rotary switch value &amp; simulate he RPM</li>\n<li>Creating a scalable  architecture using MQTT based messaging system that allow different data sets to be treated like stream of events for easy consumption on UI layer as well as implementing run time business(Demand Vrs Predictive) rules as data comes in</li>\n</ol>\n<h2>What we learned</h2>\n<p>1.Never limit your ideas. Using Predix and Predix Machine as a PaaS, there are ample opportunities to change world\n2.Show how quick a use case can be converted from an idea to actual implementation- Predix power\n3.How to use Intel Edision Hardware to program and control  multiple sensors</p>\n<h2>What's next for DigitalTwin-GasTurbineProfile – controlled &amp; predictive</h2>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/predix\">predix</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/intel-edison\">intel-edison</a></span></li><li><span class=\"cp-tag\">mqtt</span></li><li><span class=\"cp-tag\">dataservices</span></li><li><span class=\"cp-tag\">timeseries</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://gemmui.run.aws-usw02-pr.ice.predix.io\" rel=\"nofollow\" target=\"_blank\" title=\"https://gemmui.run.aws-usw02-pr.ice.predix.io\">\n<i class=\"ss-icon ss-link\"></i>\n<span>gemmui.run.aws-usw02-pr.ice.predix.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["Digital Farm", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Digital Farm – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/437/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Digital Farm – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/489/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Vertical farming is the practice of producing food in vertically stacked layers, typically in old industrial buildings in urban centers.  For a number of reasons, some listed below, we see vertical farming as the future of agriculture.  We're taking the first steps in creating GE's next big software offering - the GE Digital Farm.</p>\n<p><strong>Context</strong></p>\n<ul>\n<li>Market for locally grown crops grew from $1 billion in 2005 to $9 billion in 2015 </li>\n<li>By the year 2050, nearly 80% of the earth’s population will reside in urban centers </li>\n<li>The human population will increase by about 3 billion people during the interim </li>\n<li>An estimated 109 hectacres of new land (about 20% more land than is represented by the country of Brazil) will be needed to grow enough food to feed them </li>\n<li>We're already using 80% of suitable farming land to grow crops </li>\n</ul>\n<p><strong>Environmental Impact</strong>\n<strong>Water</strong> </p>\n<ul>\n<li>70% of our water supply goes to agriculture </li>\n<li>70% of water contamination comes from agriculture </li>\n<li>Vertical farming uses 95% less water </li>\n</ul>\n<p><strong>Land</strong> </p>\n<ul>\n<li>25% of the world’s land is now “highly degraded,” with soil erosion, water degradation and biodiversity loss </li>\n<li>Vertical farming uses less than 1% of the land required by conventional growing </li>\n<li>Vertical farming is over 75 times more productive per square foot vs. traditional agriculture </li>\n</ul>\n<p><strong>Carbon Emissions</strong></p>\n<ul>\n<li>95% of America's leafy greens are grown in the western portion of the US, meaning it may have to travel thousands of miles to get to your plate. </li>\n<li>Vertical farms can exist in old industrial buildings within any city, meaning transportion costs (financial and environmental) are mostly eliminated.</li>\n</ul>\n<h2>What it does</h2>\n<p>Provides vertical farms with a way to visualize their KPIs, pull insights from them, and adjust their operations accordingly.</p>\n<h2>How we built it</h2>\n<p>For a production build, this will require many more sensors (type &amp; quantity) - we used the provided Intel Edison board and Predix Machine to simulate some of the sensor data that will be used in production, light and temperature.  We pulled this into the Predix Time Series service from which we used custom algorithms to feed it into Predix UI in insightful ways.  Using existing Predix components, we were able to create charts to provide visualizations to help vertical farm owners gain quick insights.</p>\n<h2>Challenges we ran into</h2>\n<ul>\n<li>Finding data - ideal \"light recipes\" for LEDs is considered proprietary information (against the rules for this hackathon)</li>\n<li>Predix-UI context browser is trickier than expected</li>\n<li>Writing algorithms is hard</li>\n</ul>\n<h2>Accomplishments that we're proud of</h2>\n<ul>\n<li>Successfully ingesting data into Time Series via Predix Machine</li>\n<li>Custom algorithms for Vertical Farm specific KPIs</li>\n<li>Chart manipulations (trickier than we thought)</li>\n</ul>\n<h2>What we learned</h2>\n<ul>\n<li>How to use Time Series</li>\n<li>How to use Predix Machine</li>\n</ul>\n<h2>What's next for Digital Farm</h2>\n<ul>\n<li>Work with Current, powered by GE to create a full build and begin selling to customers.</li>\n</ul>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/predix\">predix</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/polymer\">polymer</a></span></li><li><span class=\"cp-tag\">time-series</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://tbd-dashboard.run.aws-usw02-pr.ice.predix.io/\" rel=\"nofollow\" target=\"_blank\" title=\"https://tbd-dashboard.run.aws-usw02-pr.ice.predix.io/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>tbd-dashboard.run.aws-usw02-pr.ice.predix.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I set up the Intel Edison board and got data streaming into Time-Series. I then worked on the frontend (first Polymer experience).", "I built the component that pulls and charts data from Predix Timeseries, and wrote the algorithm to calculate how many hours of sunlight a plant receives in a day.", "", ""]], ["EPICenter", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"EPICenter – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/465/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>We want to make Smart Cities even Smarter. In 2015, GE partnered with the city of San Diego to create a truly smart city. Our application, EPICenter, conceptualizes the next step in making cities truly smart.</p>\n<h2>What it does</h2>\n<p>EPICenter simulates the movement of people around the Minds and Machine Conference here in San Francisco. You'll see that as people move, clusters are formed, and a colour and number assigned. The number represents how many people are in that cluster and the colour how dense of a  population that in comparison to the population of the greater area.  This scale changes as you zoom in and out of the map. </p>\n<p>This application has multiple use cases.\nFor Security:\n -Optimizing resources on social and political events.\n-Predicting security threats.</p>\n<p>For Retail:\n-Smart advertising based on visibility\n-Premium charges for “busy” billboards.</p>\n<p>For Government:\n-Smart city planning.\n-Energy saving.\n-Improve emergency response.</p>\n<h2>How we built it</h2>\n<p>We used a whole host of technologies. We have a time-series database on the backend controlled by a springboot Java Application. This feeds the data through to a node Javascript project which includes a whole host of  external libraries. Our foundation was the smallworld sample project.</p>\n<p>The whole application is protected by UAI to ensure only those privileged groups who should have access to should. </p>\n<h2>Challenges we ran into</h2>\n<p>Time! As with all hackathons, the learning curve is steep and there is not much time to debug issues which can mean changes of direction are necessary. </p>\n<p>The time-series database was difficult to get running and as a team we had knowledge gaps which we had to fill quickly.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Morale stayed high throughout the project and we worked really well as a team.\nWe had a lot of knowledge gaps that we worked hard to fill.\nWe created a fully functional product that completely works! </p>\n<h2>What we learned</h2>\n<p>We learned about the benefits of micro service architecture, and how Predix can help us to move fast. </p>\n<h2>What's next for EPICenter</h2>\n<p>That's up to you! We would love to continue development but we will need support from the business.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/predix\">predix</a></span></li><li><span class=\"cp-tag\">time-series</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css3\">css3</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/openlayers\">openlayers</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/openstreetmap\">openstreetmap</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bootstrap\">bootstrap</a></span></li><li><span class=\"cp-tag\">spring-boot</span></li><li><span class=\"cp-tag\">uai</span></li><li><span class=\"cp-tag\">smallworld</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://epicentre.run.aws-usw02-pr.ice.predix.io/\" rel=\"nofollow\" target=\"_blank\" title=\"https://epicentre.run.aws-usw02-pr.ice.predix.io/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>epicentre.run.aws-usw02-pr.ice.predix.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["FAT Finger + Predix", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"FAT Finger + Predix – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/410/datas/gallery.jpg\"/>\n<p>\n<i>FAT Finger + PREDIX</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"FAT Finger + Predix – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/435/330/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"FAT Finger + Predix – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/435/331/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>What We Did:  Empowering Bob to build a Predix Apps in Seconds with no code </p>\n<p>Presentation Artifacts: \n<a href=\"https://www.dropbox.com/s/05vih7pwmxi7nu2/Predix%20FAT%20FINGER%2005%20copy.pdf?dl=0\" rel=\"nofollow\">https://www.dropbox.com/s/05vih7pwmxi7nu2/Predix%20FAT%20FINGER%2005%20copy.pdf?dl=0</a></p>\n<p>Login Credentials:  </p>\n<p><a href=\"https://ccc.seeforge.com\" rel=\"nofollow\">https://ccc.seeforge.com</a></p>\n<p>ID: <a href=\"mailto:predix@seeforge.com\" rel=\"nofollow\">predix@seeforge.com</a> \nPW: predix</p>\n<p><a href=\"https://fatfinger-nodejs-starter.run.aws-usw02-pr.ice.predix.io\" rel=\"nofollow\">https://fatfinger-nodejs-starter.run.aws-usw02-pr.ice.predix.io</a>\nID: app_user_1\nPW: app_user_1</p>\n<p><a href=\"https://rmd-ref-app.run.aws-usw02-pr.ice.predix.io/dashboard\" rel=\"nofollow\">https://rmd-ref-app.run.aws-usw02-pr.ice.predix.io/dashboard</a>\nID: app_user_1\nPW: app_user_1</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag\">fat-finger</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/predix\">predix</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://ccc.seeforge.com\" rel=\"nofollow\" target=\"_blank\" title=\"https://ccc.seeforge.com\">\n<i class=\"ss-icon ss-link\"></i>\n<span>ccc.seeforge.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Empowering Bob to build a Predix Apps in Seconds with no code "]], ["air quality monitor and diagnosis ", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>According to CDC chronic lower respiratory diseases are the 3rd cause of death for the last 15 years and the rates didn't decrease, also the rates are bigger in big cities than small towns.</p>\n<p>As an individuals we're trying to eat healthy, do some exercise, avoid hazardous situations </p>\n<p>As a society we're trying to have a better resources management to consume as less we can, create electric vehicles to decrease air pollution, but still we have a long path to follow, until we are not on there we need to know what are the current and future air quality conditions to take actions and mitigate risks, doesn't matter what we do as an individuals or as society if the air we breathe is not good enough, we always hear about the water but what about the air?, both things are necessary to survive  </p>\n<h2>What it does</h2>\n<p>it's a real time application to monitor several parameters (temperature, traffic, wind, pollution) and uses those to identify risks and predict what could be the ideal conditions for a catastrophe, providing the users a tool to know what they can expect and take predictive actions  </p>\n<h2>How we built it</h2>\n<p>We use intel edison and the grove sensors include to monitor in realtime environment conditions, also we include a mapquest and google maps to show in realtime in the map the air quality measurement in a map, including traffic alerts, time series data is stored in predix and also analyze, using the analytics micro services predix provides (anomaly detection) to identify hazardous conditions according to monitored parametres</p>\n<h2>Challenges we ran into</h2>\n<p>put together in a simple way all parameters to show how those affect air quality</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>we we're able to achieve our biggest challenge</p>\n<h2>What we learned</h2>\n<p>how predix can handle a lot of data and analyze pretty fast</p>\n<h2>What's next for air quality monitor and diagnosis</h2>\n<p>Add as much variables we can to be more accurate in predictions </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag\">predix-time-series</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/intel-edison\">intel-edison</a></span></li><li><span class=\"cp-tag\">predix-machine</span></li><li><span class=\"cp-tag\">predix-analytics</span></li><li><span class=\"cp-tag\">predix-assets</span></li><li><span class=\"cp-tag\">predix-uaa</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google-maps\">google-maps</a></span></li><li><span class=\"cp-tag\">mapquest-incidents</span></li><li><span class=\"cp-tag\">intelligent-mapping-data</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://softtekmm.run.aws-usw02-pr.ice.predix.io\" rel=\"nofollow\" target=\"_blank\" title=\"https://softtekmm.run.aws-usw02-pr.ice.predix.io\">\n<i class=\"ss-icon ss-link\"></i>\n<span>softtekmm.run.aws-usw02-pr.ice.predix.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", "", ""]], ["City of Tomorrow", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"City of Tomorrow – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/446/513/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Provide a Clean, Healthy &amp; Better environment to the community</p>\n<h2>What it does</h2>\n<p>Built a Predix solution to cater to multi-modal city ecosystem. The solution enables - \n    ⁃ Predicts potential emergency situations arising due to water contamination or hazardous waste not attended \n    ⁃ Integration across public utility services to hospitals to transportation systems\n    ⁃ Alerting to manage to the emergency responses</p>\n<p>Smart Water, Smart Waste,  Smart Mobility, Smart Healthcare modules of the solution enables enables smart localities across the city. \nSmart Water - Enables monitoring of water reservoirs for the pH, turbidity, chlorine &amp; uranium impurities\nSmart Waste - Enables monitoring of the garbage bins across the city for the fill level &amp; and generation of any hazardous elements\nSmart Healthcare - Monitors the occupancy level at the hospitals &amp; the critical medicines inventory\nSmart Mobility - Monitors the garbage collection vehicle, City bus, fire truck locations. Helps to optimize the route for the garbage collection vehicles; helps the community residents to select the right mode of transport</p>\n<h2>How we built it</h2>\n<p>TCS team decided to build the solution on the  “Intelligent Environment” theme. The team started with brainstorming session listing the key needs to develop a smart community. We developed the solution using Predix components, Intel Edison, sensors, etc. The key Predix services from the catalog used for the solution are - UAA, Asset, Timeseries, Postgres. Team has also developed analytics services to predict the Risk score of the water contamination &amp; waste management. We also integrated the application with weather &amp; map APIs.</p>\n<h2>Challenges we ran into</h2>\n<p>Time lag while posting the time-series data</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Excited to see a working solution that can be expanded further to make The Community a BETTER place to live!</p>\n<h2>What we learned</h2>\n<p>Voice integration with Predix</p>\n<h2>What's next for City of Tomorrow</h2>\n<p>To develop the industrial grade solution which can be monetized </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/predix\">predix</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/angular-js\">angular.js</a></span></li><li><span class=\"cp-tag\">px</span></li><li><span class=\"cp-tag\">predix-machine</span></li><li><span class=\"cp-tag\">time-series</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://tcs-hackathon-smartcity.run.aws-usw02-pr.ice.predix.io\" rel=\"nofollow\" target=\"_blank\" title=\"https://tcs-hackathon-smartcity.run.aws-usw02-pr.ice.predix.io\">\n<i class=\"ss-icon ss-link\"></i>\n<span>tcs-hackathon-smartcity.run.aws-usw02-pr.ice.predix.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["Data Integrity for Sensor Configuration", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Maintain the integrity of a sensor configuration - which is critical when working outside of normal working conditions.</p>\n<h2>What it does</h2>\n<p>We use block chain technology provided by the Data Integrity Assurance service to security sign the sensor configuration on initial creation as well as on updates via a Sensor Manager micro-service. </p>\n<p>The sensor configuration is then stored in Asset services.</p>\n<p>The Sensor Manager micro-service can be used to verify the integrity of any sensor configuration at any time. \nIt can also be used to add new sensors, update configuration on existing sensors or delete sensors.</p>\n<p>The Sensor Controller retrieves the sensor configuration and verifies the integrity of the configuration before using the configuration values. If a new configuration is detected and retrieved, the integrity of the new configuration is verified before using it. If the new configuration is not verified successfully, the sensor continues to use the last know verified configuration.</p>\n<h2>How we built it</h2>\n<p>The Sensor Manager micro-service is written in java using Ericsson's Data Integrity Assurance service, Asset services, Timeseries service, UAA, and POSTGRES. The Sensor Controller is written in nodejs and uses REST interfaces into the Sensor Manager application.</p>\n<h2>Challenges we ran into</h2>\n<p>Using Predix Seed UI to connect to a micro-service other than Asset services, Timeseries, or the UAA. Instead of using Predix Seed UI, we instead built the UI interface into the Sensor Manager micro-service.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We've been able to demonstrate the successful introduction and integration of the new services with the Predix platform and provide a mechanism for further integration.</p>\n<h2>What we learned</h2>\n<p>A lot about the Predix platform capabilities to communicate with the outside world and how we could extend it further with new services to account for a more diverged set of use cases.</p>\n<h2>What's next for Data Integrity for Sensor Configuration</h2>\n<p>We would like to use Predix Machine to generate actual sensor data to feed into the Sensor Manager and provide data integrity for the sensor's data as well as the sensor's configuration. We would also like to successfully connect the Predix Seed UI to the Sensor Manager micro-service to provide a GE look and feel to the Sensor Manager micro-service.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/postgresql\">postgresql</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/json\">json</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/maven\">maven</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://mmhack.run.aws-usw02-pr.ice.predix.io/\" rel=\"nofollow\" target=\"_blank\" title=\"https://mmhack.run.aws-usw02-pr.ice.predix.io/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>mmhack.run.aws-usw02-pr.ice.predix.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on the Sensor Manager micro-service back-end. I provided the REST APIs made available to the Sensor Controller and Front End UI.", "I worked on the front-end UI that interfaces with the back-end micro-service to retrieve/update data via REST APIs.", "", ""]], ["FLO (Flow Logistics Optimization)", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/Dj3TsXELGUk?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;start=&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n</ul> </div>\n<div>\n<h2>Business Statement</h2>\n<p>GE Transportation has a plant in Fort Worth, TX. This plant utilizes carts to move material around the factory to organize and assemble kits. As the carts traverse the plant floor, the plant often has bottlenecks, which can leave carts sitting idle at one station for days at a time. This plant has recently installed RFID tags on all of their carts with scanners at each station in order to track the carts as they flow through. With this new stream of data, the plant urgently needs the capability to intelligently assess their process so they can remove these bottlenecks and drive plant efficiency.  </p>\n<h2>How we built it</h2>\n<p>Dynamic Mapping, \nUAA, \nTime Series, \nPredix Machine, \nIntel Edison Board, \nPostGres, Cascade, and \nPredix-UI-Seed</p>\n<h2>Our Solution</h2>\n<p>Our application, FLO (Flow Logistics Optimization) leverages the RFID live data stream of timestamp-ed cart locations along with Predix's dynamic mapping service in order to visualize carts on the map as they move through the plant. This enables plant workers and management to see where carts and kits are along the manufacturing process at any given time. \nAlong with this, we've built a set of analytics, which leverage this RFID data to do cycle analysis, empowering management to identify and address performance challenges around kits, stations and employees. \nLastly, we've configured an Intel® Edison Board with built-in simulation sensors to be applied at the Assembly Stations in Fort Worth, in order to identify potential performance issues early on by visualizing data from sensors on the machines at these work stations.</p>\n<h2>Challenges we ran into</h2>\n<p>Dynamic Mapping - \nEdison Board: \n    Initial configuration provided many challenges for us. Ran into issues with known bugs around Windows 7.\nData: \n     We had major challenges with the cleanliness of the data. Currently there are a many repeating records, where the same cart is read multiple times as it passes by an scanner. As well, many airwave frequencies interfere with the RFID system which has caused misreads to be recorded. </p>\n<h2>Accomplishments that we're proud of</h2>\n<ul>\n<li>Surviving the cold in the tent booth on Tuesday night.</li>\n<li>Surviving the heat and blinding sunshine in the tent booth on Wednesday morning.</li>\n<li>Got our url live and functioning.</li>\n<li>Working Intel Edison Board with incoming data. </li>\n<li>Executing on a real business problem from GE Transportation, and providing immediate business value for that team. </li>\n</ul>\n<h2>What we learned</h2>\n<ul>\n<li>Live data feed correlating to Dynamic Mapping.</li>\n<li>Features on Dynamic Mapping.</li>\n<li>(hashtag) Mannequin Challenge</li>\n</ul>\n<h2>What's next for FLO (Flow Logistics Optimization)</h2>\n<ol>\n<li>Live implementation of the Edison Board at the assembly station for testing, and further implementation at all stations as relevant. </li>\n<li>Cleansing and process improvement around the RFID data collection. There is a lot off repetitive reads done as carts pass the scanners.</li>\n<li>Continued development of analytics. There is still a lot more that can be done to make our dashboard even more impactful to improve the plants processes. </li>\n<li>Further scoped out dynamic mapping</li>\n</ol>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/predix\">predix</a></span></li><li><span class=\"cp-tag\">cascade</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/angular-js\">angular.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/intel-edison\">intel-edison</a></span></li><li><span class=\"cp-tag\">intelligent-mapping</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/polymer\">polymer</a></span></li><li><span class=\"cp-tag\">rest-api</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://dtlp1-nodejs-starter.run.aws-usw02-pr.ice.predix.io/flo/flo-app.html\" rel=\"nofollow\" target=\"_blank\" title=\"https://dtlp1-nodejs-starter.run.aws-usw02-pr.ice.predix.io/flo/flo-app.html\">\n<i class=\"ss-icon ss-link\"></i>\n<span>dtlp1-nodejs-starter.run.aws-usw02-pr.ice.predix.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", "", "", ""]]]