[["Duly Noted", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>-Hearing impaired people not being able to effectively take notes in a lecture</p>\n<h2>What it does</h2>\n<p>Through the use of the Google Web Speech API, we are able to track the words being said by a lecturer. We store these words into our application and parse them to search for certain key words such as \"for example\" to organize the notes and emphasize important points. This all happens in real time. There is also an option to export the words to a pdf file for future access to the notes.</p>\n<h2>Challenges I ran into</h2>\n<p>Figuring out how to best retrieve microphone input in real time and correctly format the inputted text for the user to view/download/and email.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>-Putting everything together and having something cool we can actually use in our lives</p>\n<h2>What I learned</h2>\n<p>-How to effectively manage a project on Github\n-How to parse text in live time using JQuery, JavaScript, PHP\n-An introduction to NLP algorithms</p>\n<h2>What's next for Duly Noted</h2>\n<p>-More options for sharing\n-Customization for lecturers/students so that they can insert their own keywords and select from pre-set formatting methods.\n-A nicer, more user-friendly front end</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google-web-speech-api\">google-web-speech-api</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.gatech.edu/jnanda3/HackDuke\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.gatech.edu/jnanda3/HackDuke\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.gatech.edu</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on getting the webkit speech api working. Also got the realtime parsing of information working.", "I worked on the front end of the application :D", "I worked on the note formatter to read and format text in live time based on key words/rules.", "I linked the speech WebKit and the note formatter to effectively listen and take notes.", "I worked on PDF functionality and email functionality."]], ["PantreePal", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"PantreePal – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/725/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"PantreePal – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/734/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"PantreePal – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/736/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"PantreePal – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/774/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>No more asking \"what is available.\" It's time to ask the real question: \"where is it available?\"</p>\n<p>Starvation is one of the most dehumanizing consequences of income inequality. Within just the past 3 years, an estimated 50 million Americans are suffering from malnutrition. They lack not only the income to purchase meals but also the resources to discover where food may be served around them. PantreePal was inspired to put an end to the inhuman, unjust, unacceptable reality that we as a society often overlook.</p>\n<h2>What it does</h2>\n<p>PantreePal provides numerous user interfaces for individuals to log food inventory. Users [volunteers at a food bank] can either manually create entries through a web or mobile UI, or they can simply take a picture of multiple items through the mobile interface, which will automatically log all the food items in the picture. The web interface provides visual displays of the makeup of the food inventory, which updates in real time as users add and remove from it. </p>\n<h2>How I built it</h2>\n<p>Within the app, when a user takes a picture of a food item, the image is processed using OpenCV and Tesserate. We used the Neumann &amp; Matas algorithm to form our classifiers. The extracted words from the image are sent back to the app so that the user can validate the number and type of items that will be added to the food bank's inventory. </p>\n<p>The backend is primarily Java/Spring/AWS cloud processing with MySQL for the database. The front end is an Android app and web app. HTTP requests are managed using Square's OKHTTP api. The Web app is backed by bootstrap, using bower as a package manager.</p>\n<h2>Challenges I ran into</h2>\n<h2>Accomplishments that I'm proud of</h2>\n<h2>What I learned</h2>\n<h2>What's next for Foodbanker</h2>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/opencv\">opencv</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/tesseract\">tesseract</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/spring\">spring</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/gradle\">gradle</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://pantreepal.com\" rel=\"nofollow\" target=\"_blank\" title=\"http://pantreepal.com\">\n<i class=\"ss-icon ss-link\"></i>\n<span>pantreepal.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on using OpenCV and Tesseract with the NM algorithm to do image to text recognition.", "I helped get the various subprojects off the ground and worked on the web server/API.", "", "", ""]], ["Tiresias", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/CnP2vg6WjNU?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n</ul> </div>\n<div>\n<h2>Coding for Good: Health and Wellness</h2>\n<p>Over 20 million American adults have some form of vision loss, and the WHO estimates that at least 280 million people are visually impaired worldwide. Currently, most buildings and campuses are not disability-friendly and do not allow for easy navigation for those with vision loss. Assistive devices can call unwanted attention or can be limited to a small range of movement. In addition, these products also rely on the user's intuition or inference and can be less helpful in new environments where the user is not familiar with the layout of the building.</p>\n<h2>Project Tango “sees how we see”</h2>\n<p>This Google smartphone/tablet project uses a Point Cloud Library to map a space based on xyz coordinates of each point in the device's range of vision. It has applications in virtual reality, area learning, and indoor wayfinding. </p>\n<h2>Visualizing Unfamiliar Environments</h2>\n<p>Over the course of 20 hours, we created an android app utilizing Project Tango's Point Cloud Library that was able to differentiate between obstacles, walls and corners, and ascending and descending staircases using depth patterns. We designed this app with the visually impaired in mind and used text to speech to give auditory directions to the user to help them navigate new buildings. </p>\n<h2>Implementation</h2>\n<p>Using the Point Cloud Library, we created a digital representation of the immediate physical space around the user.\nWe then extracted coordinates from the Point Cloud Buffer and clustered depth readings into different sectors. By analyzing the relative and absolute depth of different sectors, we were able to establish threshold values and algorithms to differentiate between various obstacles and determine the commands that were given (left, right, wall, obstacle, upstairs, downstairs, okay). Voice commands were implemented using Android's Text to Speech. </p>\n<h2>Challenges</h2>\n<p>Extracting depth values from Point Cloud Buffer, setting accurate threshold values for different objects, and\nimplementing a \"slope\" threshold for staircases that would set them apart from walls or simpler obstacles.</p>\n<h2>Accomplishments</h2>\n<p>Using our application, a blindfolded person was successfully able to navigate staircases and obstacles (see video).\nIn the future, this app could be utilized by the visually-impaired to walk through buildings and receive real-time, predictive, auditory aid without having to rely on other people, animals, or tools. </p>\n<h2>What's next</h2>\n<p>Apply the app to a smaller device such as an Android smartphone in order to minimize hassle.\nRefine communication from device to user to make the device more subtle, possibly using bluetooth bands to vibrate based on the next steps the user should take.\nImplement location-based services to give directions from room to room within a building that the user has never visited using a combination of satellite GPS and provided floor plans.\nUse area learning to store and refine routes over time if the user revisits the same place for future reference.\nDeal with challenges such as sunlight interference and crowded spaces.\nDesign a practical physical implementation of the app that the user could wear in a hands-free manner.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/project-tango\">project-tango</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/Kupoko/Tiresias\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/Kupoko/Tiresias\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on developing the algorithms to detect the difference between walls, obstacles, and stairs as well as conducted extensive testing of the app.", "I worked on the backend and the implementation of our API. Android Studio and our code was run on my computer and I did software debugging. ", "I worked on the algorithm to extract a heat-map from the PointCloud data to determine and alert the user of various potential dangers of their surroundings.", ""]], ["Footstep", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Footstep – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/699/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>If every commuter were to decrease their carbon dioxide emissions by just 10%, there would be a decrease in carbon dioxide emissions by hundreds of pounds. However, it has been shown that simple tracking does not encourage alternative methods of commuting - traditional tracking requires input from the user, however minimal. Thus, we wanted to target this issue and while requiring no user input to the application.</p>\n<p>In order to raises awareness of day-to-day subconscious decisions that detrimentally affect the environment. Footstep tracks movement and GPS location and predicts the likelihood of being in a vehicle. If the prediction is positive, Footstep will automatically run in the background and track GPS location until a final destination is reached, which it will intelligently stop recording if so and organize commute by “trips” based on start/end time and location. The results are displayed on a day-to-day basis for a user to view, and each route is accompanied by alternative walking/biking routes that can be taken. Footstep in the future can be extended to intelligently predict when a user will be taking a common commute route and immediately suggest an alternative walking/biking route that matches with a user’s schedule/linked calendar. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/alexdao/footstep\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/alexdao/footstep\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Worked on Android UI, API calls, and local data persistency.", "", ""]], ["CrowdNine", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/Hb80Y8yYkKM?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>As our group brainstormed, we thought of all of the problems we could address, such as what we saw in our day to day lives. At some point or another, we began to discuss the homeless and the adversities they faced. While thinking about how we could tackle the issues of the homeless and low-income, we stumbled upon data showing the low access to food and groceries that many American families faced. For some, not having a car made it difficult for people to go grocery shopping and get food and necessities they might need - especially if they had to work many hours of the day. We decided that we could address this problem with a tool that we used when we needed things from places not immediately available to us on campus - Postmates. The intersection of the two resulted in CrowdNine.</p>\n<h2>What it does</h2>\n<p>CrowdNine a web-based crowdsourcing platform, connecting people from low-income areas with people who want to help them out by funding them for individual baskets of groceries and food. Users sign in through Google and Facebook Authentication to maximize security. Donors perform transactions through the Stripe API, and recipients request and receive their baskets through Postmates and the Postmates API. We used Google Geocoder to give local results and options to donors and recipients. </p>\n<h2>How we built it</h2>\n<p>We built the front end of Crowd Nine using Jade, an HTML template language, and used JavaScript to get data from the site to the Node.js server. The server communicates with MongoDB to store basket data, including all of the items in it, and the total price. When users find baskets to donate to, they simply pay with a credit card through the Stripe API.</p>\n<h2>Challenges we ran into</h2>\n<p>We faced many challenges along the way in the creation of this project, as none of us had ever worked with Jade, MongoDB, and we had very little to no experience in JavaScript. Most of our problems occurred with learning these new technologies and making the API calls despite the adversity, however our most challenging problem was making the final connection between the variables stored locally client-side and the database.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Getting the stack to work in the first place was a huge achievement, considering we had never done it before. After getting something running, we started tackling the different API calls, and were able to successfully get data from all of the ones we tried. While it seems relatively simple, some members of our group have struggled to deal with this portion of the development cycle beforehand, making our success even more incredible. </p>\n<h2>What we learned</h2>\n<p>Before this project, we really didn't have much experience working with Javascript or any of the related libraries or environments. So, building CrowdNine served as an incredible learning experience, as we figured out how to create a novel application in a short period of time while familiarizing ourselves with the technology. We also found ourselves greatly enjoying creating an application that can actually have a significant impact on the world. In the end, the most important thing that we learned was that, we can make a difference, and this motivated us more than ever before.</p>\n<h2>What's next for CrowdNine</h2>\n<p>We hope to build the CrowdNine platform to be more robust and be able to handle a significant amount of users. Furthermore, we hope to increase the amount of products that we can offer low-income families beyond basic groceries and necessities.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mean\">mean</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jade\">jade</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/stripe\">stripe</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/postmates\">postmates</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mongodb\">mongodb</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google-web-authentication\">google-web-authentication</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/facebook-login-api\">facebook-login-api</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/express-js\">express.js</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/chaityabshah/CrowdNine\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/chaityabshah/CrowdNine\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I mainly worked on the UI, graphics, and building the frontend of the application.", "", "", ""]], ["Ecodiversity", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Ecodiversity – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/769/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Ecodiversity</h2>\n<p>Biodiversity is a key indicator of the environmental health of an area. By allowing people from around the world to contribute to our database of animals in a simple, well-validated way, we can compile and visualize the biodiversity in various regions throughout the United States. Ecodiversity is catered towards all people, and its simplicity allows AP Environmental Science classes to use it as an educational tool. </p>\n<h2>Technology</h2>\n<p>We used Polymer to lay out the front-end with some CSS modifications, and we implemented the ESRI Javascript API to create feature layers on top of our map and to embed it into our website. </p>\n<h2>Future</h2>\n<p>Our next steps include:</p>\n<ul>\n<li>creating options for multiple visualizations, such as choropleths or heat maps, that could be based on whichever environmental statistic is most appropriate for that type of visualization</li>\n<li>adjusting our map so it displays aggregate sums of biodiversity factors in granular ecoregions</li>\n<li>contacting the EPA to learn what best animal tracking techniques can account for duplicate animals and invasive species</li>\n</ul>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/polymer\">polymer</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/esri\">esri</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://sifronb.com/hd/\" rel=\"nofollow\" target=\"_blank\" title=\"http://sifronb.com/hd/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>sifronb.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Worked on implementing the Polymer framework on our front-end form submission page. ", "", "", ""]], ["FlashCardKitties", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/NzXIH5q74zU?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"FlashCardKitties – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/749/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"FlashCardKitties – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/320/942/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"FlashCardKitties – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/320/943/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"FlashCardKitties – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/320/944/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Learning languages is hard, and it doesn't have to be that way. Spaced Repetition Software (SRS) have made tremendous progress in making learning more efficient, but there's still a lot of work to be done. If Memrise says that you need to water your memories in 14 hours, most people won't actually review them on time.</p>\n<h2>What it does</h2>\n<p>FlashCardKitties is an immersive learning experience. Whenever its learning algorithm detects you're about to forget a memory item, the Pebble Smartwatch it's running on will fire a quick vibration, and present the user with a vocab word and definition. The user then self-evaluates how well he or she knew the answer, and that information is sent to the server at flashcardkitties.com.</p>\n<h2>How I built it</h2>\n<p>I built an WatchApp for the Pebble that functions a lot like a WatchFace. The goal is to be unobtrusive while still providing very useful functionality that will help them learn better. In this case, less it more, as constant alerts and vibrations can get annoying. The UI Elements on the watch are controlled by code written in C. Some JavaScript running on the mobile phone connected to the watch interacts with the C code to provide access to networking. The website allows the user to register with Facebook to add vocab words to their account on FlashCardKittens. The settings section of the Pebble App allows the user to view their vocab words they've stored through the web interface, which uses a PHP backend to store the vocab in a MySql database.</p>\n<h2>Challenges I ran into</h2>\n<p>Pebble documentation is ehh, imho. There were a lot of different aspects of the project to work on, and we were a small team of two.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>I created a functioning web interface to a smartwatch app! That integrated the Facebook API! A lot of technologies came together to make something that is, at the very least, a nice prototype of a much more sophisticated application.  Even though I didn't quite get around to implementing all of the SRS aspects I wanted to, I'm happy with what I was able to get done in the little time I worked on it.</p>\n<h2>What I learned</h2>\n<p>I learned about developing for Pebble Smartwatches and how to set up Amazon Web Services to host a website.</p>\n<h2>What's next for FlashCardKitties</h2>\n<p>Big things. </p>\n<p>FlashCardKitties has a lot of potential. To be specific though (and less dramatic) FlashCardKitties will have persistent login that couldn't quite get ironed out on the Pebble side of things, as well a MUCH better algorithm for scheduling review sessions.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/pebble\">pebble</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c\">c</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mysql\">mysql</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/facebook\">facebook</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://flashcardkitties.com\" rel=\"nofollow\" target=\"_blank\" title=\"http://flashcardkitties.com\">\n<i class=\"ss-icon ss-link\"></i>\n<span>flashcardkitties.com</span>\n</a></li>\n<li><a href=\"https://github.com/cal2u/flash\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/cal2u/flash\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["Change for Change", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>We got the idea from Acorns, an app which invests spare change to help the user save money over time </p>\n<h2>What it does</h2>\n<p>Change for Change rounds up each purchase with a linked credit card to the nearest dollar. This amount will be donated to charity of the user's choice.</p>\n<h2>How I built it</h2>\n<p>We utilized the Plaid API, and the website was created using JavaScript, Jade, HTML, and CSS. </p>\n<h2>Challenges I ran into</h2>\n<p>Learning how to use the Plaid API was initially difficult. It took a significant amount of adjusting before we were able to make use of the bank data. </p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>None of us have experience with JavaScript, Jade, HTML, or CSS. The fact that we were able to learn these and build something cool in the span of 24 hours is a big accomplishment.</p>\n<h2>What I learned</h2>\n<p>We learned many new languages as well as how to develop on the front and back end.</p>\n<h2>What's next for Change for Change</h2>\n<p>Next we plan to connect Change for Change to actual bank accounts and set up the withdrawal process to make donations actually happen. Once we implement this, donating to charities will be much more frequent and convenient for users. With that, Change for Change will make progress towards combating inequality.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jade\">jade</a></span></li><li><span class=\"cp-tag\">javasc</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css3\">css3</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/plaid\">plaid</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/jennfang/Hack-Duke/tree/master/examples\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/jennfang/Hack-Duke/tree/master/examples\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on the backend, setting up the connection between our code and the Plaid API. I also helped clean up the front end and organize the layout of the final table. It was my first time using Jade as a template language for a website, and my first time working with node.js, but I learned a lot from the experience. ", "", ""]], ["ADHDev", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>ADHD diagnosis of children is very subjective; it relies on the perception of parents and teachers to be objective and encompassing. This lack of quantifiability places an even greater burden on doctors, who need to efficiently and confidently determine where a child falls on the ADHD spectrum in order to get them the help they need.</p>\n<h2>What it does</h2>\n<p>By creating a virtual environment where children are given a task and doctors are given the means to control distractions, the child can be directly evaluated by their doctor and, by assigning them a score based on how well they accomplished the task despite the distractions, the result is a value that can be compared to other patients.</p>\n<h2>How I built it</h2>\n<p>We made a classroom environment in Unity and animated 3D models of paper planes and crumpled paper balls that will enter the viewer's field of vision and potentially distract them from counting the letters that appear on the board at the front of the classroom. We used Java to code a program for doctors to input numerical values for how many distractions there were, how many letters the patient recorded correctly, and how many letters they were given. This yields a score that will believe will be significantly different for those who do and do not suffer from ADHD.</p>\n<h2>Challenges I ran into</h2>\n<p>Our group had minimal experience working Unity, so we had initial difficulties, particularly with looping animations, but we eventually this figured out. We also had a bit of trouble user-input animation triggering and the directions our added walls were facing (e.g. inverted, backward-facing; looked pretty funny).</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>We are very proud of learning Unity and setting up the Oculus Rift. It was incredibly exciting to work in virtual reality with such amazing technology.</p>\n<h2>What I learned</h2>\n<p>We learned an entirely new program and developed a finished product that does what we set out to do.</p>\n<h2>What's next for ADHDev</h2>\n<p>We need to test out our Hack with a pool of patients who have been diagnosed with ADHD and those who have not in order to determine base scores and set up a scale to compare. We would like to add more distractions of different types, such as birds flying past the window, a steadily ticking clock, and gradual changes in lighting in addition to our current spontaneous distractions, and we would like to integrate sound.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/oculus-gear-vr\">oculus-gear-vr</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/3ds-max\">3ds-max</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/blender\">blender</a></span></li></ul>\n</div>\n</div>", ["", "", "", ""]], ["VitalTimes", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"VitalTimes – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/318/770/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"VitalTimes – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/754/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Long lines anywhere can be a frustrating experience, but they can be a life-threatening one in the emergency room.  Even with the use of triage, a minority of hospitals meet recommended wait times for admitting patients to their emergency departments and fewer than half of hospitals consistently admit patients within 6 hours.  This is a situation with poor outcomes for everyone.  Patients do not expediently receive treatment and the quality of that treatment drops when hospital staff are inundated with a demand that they cannot meet.  For this very reason many hospitals publish live ER waiting times, but this information is often scattered across many different websites.  In emergencies, inconvenient access to information might as well be no access at all.</p>\n<h2>What it does</h2>\n<p>To solve this problem, we designed VitalTimes, a service that conveniently directs patients to hospitals with the smallest combined wait time and drive time from their current locations.  We also direct patients to urgent care facilities, which can handle lower priority cases that might normally clog up lines at the ER.  This way, patients can quickly and easily identify which facilities to choose without having to look up them up information.  The total time to treatment is conveniently displayed on a side bar right next to the map.</p>\n<h2>How we built it</h2>\n<p>We identified databases with accurate ER and urgent care live waiting times. We then wrote python scripts to scrape these websites and parse the data.  This data was then pushed onto Firebase, which served as our back-end.  We then utilized a variety of Google APIs—including Maps, Places, and Distance Matrix—to build an interactive map that displays hospitals near patients, ranked with a sorting algorithm based on total expected time from their current location to an emergency or urgent care facility.</p>\n<h2>Challenges we ran into</h2>\n<p>The main challenges involved understanding the transition from assignments in the classroom, which often rely on sample data made specifically for the purpose of the homework, to utilizing live, dynamic, data samples often built for a completely different purpose. The challenge is in learning how to best integrate and consolidate all the available resources, varying from new languages and frameworks to novel APIs, that best suit our goal. </p>\n<p>In our case, this specifically involved learning how to use a variety of python libraries to scrape data and integrate this with the Firebase API. We then utilized Google APIs to parse this data and display it in an interactive and easy to understand format for the user. The main challenge was learning how to consolidate these various resources. </p>\n<h2>Accomplishments that we're proud of</h2>\n<p>The first moment when we saw the interactive map populated with actual, live ER waiting data was a very rewarding experience. Being challenged to learn and pick up so many new frameworks and resources helped develop our abilities as not only coders but also as problem solvers. We chose to work within the Health and Wellness track so that we could ensure that our product would make a tangible improvement in people's lives. </p>\n<h2>What we learned</h2>\n<p>We learned how to use Python to scrape websites and use XPath database querying commands to extract key information.  We also learned how to work with a variety of APIs and tie them all together.  Finally, we learned how to divide work and accomplish goals under stress and time constraints.</p>\n<h2>What's next for VitalTimes</h2>\n<p>While what we currently have is a proof of concept, we hope to continue expanding our project.  We will work to accrue more live wait time data from emergency and urgent care facilities in order to ease hospital traffic and improve patient outcomes across the country.  We also recognize that VitalTimes is more effective as part of a larger navigation tool.  We hope to partner with an existing navigation service, allowing VitalTimes to become more convenient for the average person to access and use.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google-maps\">google-maps</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google-places\">google-places</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/firebase\">firebase</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/kbyatnal/ERMaps\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/kbyatnal/ERMaps\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["sCANvenger", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"sCANvenger – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/965/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"sCANvenger – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/705/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"sCANvenger – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/706/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Recycling cans is a huge source of income for many people that displaced or homeless; they might make up to $70 in a single day.  However, looking for cans and can-dense areas can be challenging, especially for some that are more physically disabled, thus making them less efficient.  In addition, upon receiving their payment, many homeless people will spend their money unwisely, not considering a long term plan.</p>\n<h2>What it does</h2>\n<p>To assist our friends, we built sCANvenger that does two things:</p>\n<p>1) It generates predictive models of aluminum can concentrations, depicted as a heatmap.  We can guide users to areas that have the most cans, and with the least amount of pickers.\n2) The ecosystem also automatically deposits into a Capital One bank account, created for pickers using our system for the first time.  Depositing and withdrawing money comes with advice to encourage smart spending.</p>\n<p>We envision our application being primarily used in two locations, respective to the functionalities described above:</p>\n<p>1) By placing a large screen monitor in a homeless shelter, we hope that having a source of information that optimizes their day and income flow will also encourage seeking out shelter as opposed to living on the streets.</p>\n<p>2) We hope to create a partnership with recycling centers, which would have a way to access our recycling center/picker portals, which allow for depositing their income into secure bank accounts as well as providing information about their money flow.</p>\n<h2>How I built it</h2>\n<p>As it is hard to build such a system without adding a lot infrastructure (e.g. smart trash cans) to keep track of number of aluminum cans in different areas, we take advantage of other accessible data sources such as population density, supermarket distributions, and household distributions. With the power of HTML5's geo-location, we are able to locate the device's current geological location. By mining data from heterogeneous data sources and using statistical inferences based on demographic models, we are able to infer the density of aluminum cans over an specific area as well as the amount of money a picker can make in that area per hour.</p>\n<p>We then used Capital One's Nessie API to facilitate bank transactions.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/flask\">flask</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/esri\">esri</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/firebase\">firebase</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bootstrap\">bootstrap</a></span></li></ul>\n</div>\n</div>", ["", "", "", ""]], ["Drink And D-Rive", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>According to the AAA Foundation for Traffic Safety, ONE in FIVE accidents are caused due to drowsy and drunk driving. This is a preventable problem, and we wanted to look for a better way to tackle drowsy driving.</p>\n<h2>What it does</h2>\n<p>A driver, upon entering her/his car, is asked to speak out a few sentences to the Raspberry Pi mounted on the dashboard. The device (with the support from an Arduino) analyzes the input voice, and determines if the driver is fit to drive. If she/he is not fit to drive, the tool dispatches text messages to close family members/friends alerting them of the driver's location, following which they may take action.</p>\n<h2>How we built it</h2>\n<p>Our tool uses the Speech-To-Text IBM Watson Service to generate a JSON representation of the input speaker's voice. We then parse the JSON in Python and analyze the following things:</p>\n<p>a) Time differences between words spoken, and calculate the average of these time differences. If the average is larger than a threshold value, we trigger a flag.</p>\n<p>b) Analyze the time taken to enunciate long words (we use the example word 'encyclopedia') and compare it to the average expected enunciation time.</p>\n<p>c) Analyze the time taken to enunciate certain phonetics (we use the phonetic sound 'ch' in 'chose') based on scientific evidence that certain phonetic sounds take longer time to enunciate when intoxicated.</p>\n<p>d) Analyze the rate of enunciation of the 26 letters of the English Alphabet. The tool returns a warning flag if average time between characters, and the average time enunciating each character is above a specified threshold value.</p>\n<p>All these four tests are based on scientific research conducted on this topic. Based on the collective weight of the four tests, we provide a confidence value of the level of drunkenness on a scale of 0 to 1.</p>\n<h2>Challenges we ran into</h2>\n<p>It was difficult to pinpoint the specific nuances in speech we had to look out for. It took us a good deal of reading to come up with a (non exhaustive, as of now) list of aberrations in speech patterns.</p>\n<h2>Accomplishments that we are proud of</h2>\n<p>This is our first hackathon, and we're very excited to turn in a project for the expo. We were very happy to see that our tool generates almost-accurate responses for the drunkenness tests!</p>\n<h2>What we learned</h2>\n<p>We learnt a lot about designing IoT based technologies in general, and also the ability to easily use the Watson API to our advantage. We also learnt that working with Edison boards suck! (Unless you're lucky and you get a non-faulty board!)</p>\n<h2>What's next for Drink And D-Rive</h2>\n<p>We will definitely attempt to complete the entire hardware aspect of the project - as well as add additional features to the detection algorithm, such as reaction-time analysis, tone analysis and possibly some visual detection as well. <em>The reason we did not want to initially incorporate visual cues to the tool was in order to keep the cost of the device relatively affordable, and as non-intrusive as possible.</em></p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ibm-watson\">ibm-watson</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/raspberry-pi\">raspberry-pi</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/arduino\">arduino</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/adityavishwanath/DrinkAndD-Rive\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/adityavishwanath/DrinkAndD-Rive\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["Give A Yeet", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Give A Yeet – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/318/844/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>HackDuke is all about coding for good, and their prizes are donations to a charity of the winners' choice. This got us thinking about how a lot of people want to donate to charities or find a way to help others, but they just feel like it's more work than it is worth. That is when we thought of Give A Yeet.</p>\n<h2>What it does</h2>\n<p>How great would it be if, every time you purchase an item, a little bit of that purchase gets donated to a charity of your choice. With such little effort, people now have the opportunity to contribute to the causes that they care about.</p>\n<h2>How we built it</h2>\n<p>We built this website mainly using AWS, express.js, and html. We started by setting up express on AWS, and then divided the work into front-end and back-end tasks based on our team's previous experience.</p>\n<h2>Challenges we ran into</h2>\n<p>Some teammates were not as familiar with the technologies we were using, so catching them up to speed while building the app was a little stressful at times.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We all learned something new and designed an app that can help both charities and people achieve their goals of generosity.</p>\n<h2>What we learned</h2>\n<p>We learned a lot about middleware and how much of a struggle it can be. We also learned how to make the most out of bootstrap without looking like just another bootstrap site.</p>\n<h2>What's next for Give A Yeet</h2>\n<p>Give out more yeets. YYYAAAAASSSSSS!!!</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/express-js\">express.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/socket-io\">socket.io</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css3\">css3</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jade\">jade</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://www.giveayeet.org/\" rel=\"nofollow\" target=\"_blank\" title=\"http://www.giveayeet.org/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>www.giveayeet.org</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", "", "", ""]], ["Latte°tude", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Latte°tude – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/820/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Latte°tude – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/822/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Latte°tude – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/823/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>We wanted to solve the problem people have when it comes to meeting new people and chatting in a casual setting.</p>\n<h2>What it does</h2>\n<p>Latte°tude matches you up with another user based on age, distance, gender, and other personal preferences. Once you're matched we'll set you two up with a date and time to meet at a local coffee shop to chit chat and brew up a conversation!</p>\n<h2>How I built it</h2>\n<p>Using html and css</p>\n<h2>Challenges I ran into</h2>\n<p>Our team had challenges creating the backend of this project</p>\n<h2>Accomplishments that I'm proud of</h2>\n<h2>What I learned</h2>\n<p>How to build the front-end of a website from a blank page.</p>\n<h2>What's next for Latte°tude</h2>\n<p>Lots of work. It's a work in progress....clearly</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li></ul>\n</div>\n</div>", ["", "", ""]], ["QuickFill", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/O4Jkm9jLVQA?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>We all have had our share of hospital visits or visits to the doctor. Every time we visit one, there is a requirement of filling out all the details , basic repetitive details like name, date of birth, blood group and emergency contact etc. So we were inspired to create an application which would help the patients and not require them to fill these details every time. This would be particularly helpful for patients coming to the emergency room.</p>\n<h2>What it does</h2>\n<p>So the patients and the doctors both are registered to the app. Whenever the patient visits the hospital or the doctor, the doctor or the hospital just sends a push notification to the patient with the message \"send details\". When the patient registers for the app, he/she can fill in the information which gets saved in the phone as a json file. So when the patient receives the notification from the doctor, the patient sends the message back with all the information from the json file as a Json string and the doctor has an interface which automatically gets filled by all the information received from the patient. This ensures easy autofill of information and no wastage of time for the patients or the doctor</p>\n<h2>How I built it</h2>\n<p>We used Google Cloud Messaging with Android to accomplish the task of interaction between the doctor or the hospital and the patients. We also used json as the data format , so the data passed from the patient is passed as a json object and we parse this data at the doctor's end to extract the necessary field information.</p>\n<h2>Challenges I ran into</h2>\n<p>Integrating Google Cloud Messaging with Android. It requires configuration, consistent wifi connection since we are hosting it on a local server for the demo.Running a local server like Tomcat and interpreting what messages are being exchanged in between the patient and the doctor.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Successfully integrating the Google Cloud messaging with Android app. This avoids the need for the patient and the doctor to be in close proximity and avoids the use of bluetooth or any other such methods of interaction which requires proximity. Successfully building the prototype of the main application which accomplishes the main concept and the functionality with certain limitations.</p>\n<h2>What I learned</h2>\n<p>Our Group consisted of variety of people with little to some knowledge of Android. We successfully learnt how to build an android application from scratch to integrating google apis like google cloud messaging with Android. Also learnt a good deal about Json parsing.</p>\n<h2>What's next for QuickFill</h2>\n<p>The QuickFill is a quickfill app which can be not only used in the medical field , but can be enhanced to be used in any field which requires immediate communication between any two parties and requires automatic filling of information</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google-cloud-messaging\">google-cloud-messaging</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/json\">json</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/tomcat\">tomcat</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\" https://github.com/prashantgupta24/HackDuke_WebServer\" rel=\"nofollow\" target=\"_blank\" title=\" https://github.com/prashantgupta24/HackDuke_WebServer\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"    https://github.com/prashantgupta24/HackDuke_QuickFillApp\" rel=\"nofollow\" target=\"_blank\" title=\"    https://github.com/prashantgupta24/HackDuke_QuickFillApp\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"https://github.com/djain2405/HackDuke_Client\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/djain2405/HackDuke_Client\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["TroubleTimer", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Beginner's story: Coming to Hack Duke, I really didn't have any experience coding. So, this project is simply a walkthrough project that an instructor here at Hack Duke walked us through that uses google api in our web page. </p>\n<h2>What it does</h2>\n<p>It's an alert timer where if a person is in danger, they could type in a phone number and start a timer, </p>\n<h2>How I built it</h2>\n<p>By using visual studio code, we created three files: a css, html, and javascript file</p>\n<h2>Challenges I ran into</h2>\n<p>Getting used to the syntax was quite an obstacle. Over the seven hours we worked on this, I began to understand javascript and my fascination grew. </p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>I'm glad that I came to Hack Duke and learned a new skill set. Now, I have a lot of ideas that I want to create. For example, I want to create a web app that utilizes the google and twitter api to create a live stream hotspot map for natural disasters all around the world. </p>\n<h2>What I learned</h2>\n<p>I learned to code in javascript and some other languages as well.</p>\n<h2>What's next for TroubleTimer</h2>\n<p>I'll probably not further my TroubleTimer project, but I have other projects/ventures that I would like to  </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://jmadison145.github.io\" rel=\"nofollow\" target=\"_blank\" title=\"http://jmadison145.github.io\">\n<i class=\"ss-icon ss-link\"></i>\n<span>jmadison145.github.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["LeapAhead", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>The Education and Inequality tracks inspired us to create something fun/cool that was inclusive and educational for all types of children. Upon doing some research, we learned that those with intellectual disabilities learn best by breaking down tasks into small steps, performing hands-on tasks, by being in environments where visual aids are used, and by being provided direct and immediate feedback. These teaching methods gave us the idea for the super interactive game- \"LeapAhead\".</p>\n<h2>What it does</h2>\n<p>Our app allows parents to sit down with their kids and help them with simple problems. The parent will read aloud the question and the child will point, using the Leap Motion sensor, to which ever answer he/she thinks is correct. If the child answers correctly, the parent will click the next button and go to the next question.</p>\n<p>We take the hand coordinates provided by the Leap Motion tracker and constantly stream it to the front end in order to map the hand to a general position on the screen.</p>\n<h2>How I built it</h2>\n<p>We sued AngularJS to create a front end web app that connected to the Leap Motion sensor. We used the Leap Motion JS plugins in order to stream the live position data tot he front end side of the app. We then took that data and made events based off of where the user's hand most recent position.</p>\n<h2>Challenges I ran into</h2>\n<p>The backend sub team dealt with challenges involving the Leap Motion sensor. The open source code had a few errors such as providing the wrong number of detected fingers (we were initially planning to have the child user point) and did not have the most precise sensing. Due to this, we decided to have the user move their hand in the general direction of the correct answer as it calls for less precision. The backend team also had difficulty connecting to a server to stream the X and Y coordinates of the hand to the front end team via WebSocket so we went about that in a different way. Initially, we wanted to have the child hover their hand in a particular spot for x amount of time (and then provide a visual sticker congratulating the child for selecting the right answer), but due to time constraints we simplified that function.</p>\n<p>The fronted team had some trouble finding the appropriate framework and understanding data binding under the hood.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>how we worked so well under pressure with stuff we hadn't ever really used before and still managed to realize our vision. We were even trying to set up Oculus at one point but maybe that was too ambitious.</p>\n<h2>What I learned</h2>\n<p>Firebase, connecting backend to frontend, new technologies on the spot</p>\n<h2>What's next for Leap Ahead</h2>\n<p>We would allow the child to select the correct answer using the Leap Motion sensor. Right now, the parent must click the next button to go onto the next question. Also if a child is selecting the wrong answer continuously we could give them a hint to the right answer.r We could also provide characters that the children are more familiar with. For example if we asked a question about colors and one selection was the color yellow, we could use Spongebob as the answer choice instead of a plain yellow block. This allows children to map familiarity with new concepts. We could develop a reward/achievement system that would allow the children to see their progress. Adding profiles for children could create a more personalized experience for them as well- perhaps even adding a personalized greeting and encouraging phrases/quotes.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/angular-js\">angular.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/leap-motion\">leap-motion</a></span></li><li><span class=\"cp-tag\">pure.css</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/firebase\">firebase</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/github\">github</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/travis-ci\">travis-ci</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/nagadeepakc/LeapAhead.git\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/nagadeepakc/LeapAhead.git\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked with the front end by implementing an AngularJS application that communicated with Firebase on the backend.", "", "", ""]], ["Flow", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Flow – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/511/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Flow – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/521/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Flow – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/522/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Flow – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/538/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>We realized as college students that half the battle during our education is learning how to use our timely. While the internet has been great with helping us find all the knowledge we need to learn a subject, it's also filled with distractions that keep us from actually utilizing that knowledge. This is why we created an extension that holds us accountable for our procrastination.</p>\n<h2>What it does</h2>\n<p>Before starting a homework assignment (a research paper about volcanoes for example), we'd click on the Flow icon in Chrome, type in the research topic we have to work on (volcanoes), and then click Start Flow. From this point on, the extension runs a acquires synonymous words and relevant topics for \"volcanoes\" and comparing the words with the ones found on all the webpages visited from the time we Start Flow to the time we click End Flow. If the percentage of words found on the page that are equal to the words acquired from our topic is low, it means we are not on a productive part of the web and we are notified to get back on track.The comparison between the words and the time spent gives us a data visualization of our productivity over the period of time we were on the web. </p>\n<h2>How I built it</h2>\n<p>We used Google's Chrome extension documentation in javascript for the back end. The front end uses html, css, and javascript.</p>\n<h2>Challenges I ran into</h2>\n<p>It was challenging trying to get the Flow extension to continue comparing words when a new tab opens so that one wouldn't have to restart the extension any time a new url was visited.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>This was our first time doing a web application like this and building a Chrome extension. It went so well, that it encourages us to make other Chrome extensions to tailor our web browsing needs.</p>\n<h2>What I learned</h2>\n<p>Lots of javascript. </p>\n<h2>What's next for Flow</h2>\n<p>With what can be gathered in this extension,  we can begin to implement a series of rewards for good productivity and penalties for poor productivity.  If productivity reaches a certain low point,  it will notify you locally reminding you to get back on task.  We have begun looking into implementing monetary incentives.  For example,  if it is linked to your bank account,  once your productivity has been low for too long,  a dollar will be transferred from your account into a charity. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css3\">css3</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/Flow2015\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/Flow2015\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"https://github.com/Flow2015\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/Flow2015\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["front end (html, css, javascript)\ngraphic design (photoshop)\nData visualization", "", "", ""]], ["Tango Vision", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/y9hCZKVPpgQ?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"Tango Vision – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/732/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<pre class=\"language-nolang\"><code>  20.6 million Americans 18 and older reported vision loss.\n  Vision problems are among the top 10 disabilities as reported by the American Foundation for the Blind.\n\n Worldwide, the World Health Organization estimate 285 million people are visually impaired.\n\n  Think about the family or friends close to you with visual impairment. We want to keep them out of danger while avoiding drawing attention to their disability. \n</code></pre>\n<h2>What it does</h2>\n<pre class=\"language-nolang\"><code>Google Tango knows where it is and how it is moving through space. \nTango Vision guides users past close objects within 1.5 meters with turning, warning and vibration cues.\n</code></pre>\n<h2>How I built it</h2>\n<pre class=\"language-nolang\"><code>   We explored the Tango API and its libraries and utilized them in conjunction with Android Studio to create the app.\n</code></pre>\n<h2>Challenges We ran into</h2>\n<pre class=\"language-nolang\"><code>   Memory issues where the Tango was storing data locally and had to be restarted every ~20 debug cycles.     \n\n   Instabilities in the API and Tango device: https://developers.google.com/project-tango/apis/known-issues?hl=en \n</code></pre>\n<h2>Accomplishments</h2>\n<pre class=\"language-nolang\"><code> We wished to use Project Tango by Google to address a social need. We implemented an app to help the visually impaired to navigate buildings and avoid obstacles implementing haptic and audio feedback.\n</code></pre>\n<h2>What I learned</h2>\n<h2>What's next for Tango Vision</h2>\n<pre class=\"language-nolang\"><code>During the Hackathon we got to work with the tablet, but we would like to use the phone armband with the smaller phone sensing device to make Tango Vision more portable.\n\nTango Vision would expand to the many environmental factors as \"Self-Driving People\" to take human error out of the equation. \n</code></pre>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/project-tango\">project-tango</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li></ul>\n</div>\n</div>", ["", "", "", ""]], ["Tiny", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>We had a discussion at about 4pm today, 4 hours into the competition about an idea, we were stumped on how our ideas could relate to the 4  fields and how we could make a difference. We wanted to do something simple so we could build from there, we also wanted as many people using this system in an easy way.  We decided on recycling. It fits our criteria of, </p>\n<p>recycling is a day to day thing a person could do.\nbenefits potential sponsors with word of mouth and their efforts in going green\nnot so difficult a reguler person would not do it, but rewarding enough to keep them going</p>\n<h2>What it does</h2>\n<p>Well, granted our version control problems get fixed, the app will allow users to access Google Maps to pinpoint recycling bins on campus where they can recycle aluminum cans or plastic bottles. and follow a path based on their nearest resource center.</p>\n<p>But why would a regular person do that, because in partnership with sponsors, the student could rack up points for recycling. The points would be kept in a parse server where the student can redeem points based on how often they recycle. </p>\n<p>If the student were to be near sponsored company, a Notification would be sent alerting them and they can use their points redeeming gifts</p>\n<h2>How We built it</h2>\n<p>We each focused on a task, myself configuring google maps, Jack using parse to create and login to their account and Jorge with material design</p>\n<h2>Challenges I ran into</h2>\n<p>Well, were still not done with the project, i can only ask that maybe delay our github for about 30 minutes to resolve the issue. The version control is what we spent the bulk of time on</p>\n<h2>Accomplishments that I'm proud of</h2>\n<h2>What I learned</h2>\n<h2>What's next for Tiny</h2>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google-maps\">google-maps</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/parse\">parse</a></span></li></ul>\n</div>\n</div>", ["", ""]], ["LifeRaft", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h1>LifeRaft</h1>\n<p>HackDuke Fall 2015</p>\n<p>LifeRaft is the ultimate tool for ensuring that you and your friends always feel safe at night. By seamlessly integrating location services for keeping up with your friends, status updates to check in on them, and rides by Uber so that you can always get home safe, LifeRaft will make sure that you and your friends will never float adrift. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/sam-ginsburg/LifeRaft\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/sam-ginsburg/LifeRaft\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["Bintector", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>My friend has a habit of never recycling because he can't find a recycling bin nearby.</p>\n<h2>What it does</h2>\n<p>Our app uses google maps and crowdsourcing to gather information of where public recycling bins are.</p>\n<h2>How I built it</h2>\n<p>We built it in Android Studios, half of our team working on the front-end and the other working on the back-end. We used the google maps api for the graphical components and used DynamoDB for the back end (current github only has a proof of concept, so we left the server stuff out).</p>\n<h2>Challenges I ran into</h2>\n<p>DynamoDB has some weird problems with authentication, not allowing users to send locations. Github was added to our project despite us not adding it, causing issues with saving progress. </p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>The website for the project actually looks good, and we learned a lot about material design and nosql servers. </p>\n<h2>What I learned</h2>\n<p>Servers are head to deal with, and security is paramount. There are a surprising amount of free services, but no good free web hosting services from non sketch companies. </p>\n<h2>What's next for Bintector</h2>\n<p>We will add trash functionality, allowing for users to mark the location of trash cans as well. We will also fix authentication issues with DynamoDB, allowing us to use an off device database. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xml\">xml</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google-maps\">google-maps</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/obliviour/bintector\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/obliviour/bintector\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["Laser Cat", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<h2>What it does</h2>\n<h2>How I built it</h2>\n<h2>Challenges I ran into</h2>\n<h2>Accomplishments that I'm proud of</h2>\n<h2>What I learned</h2>\n<h2>What's next for Laser Cat</h2>\n<p>A makeover</p>\n<p>USES LEAP MOTION</p>\n<p>no directions.</p>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://pastebin.com/MkTwfYUA\" rel=\"nofollow\" target=\"_blank\" title=\"http://pastebin.com/MkTwfYUA\">\n<i class=\"ss-icon ss-link\"></i>\n<span>pastebin.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["eyeCane", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>We thought blind people needed a better cane. We decided to improve the cane with a smartphone and a bit of sound.</p>\n<h2>What it does</h2>\n<p>Guides bind people.</p>\n<h2>How we built it</h2>\n<h2>Challenges we ran into</h2>\n<p>Many technological challenges and figuring out APIs</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Finishing the project</p>\n<h2>What we learned</h2>\n<p>Various APIs and html video streaming. </p>\n<h2>What's next for eyeCane</h2>\n<p>Helping the World!</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bluemix\">bluemix</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google--2\">google</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/alchemyapi\">alchemyapi</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li><li><span class=\"cp-tag\">webtrc</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/parse\">parse</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/DmitryPustovit/eyecane\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/DmitryPustovit/eyecane\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["Cast My Vote", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Code for good! We wanted to increase voter participation and registration.</p>\n<h2>What it does</h2>\n<p>Allows the user register to vote by scanning their driver's license.</p>\n<h2>How I built it</h2>\n<p>We used BlinkID sdk to use the scanning aspect. Once information has been pulled from the license, we send the information to Rock the Vote API to generate a pdf that has been filled out with the user information.</p>\n<h2>Challenges I ran into</h2>\n<p>Working with Rock the Vote API's poor documentation. We had trouble getting the information from the BlinkID scanner.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Ambitious idea that could make an impact on the election. </p>\n<h2>What I learned</h2>\n<p>Learned more about HTTP requests and JSON objects. </p>\n<h2>What's next for Cast My Vote</h2>\n<p>Get more functionality. Improve UI/UX.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google-geocoding\">google-geocoding</a></span></li><li><span class=\"cp-tag\">rock-the-vote-api</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag\">blinkid-sdk</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/phantompunk/BlinkIDDemo.git\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/phantompunk/BlinkIDDemo.git\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", "", ""]], ["WhoNews", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"WhoNews – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/739/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration - social media such as yik yak, twitter, and instagram are very absorbing outlets that people are looking to be distracted. The process of checking up on these apps seem so automated today. We felt it was about time to add some more value to trendy social media, an outlet for people to vent, share, and learn about the news going around their community on a local and global level. This also solves the problem of many people not being able to plow through thickly worded news articles created by professionals, it makes news accessible and effortless.</h2>\n<h2>What it does - Allows people to submit a summary or opinion of an arbitrary news event of choice. You do not need an account, but you do need to submit the post with a name. There is a limit in order to keep jargon out and to facilitate understanding for the largest audience possible. There is an option to up vote, down vote, mark as spam, and automatic filter taking out posts that are excessively vulgar.</h2>\n<h2>How I built it- We built it using firebase, django, html, css, and javascript.</h2>\n<h2>Challenges I ran into - small things such as integrating seamlessly was difficult and took a lot of time. Two of the three team members are fairly novice so they had to learn as they went along.</h2>\n<h2>Accomplishments that I'm proud of - two of the team members developed a fair bit of javascript, languages neither of them had much experience with. Using firebase to change the prioritize the posts by rating. Dynamically setting up the css for the posts to make the page flow.</h2>\n<h2>What I learned - how to use firebase, two of us learned quite a bit of javascript and how to use github. It was very interesting to become accustomed to fast deployment with firebase based especially compared to traditional deployment method through amazon web services, for example. In addition, it was interesting to look into how coding can help motivate and shift society toward certain goals.</h2>\n<h2>What's next for WhoNews - we really want to make staying up to date with news a prevalent thing in our society. We would like to add local, nation, world features, where people could look at different news from different places. In addition, we would like to incorporate textual analysis software to automatically detect extremely malicious, racist, and/or posts with harmful intentions. Possibly even include something similar to yakarma to motivate people to not be rude and to want to improve the WhoNews community.</h2>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/django\">django</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/lli5ba/WhoNews.git\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/lli5ba/WhoNews.git\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["Grid-Independent ATMs - Banking for all", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Grid-Independent ATMs - Banking for all – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/738/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Infrastructural overheads prevent widespread ATMs in developing countries. It is common for someone to travel 20miles to a nearby bank or third-party depositor. Given this, we sought to create a grid-independent ATM (giATM) that allows one to deposit his income and enjoy a full range of mobile banking services. </p>\n<h2>How is it different from current ATMs?</h2>\n<p>ATMs of today often require extensive land lines and high speed VPNs, which are not available in some parts of developing countries. </p>\n<h2>What it does/How it works</h2>\n<p>Consumer deposits money and inserts identifying token into giATM. The giATM has a simple currency counter similar to those in vending machine. The token provides an Unique User ID (UUID), a token ID and an encryption key. The giATM also generates a timestamp at time of transaction. The giATM uses the encryption key to display a pseudorandom string with all the other information to the customer. The customer will text the pseudorandom bit to the bank via SMS. The bank server upon receiving the pseudorandom bit will use the corresponding decryption key (based on the token ID) to decrypt the message. The bank will issue the respective amount into savings account of consumer.</p>\n<h2>What's next for giATM - Banking for all</h2>\n<p>This can be scaled up easily given its low costs. Our goal is to provide a low-cost and robust device for banks to utilise and expand their presence in developing countries. We also recognise the use of grid-independent technology and this could be extended to provide an array of other services.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/raspberry-pi\">raspberry-pi</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://still-scrubland-1100.herokuapp.com/\" rel=\"nofollow\" target=\"_blank\" title=\"http://still-scrubland-1100.herokuapp.com/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>still-scrubland-1100.herokuapp.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["Feline Fix", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Feline Fix – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/786/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>The point is to show the off our team's ability to stick together and deliver in the midst of adversity! Our goal was to ideate, plan, create, and execute!</p>\n<p>Web app that shows a cute or curious feline depending on how the user feels.</p>\n<p>HTML Template, Javascript, CSS</p>\n<p>Wow, so many challenges. From attaching functions to buttons or elements to understanding how each type of language works.</p>\n<p>Actually creating something tangible ! And working through so many problems that involved solutions like down scaling the project to so we can understand the basics in terms of functions and front end.</p>\n<p>Watch out food lovers, dog lovers, and lovers of cheerful randomness... we're coming for you!</p>\n<p>S/o to HackKitty!</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/bromontana/Feline_Fix-2015-11-08/commit/71eae10280260cf6bfee6df0bcd82051352ab6c6\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/bromontana/Feline_Fix-2015-11-08/commit/71eae10280260cf6bfee6df0bcd82051352ab6c6\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["Tapiness", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Have you ever wanted to know and go to a location where happiness is in the air? Tapiness allows you to find that! </p>\n<h2>What it does</h2>\n<p>Tapiness allows you to share wherever and wherever you see happiness.Others will be able to see nearby pockets of happiness and join in.</p>\n<h2>How I built it</h2>\n<p>We used Swift</p>\n<h2>Challenges I ran into</h2>\n<p>We did not know iOS programming and Swift</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>This is our first Swift application that we learned together and from scratch!</p>\n<h2>What I learned</h2>\n<p>Swift and iOS programming</p>\n<h2>What's next for Tapiness</h2>\n<p>Happiness is in the air, come breath it!</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/hahalima/Tapiness\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/hahalima/Tapiness\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["Medicino", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>A friend of ours has a mother who has a prescription in Costa Rica.  During one of her visits in the US, she forgot her medicine back at home.  When in the US, she struggled to find an equivalent version of her prescription.  This friend told us her story when we asked for project ideas.  For the past 24 hours, we have made it a personal goal to help others in her situation.   </p>\n<h2>What it does</h2>\n<p>Medicino takes in a brand/generic name of a drug and gives you numerous alternatives along with similar drugs</p>\n<h2>How I built it</h2>\n<p>Using Eclipse, we built our own custom data base which could store all necessary data.  From there, we adapted this for Android so smartphone users have access to our solution. </p>\n<h2>Challenges I ran into</h2>\n<p>We had issues with converting our app to android and issues with scanning our data.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>This is our first hackathon and the very fact that we built a product is mind blowing.  We are proud of each other, but more importantly, we are proud of what our app can do.</p>\n<h2>What I learned</h2>\n<p>We learned how to translate ideas to practical code, how to work with android, how to maximize caffeine intake</p>\n<h2>What's next for Medicino</h2>\n<p>We hope to add IOS support, cost analysis, language support, location-specific databases, etc.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/alexBoldt95/Medicino\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/alexBoldt95/Medicino\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Worked on some of the back end.  Primarily spent time on data analysis.", "I coded most of the back end and supported front end development", "Did some back-end, mostly front-end, and some design.", ""]], ["WheeShare", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"WheeShare – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/669/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"WheeShare – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/668/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"WheeShare – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/670/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"WheeShare – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/666/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Last year, one teammate was teaching as a volunteer in Ol Pejeta, Kenya. He clearly remembered how every school there hoped for a basic computer lab that school could use to teach the students more about the world. Such goal already existed for quite a few years and none of the schools there was unable to find any used computers. However, our teammate knows that several firms from Jinan, China, his hometown, have a great amount of out-dated computers. From then on, these firms have been donating computers for the schools in Ol Pejeta. Yet there are countless amount of such goods, not limited to computers, that mean nothing in the developed regions but could change the lifestyles of people living in underdeveloped regions. Thus, we decided to build a universal and global platform, WheeShare, to serve as the link between the willing donors and the people in need.</p>\n<h2>What it does</h2>\n<p>Those with unwanted items can go to our website or app and set them for donation. Those who need certain kind of items can use the platform to search for such items.</p>\n<h2>How I built it</h2>\n<p>Using XCode, we built an app and a website that implement our idea. When we encountered technical problems, we searched online resources including Google, StackOverflow and Apple Developer Doc, and tried to alter the solutions of other problems into our solutions.</p>\n<h2>Challenges I ran into</h2>\n<p>App:\nAdaptation to different phone screen sizes.\nAdding photo in the app.\nConnecting the app with online data holder - Parse.\nSaving and retrieving images online.\nAdding the mailing and calling functions with one click.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>App:\nSolved all the challenges required to build such a platform.\nThe app is able to provide information to everyone, anywhere.</p>\n<h2>What I learned</h2>\n<p>App:\nFunctions that must be overriden in certain Swift classes.\nCalling other apps inside the app.\nImplementation of UITableViewController.\nSaving and retrieving data online.\nUsing static cells in tableview.</p>\n<h2>What's next for WheeShare</h2>\n<p>Adding search options and location function in iNeed to let people choose charity items near them.\nUsing AutoLayout of XCode to provide a better view on all devices.\nPublishing the app to actually benefit everyone.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/sql\">sql</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/parse\">parse</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://github.com/billhanyu/wheeshare\" rel=\"nofollow\" target=\"_blank\" title=\"http://github.com/billhanyu/wheeshare\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"http://needgive.weebly.com/store/c1/Featured_Products.html\" rel=\"nofollow\" target=\"_blank\" title=\"http://needgive.weebly.com/store/c1/Featured_Products.html\">\n<i class=\"ss-icon ss-link\"></i>\n<span>needgive.weebly.com</span>\n</a></li>\n<li><a href=\"https://sites.google.com/site/wheeshare/\" rel=\"nofollow\" target=\"_blank\" title=\"https://sites.google.com/site/wheeshare/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>sites.google.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I once volunteered in Kenya as a teacher and thought of the significance of such a platform. In HackDuke, I worked on the weebly web project.", "I worked on the webpage and designed the iOS app icon. I worked with others in the brainstorming stage.", "As the team's iOS developer, developed the app.", ""]], ["Motorcycle Companion", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<pre class=\"language-nolang\"><code>fun lights for boring bedroom, a companion app for when you're out and about riding, and a fuel gauge that doesn't touch your gas tank :D\n</code></pre>\n<h2>What it does</h2>\n<p>the led's light up in sync with the music, the app displays educational information, as well as provide a health aspect as it shows nearby medical facilities in case of need, and the fuel gauge does what a fuel gauge is supposed to do: tell you how much fuel you've got left.</p>\n<h2>How I built it</h2>\n<pre class=\"language-nolang\"><code> connected wires to arduino and breadboard, coded the software to respond to the change in pitch from the music, programmed the arduinos to work with all the extra modules, and wrote an android app with Android Studio.\n</code></pre>\n<h2>Challenges I ran into</h2>\n<pre class=\"language-nolang\"><code>How do I say this in layman's terms... It was a nightmare... But LEDs are pretty :D so it's all good.\n</code></pre>\n<h2>Accomplishments that I'm proud of</h2>\n<pre class=\"language-nolang\"><code>  it works.\n</code></pre>\n<h2>What I learned</h2>\n<pre class=\"language-nolang\"><code> Arduino, android dev, and basics of Java.\n</code></pre>\n<h2>What's next for Light Show</h2>\n<pre class=\"language-nolang\"><code> add more lights, party it up :D\n</code></pre>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/arduino\">arduino</a></span></li><li><span class=\"cp-tag\">breadboard</span></li><li><span class=\"cp-tag\">leds</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/penguinologist/MotorcycleCompanion\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/penguinologist/MotorcycleCompanion\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["BrickIt", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"BrickIt – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/439/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>There are many issues affecting universities and their students. We wanted to build a platform that lets students share their issues so that both the university and student body can find solutions for them. Most times, the university doesn't quite understand which issues the students care about most. BrickIt lets everyone know which issues are most prevalent.</p>\n<p>\"Raise Awareness, brick-by-brick.\"</p>\n<h2>What it does</h2>\n<p>When you post an issue, it becomes a stack of bricks. Instead of \"upvotes\", we built a button that adds bricks onto a stack whenever you agree with an issue. Both the university and students have a login, but only the university can \"cement\" an issue - meaning that the school has taken initiative on the issue and wants to solve it. When posting an issue, students can type in a brief description and choose a category (Transportation, Social, etc.) that is most relevant to the issue.</p>\n<h2>How we built it</h2>\n<p>We used JavaScript, Node.JS, Jade, Parse, JQuery, and Bootstrap to build the platform.</p>\n<h2>Challenges we ran into</h2>\n<p>The brick stacking was more difficult than we wanted it to be.</p>\n<h2>What's next for BrickIt - ....</h2>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jade\">jade</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bootstrap\">bootstrap</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/parse\">parse</a></span></li></ul>\n</div>\n</div>", ["", "", "", "", ""]], ["How Eco-Friendly are You?", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h1>HackDuke</h1>\n<p>First Hackathon!!!</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mit-app-inventor\">mit-app-inventor</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/liuzjmike/HackDuke\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/liuzjmike/HackDuke\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["AgingWithEcho", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"AgingWithEcho – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/548/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>We wanted to eliminate the need to wear a lanyard around your home and find a consistent, easy way to confirm a patient's well-being without external assistance.</p>\n<h2>What it does</h2>\n<p>Uses the Amazon Echo to test patients for symptoms of dementia (by asking test questions based off Alzheimer's Association information) and alerts the patient's primary contact if the patient should consult a doctor.</p>\n<p>Offers emergency services that call the patient's primary contact, can call 911, and walk patients through procedures to take in the instance of an emergency.</p>\n<h2>How I built it</h2>\n<p>Using Amazon's AWS API, Lambda Instance, Java, Twilio, Maven, DynamoDB, Launched and an Amazon Echo.</p>\n<h2>Challenges I ran into</h2>\n<p>Getting Maven to work with Echo and Twilio, getting the DynamoDB database to store and use data correctly, getting a domain name (that never worked)</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>This is one of our team member's first hackathons, learning Launched, getting Twilio's API to work, rick rolling our friend using Echo</p>\n<h2>What I learned</h2>\n<p>We learned a lot about using git (a couple people hadn't used it before), Amazon Echo's Speechlet and Response Manager, Amazon Echo's Intent Schema and Sample Utterances format, Twilio's API and prank calling capabilities, and noSQL databases.</p>\n<h2>What's next for AgingWithEcho</h2>\n<p>Giving it more walkthrough tutorials, more quizzes, and expanding upon the suite of services for aging in place we started this weekend.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/maven\">maven</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/amazon-web-services\">amazon-web-services</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/amazon-alexa\">amazon-alexa</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/amazon-dynamodb\">amazon-dynamodb</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/twilio\">twilio</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/Nyle/trebek\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/Nyle/trebek\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"https://github.com/LouisMichael/EchoEmergency\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/LouisMichael/EchoEmergency\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on the SMS push notifications to remind dementia patients to take their tests at a certain time each day", "I wrote the dementia quiz questions and helped with their implementation.", "I helped to write the structure and implementation for the dementia quizzes.", "", ""]], ["Computer Science for Beginners", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>We wanted to make something for kids.</p>\n<h2>What it does</h2>\n<p>Teach kids some basics of computer science</p>\n<h2>How I built it</h2>\n<p>HTML5, CSS, Javascript on cloud 9</p>\n<h2>Challenges I ran into</h2>\n<p>Javascript stuff too tough.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>We made some javascript.</p>\n<h2>What I learned</h2>\n<p>Javascript. CSS.</p>\n<h2>What's next for Basic Computer Science for Kids</h2>\n<p>More levels.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://learn-basic-cs-victorcui96.c9users.io/\" rel=\"nofollow\" target=\"_blank\" title=\"https://learn-basic-cs-victorcui96.c9users.io/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>learn-basic-cs-victorcui96.c9users.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on HTML + CSS, and created the Javascript files. I ran into a bit of trouble with Javascript—could make the game deeper and insert more levels", "I helped with designing css and working on alternative solutions.", "I worked on HTML and also tried to find a different approach to solve our Javascript issues. Contributed to design of the front page.", "I worked on HTML and CSS more on the layout of the page and fonts. Learned a good amount of Javascript thanks to Victor.", ""]], ["", "", ""], ["", "", ""], ["Share the Gains", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Share the Gains – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/762/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Share the Gains – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/641/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Share the Gains – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/638/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Share the Gains – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/640/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Share the Gains – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/642/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Share the Gains – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/789/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Share the Gains – screenshot 7\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/643/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Share the Gains – screenshot 8\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/850/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>At the beginning of the hackathon we were throwing around ideas, but we found ourselves gravitating towards ideas revolving around health and promoting charity. For health, we considered problems ranging from ER wait time to health issue awareness to mental health monitoring. For promoting charity, we were thinking about sites like change.org, kickstarter, freerice.com, and Tab for a Cause and what made them successful. We started focusing on ways to make charity accessible, community-oriented, fun, and low-commitment.</p>\n<p>Drawing from both lines of thought, we came up with Share the Gains, a web-app for promoting an active lifestyle while raising money for charities.</p>\n<h2>What it does</h2>\n<p>Often times, family members or friends might create fitness goals for each other and agree on a reward for achieving the fitness goal (e.g. if we eat healthier and stick with going to the gym for a month, we'll go on a weekend vacation or splurge on a new pair of shoes). Coworker, churches, and other communities also often have weight loss competitions where the person who loses the most weight in one month receives a gift card.</p>\n<p>Share the Gains takes this idea of friends and family incentivizing fitness for each other and applies it to promoting charities. Share the Gains allows anyone with a Facebook account to sign up and send fitness challenges to their friends and families (i.e. facebook friends). Each challenge request has an associated fitness goal such as achieving a mile time under 8 minutes or running for half an hour a day for a month. Each challenge request also associated \"reward,\" a small monetary award that the user who made the challenge agrees to donate to a selected charity if the challenge recipients completes the fitness goal. Share the Gains is integrated with Pebble smartwatches, and the completion of fitness goals is determined based on data taken from the Pebble. Each user provides credit card information upon registration, and donations are sent to the charity from the challenger once the challenge is complete. Share the Gains is a social web-app, and it includes a dashboard with a newfeed and records of ongoing and past challenges. </p>\n<h2>How I built it</h2>\n<p>The web-app was built using HTML, CSS, and Javascript. Login is done through an embedded Facebook login, and backend in taken care of using Parse. The payment system was achieved using the Stripe API.</p>\n<h2>What's next for Share the Gains</h2>\n<p>Ideas for functionalities to add in the future include: </p>\n<ol>\n<li>Bi-directional challenge requests (you can challenge another person to do a fitness goal or you can ask someone to donate if you complete a fitness goa)</li>\n<li>Mutual challenge requests (you set a mutual goal with a friend if you each donate if the other achieves the goal)</li>\n<li>Integration with PayPal</li>\n<li>Integration with facebook newsfeed</li>\n<li>In addition to a newsfeed, having profiles for each user -- profiles would include records of challenges, fitness goals, and donations</li>\n<li>As of now, we are only able to accommodate fitness goal that are based on running, which can be easily measured with Pebble. We definitely would want to allow for other fitness goals in the future.</li>\n</ol>\n<p>We have the domain <a href=\"http://www.sharethegains.com\" rel=\"nofollow\">www.sharethegains.com</a>, but we're still hosting through cloud9 as of now</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/parse\">parse</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bootstrap\">bootstrap</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/stripe\">stripe</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/json\">json</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/backbone-js\">backbone.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/pebble\">pebble</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://sharethegains-dchizzle.c9users.io/\" rel=\"nofollow\" target=\"_blank\" title=\"https://sharethegains-dchizzle.c9users.io/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>sharethegains-dchizzle.c9users.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", "", ""]], ["", "", ""], ["", "", ""], ["My Rights", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"My Rights – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/649/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"My Rights – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/647/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"My Rights – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/648/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>The recent events surrounding police brutality have brought back into the spotlight the scary power that being \"an authority\" can bring. We aim to empower citizens by informing them of what the police can and can't do in important, everyday situations such as when stopped at a traffic light or when hosting a house party.</p>\n<h2>What it does</h2>\n<p>Shows people a clean-formatted rendition of the most important regulations pertaining to certain police encounters.</p>\n<h2>How I built it</h2>\n<p>Swift and Xcode.</p>\n<h2>Challenges I ran into</h2>\n<h2>Accomplishments that I'm proud of</h2>\n<h2>What I learned</h2>\n<h2>What's next for My Rights</h2>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li></ul>\n</div>\n</div>", ["", ""]], ["", "", ""], ["", "", ""], ["LearningPaths", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Most people enjoy learning when they have examples to follow. It is easier to motivate oneself when one can follow lessons that others can take. LearningPaths offer pathways for people to find lessons and goals to motivate themselves. With the potential to include several, community-driven lesson plans, LearningPaths provide a great educational experience for everyone. </p>\n<h2>What it does</h2>\n<p>LearningPaths aggregates links and resources for people who took the time to study the material in their own lives. Through sharing resources such as blogposts or YouTube videos, others would be able to follow in the footsteps of those who followed these videos. </p>\n<h2>How I built it</h2>\n<p>This app was built using the Android sdk and Android Studio(Java). The backend server was originally made using Heroku and Python, but it was transitioned toward Firebase. </p>\n<h2>Challenges I ran into</h2>\n<p>Heroku and Python were fairly unreliable, and the original plan was a lot more complex in scope. A lot of features were either cut out, streamlined, or implemented very poorly compared to the original vision for the app. Material Design was also very difficult to implement. Firebase also did not offer easy ways to access data once it was placed on their servers. </p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>With limited technical experience and resources(a thinkpad from 2007...), we were able to implement a social experience using Android and the web. This was huge, especially for us, since we haven't worked with JSON, XML, RESTful, or the Android SDK before. </p>\n<h2>What I learned</h2>\n<p>I learned a lot about creating backend servers and databases. For the future, it will be important to consider the tools available to implement an application based on scale. I would be more open to using tools like Heroku and Amazon AWS for more robust web application. I would also like to work with more hardware. </p>\n<h2>What's next for LearningPaths</h2>\n<p>After fixing major stability issues and testing on android, we would plan on a few key improvements: \nFirstly: we would take the Firebase backend and replace it with something more robust. A new backend would allow for the app to scale better and to include more features, such as a web or iOS client. \nSecond: It would be great if we were to implement the \"Share\" features found in Android. Being able to share a video or a webpage directly from Chrome or Youtube to a Path would allow for greater ease of use.\nFinally, it would be important to aim for a cohesive visual language across the application, from the iconography to the animations and user interface. Our current icon looks like something from a video game... not cool. It would also be nice to include social network integration and elements of gamification to help people learn even more. </p>\n<p>With more time, this idea would have been something that I personally would have used every day. However, a social experience like this is always determined by the strength of its community. I am confident that this would have made education more accessible and fun for everyone. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/firebase\">firebase</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://drive.google.com/file/d/0B2TRi7SfHPfwTjRISXRZemRBNzQ/view?usp=sharing\" rel=\"nofollow\" target=\"_blank\" title=\"https://drive.google.com/file/d/0B2TRi7SfHPfwTjRISXRZemRBNzQ/view?usp=sharing\">\n<i class=\"ss-icon ss-link\"></i>\n<span>drive.google.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I helped set-up the server and database. I also helped with graphical design. ", "", "", "", ""]], ["", "", ""], ["FoodForDayz", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Food is life. The story goes that the world produces enough food to feed every single person on Earth but there is still a billion people in the world experiencing starvation or malnutrition. Where did the extra food go? Most of them are actually wasted in developed countries. Managing leftovers have always been a challenge due to the high food safety standards imposed and the problem of location mismatch between the people who need the food and where the leftovers are. We are here to change that by offering a different approach to it by highlighting the demand of the food to the people who prepare it. But before we change the world, we want to change Duke's campus first.</p>\n<h2>What it does</h2>\n<p>FoodForDayz is a demand-management app that allows students to notify the college canteen if they do not plan to dine in the college canteen. A lot of food is wasted by marketplace every day simply because they cannot anticipate how many students plan to eat there and marketplace always end up cooking too much food. We want to create an app that will eventually be integrated with DukeMobile that allows students to indicate to marketplace in advance that they might not be going to eat at marketplace on certain days. In return, students will be offered some credits or FoodPoints that they can use to purchase food elsewhere on campus. From marketplace's perspective, they have a better idea on how much food to prepare for the day. From the user's perspective, they can get some money back for instances where they have to travel or dine out of campus.</p>\n<h2>How I built it</h2>\n<p>Our team utilized xCode to develop the app on the iOS platform first and we plan to expand it to Android at the later time. </p>\n<h2>Challenges I ran into</h2>\n<p>Importing the API into xCode took us a long time to figure out and just coding using xCode was tough since all of the members of our team were first time Hackathon participants and we had elementary levels of computer science knowledge.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>We were excited to build our first iOS app, although it is not fully functional yet because of the limited time we have to code during HackDuke. We are also proud of our idea because there isn't such an app on the market or on any campuses yet and we believe that this can be a disruptive idea. </p>\n<h2>What I learned</h2>\n<p>We learned to work with fellow coders on idea synthesis, conceptualization of an app, physically building the app using xCode, seeking help from mentors and finally integrating our code to form the final product. </p>\n<h2>What's next for FoodForDayz</h2>\n<p>We hope to develop it further beyond the span of HackDuke and make it fully functional for the good of Duke students.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ios\">ios</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xcode\">xcode</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/git\">git</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/cocoapods\">cocoapods</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/ptan35/FoodForDayz\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/ptan35/FoodForDayz\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["", "", ""], ["", "", ""], ["vLibrary", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"vLibrary – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/512/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"vLibrary – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/513/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"vLibrary – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/514/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"vLibrary – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/319/515/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>To read a book all you require is an interest. The need to spend on books actually acts a roadblock in the learning curve. The community with people who are ready to share their collection of books can help in taking education to a next level.  </p>\n<h2>What it does</h2>\n<p>vLibrary is a virtual library which has users who can add all the resources they are willing to share. Every user can filter their search for books based on location,title, author. Once they find the book of interest they can request for the book from the owner. Choosing a book closest to the borrower will enable easier lending and returning. This way people can share the books which they are not currently using. Education will no longer be considered with economy as a limiting factor.  </p>\n<h2>How I built it</h2>\n<p>We used javascript as the base-development language, Bootstrap for the front-end design, esri for maps, firebase for storage and facebook for authentication and user profile management.</p>\n<h2>Challenges I ran into</h2>\n<p>We are using firebase, which did not have the feature of full text search. As we did not have time to develop elastic search, we ended up using regular expression matching which is inefficient </p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>We deployed the application already and it is available online.\nThe feel of working for a cause gives more accomplishment than any other applications we have worked so far.</p>\n<h2>What I learned</h2>\n<p>We learnt firebase and we learnt how to deploy and work in a live application</p>\n<h2>What's next for vLibrary</h2>\n<p>This could be made into a mobile application although the current web application is mobile-friendly.\nBased on the usage frequency or privacy, people can drop and pick the books from nearby libraries instead of handling the transactions in person</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bootstrap\">bootstrap</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/firebase\">firebase</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css3\">css3</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/facebook\">facebook</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/esri\">esri</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/github\">github</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/json\">json</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://hackerpack.me/vLibrary/\" rel=\"nofollow\" target=\"_blank\" title=\"http://hackerpack.me/vLibrary/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>hackerpack.me</span>\n</a></li>\n<li><a href=\"https://github.com/HackerPack/vLibrary\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/HackerPack/vLibrary\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", "", "", "", ""]], ["", "", ""], ["Facebook Posts Analysis", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>There are a lot of crappy posts on Facebook. There needed to be a way to check if your last couple posts were actually engaging people more than normal or just boring the people around. Enter Facebook Analytics.</p>\n<h2>What it does</h2>\n<p>It checks your last 100 Facebook posts to find the average likes and comments per post. Then it displays your Facebook posts to you and shows you what is doing above average and what is below average.</p>\n<h2>How I built it</h2>\n<p>I used Python and the Graph API from Facebook to set it up and pull all the post information. After that, I set up a quick Python GUI to display the information and make it look all pretty.</p>\n<h2>Challenges I ran into</h2>\n<p>Originally I was hoping to have it set up with Facebook OAuth on the web so that people could log in and check their own information, but I had a lot of trouble getting it up and running, so it's just set up on a Python GUI.</p>\n<h2>What's next for Facebook Posts Analysis</h2>\n<p>Would like to originally get it up and running on the web so that people can check their own post history. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/flask\">flask</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/facebook-graph\">facebook-graph</a></span></li><li><span class=\"cp-tag\">facepy</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/MurtazaB/FacebookPostsAnalytics\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/MurtazaB/FacebookPostsAnalytics\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""], ["", "", ""]]