[["Gear - The Text Based Loading Game", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>What it does</h2>\n<h2>How I built it</h2>\n<h2>Challenges I ran into</h2>\n<h2>Accomplishments that I'm proud of</h2>\n<h2>What I learned</h2>\n<h2>What's next for Gear - The Text Based Loading Game</h2>\n<p>Inspiration from Oregon Trail and the Fallout Series</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/visual-studio\">visual-studio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--2\">c#</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/asp-net\">asp.net</a></span></li></ul>\n</div>\n</div>", [""]], ["Challenge 1", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<p>We built a solution for health care professionals to determine if a patient will return to the hospital within thirty days. This uses a feed-forward deep neural network (DNN), which trains a model to predict the 30-day re-admittance of a patient. The DNN is built using the TensorFlow machine learning library for Python 3.5. The DNN has hidden two layers. The first hidden layer has 50 nodes, while the second hidden layer has 20 nodes. After training the model, a separate Python script is able to load the pre-trained model at-will and use it to predict for a single patient's data.</p>\n<p>We have created a webpage (joshriess.tech) for health care professionals to more easily access the predictive capacities of the DNN model. This webpage allows for input of a patient's data and quick prediction. In order to accomplish this, the HTML input is pre-processed by PHP and passed as arguments into the Python evaluation script, where it is further processed and validated before use with TensorFlow. The final prediction is passed to PHP along with an identification string. PHP then identifies the final result and notifies the user.</p>\n<p>Note: joshriess.tech may be password-protected at this time.</p>\n<p>All products are in a prototype stage.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag\">python-3.5</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/numpy\">numpy</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/scipy\">scipy</a></span></li><li><span class=\"cp-tag\">tensorflow</span></li><li><span class=\"cp-tag\">tf.learn</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/pandas\">pandas</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/linux\">linux</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/machine-learning\">machine-learning</a></span></li><li><span class=\"cp-tag\">deep-neural-network</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/greasypenguins/purple-hats\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/greasypenguins/purple-hats\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Built and trained the deep neural network model. Created the evaluation script to run on the website.", "Built website with form to enter data in. Wrote PHP to pass form data off to python scripts that run the evaluation.", ""]], ["BetterDAI", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"BetterDAI – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/440/814/datas/gallery.jpg\"/>\n<p>\n<i>BetterDAI Logo</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>We wanted to learn Django. We wanted to do data analysis.</p>\n<p>The K-State SIGAI Group proposed a challenge. We want to use data science for the betterment of society. In order to combine these ideas, we concocted BetterDAI, an end to end data pipeline that betters the world. </p>\n<p>Our goal was to predict which patients will be re-admitted to the hospital within 30 days of their discharge. This is a real problem for hospitals, who don't get paid for a re-admission if it happens within 30 days after the patient was discharged, and patients, who would like to live their life outside the walls of a hospital and be healthy.</p>\n<h2>What it does</h2>\n<p>BetterDAI is a state of the art end to end pipeline that uses Python, Django, Sqlite, Twilio, DigitalOcean, Bootstrap, R, and Machine Learning. </p>\n<p>Doctors insert data about all their patients into the form on the web application. This information is stored in a database. (almost)</p>\n<p>The patient data stored in the database is then prepared and cleaned in order to pass it to our predictive model. The model predicts whether a patient has a high likelihood of being readmitted to the hospital within the next 30 days (that makes for a bad day). Our predictive model has an ensemble of analysis techniques used in order to ensure the highest precision (that makes for a better day).</p>\n<p>Once the model has done its work, the doctor has access to top of the line analytics to help him make a decision in releasing a patient. (see more in the how we applied machine learning and prediction)</p>\n<p>BetterDAI collects data, cleans it, processes it, and delivers it back with useful information. The full stack. The pipeline. The end to end solution for doctors everywhere. It is data science for good!</p>\n<h2>How we built it</h2>\n<p>We used django to create a web application in python.</p>\n<p>We hosted our app on DigitalOcean using a domain from domain.com, <a href=\"http://betterdai.tech\" rel=\"nofollow\">link</a>.</p>\n<p>We used the Twilio API because we thought it was cool.</p>\n<p>We used sqlite database to store information about the patients.</p>\n<h2>How to apply Machine Learning</h2>\n<p>What preprocessing and supervised learning methods did you use?\npreprocessing:\n1, remove constant features\n2, factorize categorical features\n3, impute NAs\n4, on-hot-encoding for categorical features and low-level numerical features\n5, create num of NAs feature</p>\n<p>first level models:\n1*glmnet(logistic regression)\n2*Ranger(random forest)<br/>\n2*XGBoost(boosting)</p>\n<p>stacking model: glmnet</p>\n<p>strategies:</p>\n<ul>\n<li>First do exploratory data analysis and data visualization to understand the data,\nwhich is important for find suitable models later on.</li>\n<li>Establish solid cross-validation scheme before any feature engineering and modeling</li>\n<li>Different model to diversity the prediction, beneficial for ensemble</li>\n</ul>\n<h2>Challenges we ran into/ Hacks we made</h2>\n<p><strong>DJANGO</strong></p>\n<p>Static files within Django. We spent countless hours trying to get a correct implementation, but ended up settling with a sub-par hack. (We hosted our css files on another DigitalOcean droplet and referenced them CDN-like through a URL)</p>\n<p>The csrf_tokens. We tried to use them like good people, but they made everything harder, so we just left them out. Sorry security.</p>\n<p>Getting the Django project to run on the DigitalOcean server. We ended up just pointing the domain to 127.0.0.1:8000.</p>\n<p>None of us had worked with Django before.</p>\n<p><strong>Connecting R model to our application</strong></p>\n<p>We created a csv file of the recent patient data to run on the model.</p>\n<p>We ran out of time to setup the R environment on digital ocean and parse the resulting csv file to the database.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Setting up domain with digital ocean droplet</p>\n<p>Running Django app on said domain</p>\n<p>Client/Server communication</p>\n<p>Create a model to analyze the data in R</p>\n<p>Integrating sqlite database</p>\n<p>Integrating Twilio</p>\n<p>Preparing csv file for analysis</p>\n<p>Providing an end-to-end solution for all the doctors of the world</p>\n<h2>What we learned</h2>\n<p>R, Django, sqlite, Twilio, Machine Learning</p>\n<h2>What's next for BetterDAI</h2>\n<p>After it is implemented by every hospital in the U.S. and many people's days have been made better, we will expand internationally and once we have expanded internationally everyone in the entire world's day will have been made better and there will be so much joy in the world that their will be world peace among all nations.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/django\">django</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/r\">r</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/sqlite\">sqlite</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/machine-learning\">machine-learning</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/twilio\">twilio</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://www.betterdai.tech\" rel=\"nofollow\" target=\"_blank\" title=\"http://www.betterdai.tech\">\n<i class=\"ss-icon ss-link\"></i>\n<span>www.betterdai.tech</span>\n</a></li>\n<li><a href=\"https://github.com/srjayhawkfan/HackKState2016\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/srjayhawkfan/HackKState2016\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I mainly worked on back-end side, including data cleaning and visualization, feature engineering, and machine learning modeling.", "I worked on the database and integrating our R model into the website. Also, I made the logo and helped with devpost/slides.", "Mainly worked on the front-end side as well as user interface. Responsible for source control.", ""]], ["Change for Harassment", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Change for Harassment – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/440/859/datas/gallery.jpg\"/>\n<p>\n<i>harassment program</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>changes demoralizing curse words into a funny phrase, which makes sentences better using comedy and out of sight out of mind.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li></ul>\n</div>\n</div>", [""]], ["Classify", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Classify – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/441/353/datas/gallery.jpg\"/>\n<p>\n<i>Home Screen</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>In modern-day elementary school classrooms, the class can often feel separated from the parents of the students. Parents may ask their child what they did in school that day. However, students won't necessarily be able to give all the detail that the parents want to know, such as assigned homework, due dates, and behavior.</p>\n<h2>What it does</h2>\n<p>Classify fixes this by closing the distance between parents and the classroom. When a teacher sees a student doing something good or bad, he/she can ask Alexa to give or remove a student's points. The student's total points are then showed on <a href=\"http://www.echoclassify.tech\" rel=\"nofollow\">www.echoclassify.tech</a> for parents to view. Parents can also view all of the assignments (with due dates) that the teacher added using an Amazon Echo. This will allow them to help their child complete their assignments on time. In addition to all of this, if a parent has any concerns about why their child has the point total they have, or wants more information about an assignment, he/she can send an email to the teacher directly off of our website. If a student rises above or falls below a certain point value a text will automatically be sent to the student's parents. Texts will also be sent to parents every time an assignment is created or removed.</p>\n<h2>How we built it</h2>\n<p>Our team used an Amazon Echo in conjunction with Amazon Web Services Lambda to send points and assignments to Parse Server. Then, <a href=\"http://www.echoclassify.tech\" rel=\"nofollow\">www.echoclassify.tech</a> retrieved data from Parse to show it on the website. Twilio was used with Amazon Web Services to send all of the texts. Using emailjs, we were able to allow parents to send emails to the teacher directly off the website.</p>\n<h2>Challenges we ran into</h2>\n<p>Since no one on our team was familiar with AWS Lambda or the Amazon Echo in general, a lot of time was spent learning and making mistakes. In addition to Amazon-related issues, we encountered other obstacles, including sending texts with Twilio and using HTML Canvas</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We are extremely proud of how we helped each other solve issues on subjects that were foreign to all of us just 2 days ago. Being able to hack on new hardware and using new languages certainly provided for a challenge, but we were able to reach our goals and have fun the whole time.</p>\n<h2>What we learned</h2>\n<p>Cumulatively, our team learned Javascript, AWS Lambda, Twilio, and Alexa voice service.</p>\n<h2>What's next for Classify</h2>\n<p>Classify can be expanded to create a more comprehensive classroom system. Although Classify is currently directed towards elementary-age children, other features will make it more adaptable to various educational levels.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css3\">css3</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/twilio\">twilio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/parse\">parse</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/amazon-web-services\">amazon-web-services</a></span></li><li><span class=\"cp-tag\">emailjs</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/BeijingStrongbow/classify\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/BeijingStrongbow/classify\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I took the processed data and connected it with our parse data base. I also worked on retrieving data from the data base and implementing it into our website, formatting it appropriately.", "I created the hourglass graphics, helped design the website, and helped with teaching Alexa skills.", "I worked on the front end and organized the layout of the website. I configured the initial Twilio component and assisted in working on the API.", "I configured the Amazon Echo with the voice service, as well as processing the data from it."]], ["Chord-Maker", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>The world always needs more beautiful music, and we wanted to inspire the next generation of possible musicians by showing them how easy music can be.</h2>\n<h2>It has 14 buttons on the top, 7 that play 3 part harmonies in C (the key not the language), and the other 7 that play 4 part harmonies.  In the text box we assigned numbers 1-7 to their corresponding note in the scale/key of C.  Upon pressing these keys, the corresponding pitch will sound.  Chords can be constructed this way.  Then we explained some very simple music theory concepts.</h2>\n<h2>We used MIT licensed sound generator and used it to show what can be done with just 7 notes.</h2>\n<h2>We challenged ourselves.  We used new development tools and forced ourselves to learn.  We hit at least four hard stop dead ends that couldn't be salvaged.</h2>\n<h2>We did the project running a skeleton crew.  We got to try a lot of new ways to attack a problem.  We discovered a feature from a bug.</h2>\n<h2>We learned everything.  We had no experience in Javascript prior to this weekend, and used the hackathon as a good excuse to pursue uncharted waters.  We experimented with a number of IDE's as well as the initial difficulty of learning the language.</h2>\n<p>Chord-Maker is currently the first version.  The plan is to get it on mobile devices and add as many advanced features as possible (ie. Flats and sharps, chord recognition, music theory lessons, and much much more).</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://hackkstatepoly.tech\" rel=\"nofollow\" target=\"_blank\" title=\"http://hackkstatepoly.tech\">\n<i class=\"ss-icon ss-link\"></i>\n<span>hackkstatepoly.tech</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["Universal Communication System", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>It is annoying and sometimes offensive to have to read all of the messages from other people that are just full of hate.</p>\n<h2>What it does</h2>\n<p>Filters out offensive and angry messages from one's feeds and only shows the happy ones.</p>\n<h2>How we built it</h2>\n<p>We have an IBM Bluemix service that processes the chat messages and only delivers helpful ones.</p>\n<h2>Challenges we ran into</h2>\n<p>It is hard to implement external services with an event-driven architecture.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Finishing all of the content and having a very good filter.</p>\n<h2>What we learned</h2>\n<p>How to use IBM Watson and how to design projects to be easier to program</p>\n<h2>What's next for Universal Communication System</h2>\n<p>Integration with online services (Slack, Twitter, etc.)</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/json\">json</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/linux\">linux</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/monodevelop\">monodevelop</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/notepad\">notepad++</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/oauth\">oauth</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/processing\">processing</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ruby\">ruby</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/rubygems\">rubygems</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/visual-studio\">visual-studio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xamarin\">xamarin</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/net\">.net</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/lamp\">lamp</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css3\">css3</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/digitalocean\">digitalocean</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/scss\">scss</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://blockharassment.tech/\" rel=\"nofollow\" target=\"_blank\" title=\"https://blockharassment.tech/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>blockharassment.tech</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", "", ""]], ["Fantastico", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Fantastico – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/441/073/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspired by the need for fantastic conversations.</h2>\n<h2>Community lead conversations</h2>\n<h2>Build carefully</h2>\n<h2>Lots of challenges.</h2>\n<h2>No PHP Errors, SQL Injection Prevention, Cloud Based  Application, Mobile Friendly</h2>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mysql\">mysql</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://159.203.142.195/\" rel=\"nofollow\" target=\"_blank\" title=\"http://159.203.142.195/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>159.203.142.195</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I mostly worked on the back-end. ", "I worked on the front-end and some server-side development.", "I mostly worked on the database. ", ""]], ["Wizarding Shenangians", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Random Game Idea Generator</p>\n<h2>What it does</h2>\n<p>Move your character using the on-screen arrows. Avoid the enemies who are following you. Exit the square to win.</p>\n<h2>How we built it</h2>\n<p>We used the Unity Engine. We used a lot of trial and error.</p>\n<h2>Challenges we ran into</h2>\n<p>Lots. Creation of thousands of random objects. </p>\n<h2>Accomplishments that we're proud of</h2>\n<p>The AI of the enemies. The buttons used for movement.</p>\n<h2>What we learned</h2>\n<p>Unity is picky and breaks for no reason. </p>\n<h2>What's next for Wizarding Shenangians</h2>\n<p>Implementation of it's original idea (combat system).</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://nathanmcclain.itch.io/wizarding-shenanigans\" rel=\"nofollow\" target=\"_blank\" title=\"https://nathanmcclain.itch.io/wizarding-shenanigans\">\n<i class=\"ss-icon ss-link\"></i>\n<span>nathanmcclain.itch.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["Weather Map Tech", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Weather Map Tech – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/441/457/datas/gallery.jpg\"/>\n<p>\n<i>Map_WorldLanguages</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>weathermap.tech is a site hosted on GitHub.  There is currently a JavaScript implementation of a map with coordinates than can be colored based on temperature. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag\">tech</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://weathermap.tech\" rel=\"nofollow\" target=\"_blank\" title=\"http://weathermap.tech\">\n<i class=\"ss-icon ss-link\"></i>\n<span>weathermap.tech</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["Hand-Ball Simulator ", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>We tried out the demos hosted by Leap Motion and were were excited by the possibilities for what could be created using the device.</p>\n<h2>What it does</h2>\n<p>Leap Motion is a small infrared device that enables users to \"interact with digital content in virtual and augmented reality, Mac and PC using your hands just as you would in the real world\" ( _ <a href=\"http://www.leapmotion.com\" rel=\"nofollow\">www.leapmotion.com</a> _ ).  Our program uses Leap Motion's functionality to simulate playing 4-wall handball. The objective of handball is to hit the ball against the back wall before the ball can bounce twice on the ground. Handball Simulator currently does not support two players, so the game is more of a challenge to keep the ball off the ground for as long as possible and a demonstration of how Leap Motion can work with physics engines. The game requires two people to run: one person to control the view and the movement of the player, and one to control the hands of the player.</p>\n<h2>How I built it</h2>\n<p>Hand-Ball Simulator combines the available assets for adding simulated hands to a unity project together with a physics engine to create a virtualization of the game of Handball.</p>\n<h2>Challenges I ran into</h2>\n<p>None of us had any previous experience with Leap Motion and most of us had very limited experience with Unity, so a majority of our time was figuring out how to add objects to the world and interact with those objects. The Leap Motion SDK is not widely used so we ran into several problems that did not have well documented solutions. One of these problems was that the Leap Motion SDK had the wrong target framework selected by default and thus our scripts would not compile, which took time to diagnose and then resolve.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Coming from very little experience with Leap Motion and Unity, we have all made excellent strides towards familiarity of the development process. Despite encountering several confusing roadblocks, we have managed to build a functional program from what we have learned over the past 32 hours.</p>\n<h2>What I learned</h2>\n<p>Because we had no experience with Leap Motion and very little experience with Unity, we learned a lot about how to program in a 3D space. We had to figure out how to manipulate the objects to work in 3 dimensions and learn how to use unity at the same time. We all learned just how powerful the Leap Motion can be in the right hands as well. After playing a few games to get used to the controls, we figured out that the real limitations to what can be done is only how much work you are willing to put into the project.</p>\n<h2>What's next for Hand-Ball Simulator</h2>\n<p>We hope to continue development on the Leap Motion using the base engine that we created for Hand-Ball Simulator to create all sorts of different applications. A few of the ideas that we came up with that we hope to pursue in the future are: a Jedi force simulator, a physics box in which the user can build different blocks and stack them around the world to create buildings.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--2\">c#</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/leap-motion\">leap-motion</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://drive.google.com/file/d/0B4_2RZDvMiQhZXlzQ3NWdi1fbUE/view?usp=sharing\" rel=\"nofollow\" target=\"_blank\" title=\"https://drive.google.com/file/d/0B4_2RZDvMiQhZXlzQ3NWdi1fbUE/view?usp=sharing\">\n<i class=\"ss-icon ss-link\"></i>\n<span>drive.google.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["Data Science Track - Challenge #1: Pred. Hosp. Readm.", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration -</h2>\n<h2>What it does -</h2>\n<h2>How I built it - python</h2>\n<h2>Challenges I ran into - data cleaning</h2>\n<h2>Accomplishments that I'm proud of - still alive</h2>\n<h2>What I learned - do what works</h2>\n<h2>What's next for Data Science Track - Challenge #1: Pred. Hosp. Readm.</h2>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/cderekw4224/hack-k-state\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/cderekw4224/hack-k-state\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["Don't Steal My Spot", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Don't Steal My Spot – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/445/472/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>Are you tired of people stealing your parking spot at your apartment? Do you want to ensure that your parking space stays your parking space? Are you landlord wanting to provide your residents a guarantee that they will never have to worry about parking in your apartment complex? If so, DONTSTEALMYSPOT.com is perfect for you!</p>\n<h2>Inspiration</h2>\n<p>This hack was inspired by our team's constant parking struggles. Our college town apartment complex has very limited parking spaces, as such, it can be very frustrating to pull into the apartment complex only to find that YOUR spot has been stolen by someone else. Current solutions to this problem are not adequate. Mandatory parking permits are annoying to deal with and can limit residents to one car. Furthermore, parking permits can be difficult to pass between friends and family. Thus, the idea to create a parking spot sign that could identify whether or not a person was able to park in the spot, was born.  </p>\n<h2>What it does</h2>\n<p>Takes a picture of a person, analyses the picture. If it matches to the owner of the spot, it welcomes the owner home. </p>\n<h2>How we built it</h2>\n<p>We used IBM Bluemix and IBM Internet of Things platform to hook up a Raspberry Pi 3 to the internet. The raspberry pi has a camera that snaps a picture of the face. It is integrated with watson text-to-speech and watson visual recognition software. The camera would be signaled to take a picture by a recipe that uses a raspberry pi with sensors to determine whether or not the parking spot is full. The visual recognition would then analyze the picture against an array of registered users to determine whether or not person is allowed to park in the spot.</p>\n<h2>Challenges we ran into</h2>\n<p>Learning how to use IBM Bluemix and how to integrate the raspberry pi with the internet of things. We didn't have any prior experience using either devices, as such, it took us a while to get started. </p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Figured out how to use watson, and IBM IOT, visual recognition and text to speech. Our product idea is viable and can be expanded to multiple markets. </p>\n<h2>What we learned</h2>\n<p>Learned how to use IBM Bluemix, IBM Internet of Things Platform, Watson Text-to-Speech, Watson image recognition, Node-red, and use the raspberry pi. We also learned how to set up a domain and have it linked to amazon web services. </p>\n<h2>Using Facial Recognition Software and Cyber-Privacy Vulnerabilities For Good (aka Watch-Dogs Category)</h2>\n<p>In today's day and age with social media, your face is public domain. Thus, our product takes advantage of this fact to provide a benefit to users. </p>\n<h2>What's next for Don't Steal My Spot</h2>\n<p>Expand the facial recognition, after it recognizes you be able to give you important information about the day. Send text message to registered user is unregistered user is in the parking spot. Fully integrate with \"Parking IoT solution with Node-Red Recipe\" to be able to determine whether or not the parking space was full to signal to the pi to take a picture. Recipe we would like to build off of: <a href=\"https://developer.ibm.com/recipes/tutorials/parking-iot-solution-using-watson-iot-with-nodered/\" rel=\"nofollow\">Recipe</a></p>\n<p><a href=\"https://dontstealmyspot.com\" rel=\"nofollow\">Don't Steal My Spot</a></p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bluemix\">bluemix</a></span></li><li><span class=\"cp-tag\">domain.com</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/amazon-web-services\">amazon-web-services</a></span></li></ul>\n</div>\n</div>", ["Integrated Raspberry Pi with IBM Watson IOT Platform, Watson Text-To-Speech and Watson Visual Recognition using Node-Red language. ", "", ""]], ["Hope", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>The main theme of Hack K-State inspired us to do this. #hackharrassment</p>\n<h2>What it does</h2>\n<p>Helps people when they need a friend in hard times or a rough time or you can have a normal conversation with Hope.</p>\n<h2>How I built it</h2>\n<p>API.ai website had an A.I. maker </p>\n<h2>Challenges I ran into</h2>\n<p>Integration into other apps, </p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Making the A.I. in general and distribution within apps</p>\n<h2>What I learned</h2>\n<p>How to use Python vaguely </p>\n<h2>What's next for Hope</h2>\n<p>More app integration, distributed more by publicity</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag\">api</span></li><li><span class=\"cp-tag\">ai</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/twilio\">twilio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/alexa\">alexa</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://console.api.ai/api-client/demo/embedded/6caa5bd9b0df45719e5b6326a0193856\" rel=\"nofollow\" target=\"_blank\" title=\"https://console.api.ai/api-client/demo/embedded/6caa5bd9b0df45719e5b6326a0193856\">\n<i class=\"ss-icon ss-link\"></i>\n<span>console.api.ai</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I helped work on integration of other platforms, Amazon Alexa, and ideas of her personality.", "I help publish a facebook page created responses and got it on other platforms and tested it.", "I made the the questions and answers for the A.I."]], ["ScheduleMe", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Whenever it's time to enroll in schedules for the following semester, students always turn to excel or scrap paper to map out their schedules.  This can be time consuming as well as tedious because there are so many different schedule combinations.</p>\n<h2>What it does</h2>\n<p>ScheduleMe was intended to be the one tool needed during enrollment time.  All students would have to do is enter what classes they would be taking the following semester and choose the schedule that fits best for them.</p>\n<h2>How I built it</h2>\n<p>Using Python and the beautiful-soup library, I scraped the Kansas State University course schedule pages and created .sql files to load into a database.  Then, a connection was created with a python script to a MySQL database where all of the data was loaded.</p>\n<h2>Challenges I ran into</h2>\n<p>Webscraping the Kansas State University line schedule started out very easily.  However, once I was able to located the information needed for the database, extracting only the desired information and discarding data that would corrupt the database became incredibly difficult.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Having never made a webscraping project before, I am proud that I was able to accomplish my goal of scraping an entire semester's schedules.</p>\n<h2>What I learned</h2>\n<p>I learned a lot about the structure of HTML pages, as well as how to work with the beautiful-soup library.</p>\n<h2>What's next for ScheduleMe</h2>\n<p>Now that there is a way to scrape course schedules from the website, I hope to later develop a Graphical User Interface for students to interact with so that they may actually use and have access to the database that I have created.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/beautiful-soup\">beautiful-soup</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mysql\">mysql</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/phpmyadmin\">phpmyadmin</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/daltonhahn/HackK-State\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/daltonhahn/HackK-State\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["Watson The Lot", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h1>Watson The Lot</h1>\n<h2>To check it out</h2>\n<p>Make a new camera picture by visiting the two urls\n159.203.129.227/update\n159.203.129.227/check</p>\n<p>The picture being analyzed is at\n<a href=\"http://159.203.129.227/static/camera.png\" rel=\"nofollow\">http://159.203.129.227/static/camera.png</a></p>\n<p>The Bluemix watson stuff is at\n<a href=\"http://iot-1-hr-practice.mybluemix.net/red/#flow/\" rel=\"nofollow\">http://iot-1-hr-practice.mybluemix.net/red/#flow/</a></p>\n<p>Flows 4 and 5 have the useful stuff.</p>\n<p>Then visit\nwatsonthelot.tech</p>\n<h2>Website Location</h2>\n<p>Our project can be found at <a href=\"http://watsonthelot.tech\" rel=\"nofollow\">watsonthelot.tech</a> and the ip address for our server is <a href=\"http://138.197.16.151\" rel=\"nofollow\">138.197.16.151</a>.</p>\n<h2>Main Goal</h2>\n<p>Our Hack K-State Fall 2016 project to detect cars on a parking lot and produce useful data from it.</p>\n<h2>Sub Goals</h2>\n<ul>\n<li>[ ] When a registered phone comes within a certain proximity of the school send a message stating whether the parking lot is full</li>\n<li>[ x] Make a webpage that shows the following information.\n\n<ul>\n<li>[ x] Data about the current usage of the parking lot (Aimed at students and faculty)</li>\n<li>[ ] A page that uses predictive analytics to predict the state of the parking lot at a given time. (Aimed at students and faculty)</li>\n<li>[ ] Trends about the average usage rates (Aimed at administration)</li>\n<li>[x ] A page about the project</li>\n</ul></li>\n<li>[ ] Send an alert when the parking lot is snowed over.</li>\n<li>[x] Use Watson to judge which parking spots on a lot are in use.</li>\n<li>[ ] Store a log of the state of the parking lot for use in analysis.\n\n<ul>\n<li>[ ] Include data about the weather to make analysis easier.</li>\n</ul></li>\n</ul>\n<h2>Technologies Used</h2>\n<ul>\n<li><a href=\"https://www.python.org/\" rel=\"nofollow\">Python</a>\n<ul>\n<li><a href=\"https://flask.pocoo.org/\" rel=\"nofollow\">Flask</a></li>\n</ul></li>\n<li><a href=\"https://github.com/\" rel=\"nofollow\">Github</a></li>\n<li><a href=\"https://www.digitalocean.com/\" rel=\"nofollow\">Digital Ocean</a></li>\n<li><a href=\"http://www.ibm.com/watson/\" rel=\"nofollow\">IBM Watson</a> and <a href=\"https://www.ibm.com/cloud-computing/bluemix/\" rel=\"nofollow\">Bluemix</a></li>\n<li><a href=\"https://slack.com/\" rel=\"nofollow\">Slack</a></li>\n</ul>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bluemix\">bluemix</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ibm-watson\">ibm-watson</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/flask\">flask</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/github\">github</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/digitalocean\">digitalocean</a></span></li><li><span class=\"cp-tag\">html5up</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/apple-icloud\">apple-icloud</a></span></li><li><span class=\"cp-tag\">pillow</span></li><li><span class=\"cp-tag\">jupyter</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/json\">json</a></span></li><li><span class=\"cp-tag\">http</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/dbramucci/watson-the-lot\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/dbramucci/watson-the-lot\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I made the webserver, data processing, Watson-python interfacing and Node Red code and organized the project.", "I got the web servers up and running and installed necessary packages, registered our domain name, set up iPhone location service tracking, and designed the website using html, css, and html5up.  This was my first time creating a website or a webserver, so it was a great learning experience!"]], ["SmartClassroom", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>We had wanted to create something simple that could help people around the world and we decided that a program that would allow the teacher to control the classroom with subtle but effective ques to redirect the classroom and retain focus as well as communicating with students who don't know the language of the teacher would help teachers and students become more involved and focused in the classroom environment.  This was designed to be used, but not limited to, elementary and possible middle school classrooms.</p>\n<h2>What it does</h2>\n<p>Allows the teacher to control the classroom atmosphere with this website by changing background music and lighting with one click. Currently, we have three settings for the environment, attention, work time, and refocus.  There are also simple games on the website for the students such as Hangman or a few arithmetic games.  The last main function of the website is served as a catalyst to allow teachers to communicate with a language a student uses as it displays on an iPad (or reads it aloud to the student through the iPad or tablet).  We found this to be a useful feature because our city is a refuge city and we have many people who can't speak English. Many ELL teachers can't cope with all the different languages, and this would help break that language barrier.  The lighting and music would be an easy way to passively control the atmosphere of the room.</p>\n<h2>How we built it</h2>\n<p>Using HTML, PHP, and IBM-Watson, we were able to make the website, games, and programs to control the environment and translate speech.</p>\n<h2>Challenges we ran into</h2>\n<p>HTML compatibility with IBM-Watson, not enough hardware, sleep deprivation, getting the mini-games to be compatible with the website, and just about every other problem you could think of. :)</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>How the website looks, we came into this only knowing how to code in Java.  Everything we have done, we have learned in the last two days.</p>\n<h2>What we learned</h2>\n<p>The IBM system was something that was extremely confusing that we can now somewhat use.  Website programming, PHP, Java Script, and everything else we have used is what we have learned here.</p>\n<h2>What's next for SmartClassroom</h2>\n<p>With more time and equipment.  We could use SmartClassroom to fully integrate our system and improve the learning environment of classrooms everywhere.</p>\n<p>We would use IBM-Watson with wireless controls to handle lights and music from the teacher's computer.  The teachers would be able to display problems on the students' iPads.  And help break the language barrier between students.  SmartClassroom has a lot of potential and could be greatly improved outside this competition with more time.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ibm-watson\">ibm-watson</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://noahc5.github.io/Website/\" rel=\"nofollow\" target=\"_blank\" title=\"https://noahc5.github.io/Website/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>noahc5.github.io</span>\n</a></li>\n<li><a href=\"https://github.com/NoahC5/Website\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/NoahC5/Website\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I help with idea development, as well as with development of games even though they are not implemented, and with design and planning.", "I worked with the entire idea and making it into manageable pieces. I helped Noah & abailous with the designing of each of the games and website.", "I helped with all aspects of the work.  I helped NoahC5 with the website creation and implementation of our tools.  I helped abailous with the making of the games.  And I helped keep everyone organized and on track during the competition.", "I helped work on all aspects of the project from the development of the website to the making of the games and usage of the IBM."]], ["FrequenSee#", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"FrequenSee# – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/445/358/datas/gallery.jpg\"/>\n<p>\n<i>The GUI</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"FrequenSee# – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/445/359/datas/gallery.jpg\"/>\n<p>\n<i>FrequenSee# in action</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>We were inspired by our interest in music, DSP, and Fourier Transforms. </p>\n<h2>What it does</h2>\n<p>FrequenSee# uses a Leap Motion to map the position of a users fingers to the intensity values of a digital equalizer. </p>\n<h2>How we built it</h2>\n<p>We built the solution by clicking the green \"play\" button in Visual Studio. </p>\n<p>After we brainstormed and defined our project, we started with simply reading finger positions with Leap Motion. We then implemented CSCore's digital equalizer and mapped the fingers to the frequency bands. The final step was adding the sliders and directory navigator to the GUI.</p>\n<h2>Challenges we ran into</h2>\n<p>It was our first time using Leap Motion, so there was a small learning curve. We did not know that the orientation of the sensor mattered, and getting the API up and running presented some issues. </p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We are proud of the UI because it is functional, clean, and intuitive. We are also proud of the originality of FrequenSee#. </p>\n<h2>What we learned</h2>\n<p>We learned how to use Leap Motion, how to efficiently utilize APIs, and how navigate API documentation. We also learned how to use the CSCore audio processing library. </p>\n<h2>What's next for FrequenSee</h2>\n<p>We would like to add support for hand motions to scrub through tracks or switch songs to make FrenquenSee# more of a full-featured soundboard.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/visual-studio\">visual-studio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--2\">c#</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/leap-motion\">leap-motion</a></span></li><li><span class=\"cp-tag\">cscore</span></li></ul>\n</div>\n</div>", ["I was the head programmer for the project. I wrote the code to read the finger positions and alter the equalizer values. I also built the GUI.", "I contributed ideas throughout the design process and gave direction on how those could be implemented.", "I worked on navigating through the API documentation and understanding how to utilize Leap Motion.  "]], ["Smart Runner", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>All of the people in our group run cross country. We decided to try to make an app that would help us go on our runs by giving us useful information about what is going on outside (weather, neighborhood, etc.). From that, our website would be able to give us a ranking on how the conditions would be throughout the day.</p>\n<h2>What it does</h2>\n<p>Smart Runner gives you a ranking on how nice the weather is in your location to go for a run. It will give you a ranking based on weather and other important factors.</p>\n<h2>How we built it</h2>\n<p>We decided Bluemix and Node Red would be good way to implement all of the factors into our site, and HTML with CSS would be the best to have on the site itself. </p>\n<h2>Challenges we ran into</h2>\n<p>Coming into the competition, none of us knew about Bluemix, Node red, or Watson, which made it really hard to integrate all of those pieces together.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We're proud of learning all of this and putting it all together into a semi-functional website in less than 48 hours.</p>\n<h2>What we learned</h2>\n<p>We learned how to use Bluemix, Node red, Watson, quite a bit more about websites, and android apps.</p>\n<h2>What's next for Smart Runner</h2>\n<p>We plan to add a route system, and add in several factors to our point system. These factors would be day/night, neighborhood, and your schedule from Google Calendar. The ranking would subtract points for it being nighttime, the route being in bad neighborhoods, and it would subtract points for the times filled in on your schedule.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bluemix\">bluemix</a></span></li><li><span class=\"cp-tag\">node-red</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://iotstarterlse.mybluemix.net/\" rel=\"nofollow\" target=\"_blank\" title=\"http://iotstarterlse.mybluemix.net/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>iotstarterlse.mybluemix.net</span>\n</a></li>\n<li><a href=\"http://smartrunner.tech/\" rel=\"nofollow\" target=\"_blank\" title=\"http://smartrunner.tech/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>smartrunner.tech</span>\n</a></li>\n<li><a href=\"http://smart-runner.net/\" rel=\"nofollow\" target=\"_blank\" title=\"http://smart-runner.net/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>smart-runner.net</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I helped figure out and program on Node Red, which was quite the challenge.", "I primarily worked on trying to implement an app infrastructure into the main code. I would've completed the app, but problems with the GUI caused a bottleneck that halted the progress of the development.", "I worked on the BlueMix Node-RED backend part that generates the rating of the day.", ""]], ["Predicting Hospital Readmissions", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>What it does</h2>\n<p>This project utilizes regression in order to predict hospital readmissions in order to minimize additional of costs of hospitals.</p>\n<h2>How I built it</h2>\n<p>The model training was completed in Python, while R was used to visualize and process the data.</p>\n<h2>Information</h2>\n<p>Predictions and code are located in the linked GitHub repository.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/r\">r</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/lollyluann/hospitaldata\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/lollyluann/hospitaldata\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["Dungeon Divers", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Dungeon Divers – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/445/439/datas/gallery.jpg\"/>\n<p>\n<i>Gameplay</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>The inspiration came from old dungeon crawlers that while fun, left us wanting more. Thus, we wanted to make a dungeon crawler of our own.</p>\n<h2>What it does</h2>\n<p>Short and lethal, expect to die often if you do not make the correct decisions on how to spend your wisps.</p>\n<h2>How we built it</h2>\n<p>We made the sprites using Aseprite, composed the music with FL Studio, and did all of the programming in Game Maker Studio.</p>\n<h2>Challenges we ran into</h2>\n<p>Team members had other obligations that they had to attend to during the competition. One of our programmers lost his internet on his computer.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>The marriage of sprites and programming that elevate the graphics. Everything seen and heard in the game is original and made by our team.</p>\n<h2>What we learned</h2>\n<p>How to effectively collaborate with team members using different mediums.</p>\n<h2>What's next for Dungeon Divers</h2>\n<p>Enemy variety, shops, rankings.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/gamemaker\">gamemaker</a></span></li></ul>\n</div>\n</div>", ["", "", ""]], ["Quantify", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Quantify – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/445/432/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Quantify – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/445/433/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Quantify – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/445/434/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Through years of school, it has been tough to check when you have 20 different units, if the answer you got has the right dimensions, but no longer.</p>\n<h2>What it does</h2>\n<p>It is a program that makes units simplified version. It presents the user with tons of different combination of corresponding units so the user can choose which one to use.</p>\n<h2>How we built it</h2>\n<p>We used ECMAScript 6.0 and published it on GitHub Pages. Quantify is basically consist of 4 parts, inputting math equation, evaluating the equation, finding corresponding units, and rendering those units. For inputting and rendering, we used Mathquill library, which converts readable math equation into LaTeX expression or vice versa. We wrote a several number of regular expressions to recursively evaluate the LaTeX math equation. We then used Breadth-First-Search algorithm to go through all the combination of units and see if it matches with the evaluated unit.</p>\n<h2>Challenges we ran into</h2>\n<p>Finding bugs and continuous debugging in evaluation process took the most of our time.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We are proud of it after 40 hours of trying to hack a project that it highly functional in everyday lives of people in Stem field, we finally got it to work.</p>\n<h2>What we learned</h2>\n<p>Application of scientific and mathematical concepts in programming. Every derived unit can be broken down into combination of base units, and base units can be combined to form derive units.</p>\n<h2>What's next for Quantify</h2>\n<p>The next step for Quantify is to expand its database so it can process any unit that anyone can think of. More math constants and functions will be implemented to the program as well. This program could be a fundamental part of a students life such as Wolfram Alpha. Furthermore, we are looking forward to support optical character recognition or speech recognition to let users more easily input math equations.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/parkjs814/Quantify\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/parkjs814/Quantify\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"http://quant1fy.tech\" rel=\"nofollow\" target=\"_blank\" title=\"http://quant1fy.tech\">\n<i class=\"ss-icon ss-link\"></i>\n<span>quant1fy.tech</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["Inspirational quote generator", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Inspirational quote generator – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/445/475/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>I wanted to code this to do my part to help people who are experiencing online harassment fell better. :)</p>\n<h2>What it does</h2>\n<p>It gives you a random quote written by either a philosopher or a famous person in order to lift your spirits.</p>\n<h2>How I built it</h2>\n<p>I used ruby and made an array and then randomized the contents of said array to give a random quote.</p>\n<h2>Challenges I ran into</h2>\n<p>I had to learn Ruby.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>I learned Ruby.</p>\n<h2>What I learned</h2>\n<p>Ruby.</p>\n<h2>What's next for Inspirational quote generator</h2>\n<p>I hope to make it into a website or perhaps even an application. I also want to add more quotes to it, one daily.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ruby\">ruby</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://repl.it/EWWm/1\" rel=\"nofollow\" target=\"_blank\" title=\"https://repl.it/EWWm/1\">\n<i class=\"ss-icon ss-link\"></i>\n<span>repl.it</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["Math Quiz Bowl", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>We wanted to be able to practice quiz bowl from everywhere, and track people's progress</p>\n<h2>What it does</h2>\n<p>Shows Quiz bowl practice problems</p>\n<h2>How we built it</h2>\n<p>Android Studio</p>\n<h2>Challenges we ran into</h2>\n<p>We had to learn Android studio and xml</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Learning to program in Android Studio</p>\n<h2>What we learned</h2>\n<p>How to program in Android Studio</p>\n<h2>What's next for Math Quiz Bowl</h2>\n<p>Group competitions</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/0thPlace/Quiz_Bowl\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/0thPlace/Quiz_Bowl\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I found a database that was crucial in our program and helped come up with concepts/ideas", "I helped generate question, and compromise a plan with my team. Learned and help discover new things within Android-studio.", "I helped do the research, get questions, and offered support in other areas.", ""]], ["Virtual Ensemble", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Virtual Ensemble – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/445/510/datas/gallery.jpg\"/>\n<p>\n<i>Web app</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Virtual Ensemble – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/445/511/datas/gallery.jpg\"/>\n<p>\n<i>Mobile app</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Love for music.</p>\n<h2>What it does</h2>\n<p>This application lets anyone play a single or multiple instruments at a time using leap motion device. Also, they can listen to multiple musicians playing their instruments on this web app or on their mobile phone.</p>\n<h2>How we built it</h2>\n<p>We used leap motion to identify the instrument being played and send that information to the cloud server. Multiple such devices can send their information concurrently. Users can now listen to this orchestra which has instruments concurrently playing from all musicians.</p>\n<h2>Challenges we ran into</h2>\n<p>Processing real time data with low latency.\nConcurrently playing multiple musical instruments.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Concurrently playing multiple musical instruments</p>\n<h2>What we learned</h2>\n<p>Efficiently handling musical data</p>\n<h2>What's next for Virtual Ensemble</h2>\n<p>There is a lot of scope.\nThis can be improved to have separate channel for each conductor with their orchestras.\nAlso, users can mix-n-match channels for innovative tunes.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/leap-motion\">leap-motion</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ajax\">ajax</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/amazon-web-services\">amazon-web-services</a></span></li><li><span class=\"cp-tag\">rest</span></li><li><span class=\"cp-tag\">music</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/hardware\">hardware</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/web\">web</a></span></li><li><span class=\"cp-tag\">iot</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/windows\">windows</a></span></li></ul>\n</div>\n</div>", ["", "", ""]], ["House Fishing dot NET", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>What really inspired our creativity within this project was the way that housing prices were given to us. Not only were they incompetent and incomplete, we knew we could create a superior edition to all others.</p>\n<h2>What it does</h2>\n<p>This website graphs the housing prices for multiple states with a drop down menu to choose between them.</p>\n<h2>How we built it</h2>\n<p>We primarily used HTML and JAVASCRIPT when building this, but we did some concept work and back-end calculating using Python.</p>\n<h2>Challenges we ran into</h2>\n<p>The biggest challenge we ran in to was that JAVASCRIPT could not import local files that were of the type csv or text without using software that we were unfamiliar with.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>We knew almost nothing about JAVASCRIPT and the implications it has on data but somehow persevered through and came out with a finished product.</p>\n<h2>What we learned</h2>\n<p>We learned multiple things. The first thing we learned was how to use the command prompt with pip, bash, python, and git. We also learned about the implementation of javascript within html.</p>\n<h2>What's next for House Fishing dot NET</h2>\n<p>Housing Cost dot NET will be the best website globally to show the housing prices to those willing to know.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag\">csv</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/dstaatz/dstaatz.github.io\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/dstaatz/dstaatz.github.io\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"http://www.house-fishing.net/\" rel=\"nofollow\" target=\"_blank\" title=\"http://www.house-fishing.net/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>www.house-fishing.net</span>\n</a></li>\n<li><a href=\"http://45.55.146.118/\" rel=\"nofollow\" target=\"_blank\" title=\"http://45.55.146.118/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>45.55.146.118</span>\n</a></li>\n<li><a href=\"https://dstaatz.github.io/\" rel=\"nofollow\" target=\"_blank\" title=\"https://dstaatz.github.io/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>dstaatz.github.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]]]