[["OZCOIN", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"OZCOIN – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/328/458/datas/gallery.jpg\"/>\n<p>\n<i>opening screen</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<blockquote>\n<p>“Put your thinking caps on for short and long term privacy technologies that defend fungibility… homomorphic encrypted value, committed (hidden) transactions… If your business depends on the success of bitcoin, it depends on the fungibility of bitcoin. You can quote me on that.”</p>\n<ul>\n<li>Adam Back, HashCash inventor, bitcointalk 11/14/13</li>\n</ul>\n<p>“To stop this nonsense [coin validation efforts] we have to make it impractical to pull off by changing the default behavior in the bitcoin ecosystem. We consider the lack of a central authority to be an essential virtue, which means that we can’t be protected by one either. We must protect ourselves. This means things like avoiding address reuse, avoiding centralized infrastructure, adopting— and funding!— privacy enhancing technology.”</p>\n<ul>\n<li>Gregory Maxwell, Core Developer, bitcointalk </li>\n</ul>\n</blockquote>\n<h2>Summary</h2>\n<pre class=\"language-nolang\"><code>The goal of OZcoin (OZRS) is to create freedom through fungibility. What does it mean for a currency to be fungible? Inherently, any unit of OZRS is freely exchangeable and interchangeable with another unit of OZRS. Bitcoin, for example, is not inherently fungible and relies on privacy preserving measures to protect it. OZRS has fungibility built in. In order to create OZRS, we had to tackle two distinct problems that allow a party to discriminate against a transaction or against some set of coins: linkability and visibility. We utilized existing architectures and cryptography found in CryptoNote and Confidential Transactions and added OZRS, short for “One-time Zero-sum Ring Signatures”.\n</code></pre>\n<h2>Feasibility</h2>\n<p>Scalability and feasibility are paramount to the architecture of any cryptocurrency. OZcoin has additional security features in order to ensure privacy and anonymity. As such, there is additional overhead (time and space cost) per transaction, but there’s no price for fungibility and freedom from discrimination.</p>\n<h2>Uniqueness</h2>\n<p>OZcoin is unique in that it requires uniformity amongst all transactions, so that de-anonymizing transactions is not possible. Although it builds upon existing architectures like Monero, CT, etc. OZcoin offers a unique combination of the security features of each with a new ring signature.</p>\n<h2>Implementation and Execution</h2>\n<p>Scalability and feasibility are paramount to the architecture of any cryptocurrency. OZcoin has additional security features in order to ensure privacy and anonymity. As such, there is additional overhead (time and space cost) per transaction, but there’s no price for fungibility and freedom from discrimination.</p>\n<h2>Need</h2>\n<p>OZcoin fulfills unmet needs as both a currency and as a platform technology. When money is not fungible, it introduces itself to and creates political and regulatory hurdles that vary across jurisdictions. How can global, borderless cryptocurrency truly be both those things if networks are laced with jurisdictional traps?</p>\n<p>Fungibility makes discrimination impossible - this paves the path for other tools of democracy to be built, like anonymous voting, data ownership, personal privacy, etc. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/go\">go</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bootstrap\">bootstrap</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://git.hackcollegecrypto.com/groups/ozcoin\" rel=\"nofollow\" target=\"_blank\" title=\"https://git.hackcollegecrypto.com/groups/ozcoin\">\n<i class=\"ss-icon ss-link\"></i>\n<span>git.hackcollegecrypto.com</span>\n</a></li>\n<li><a href=\"https://github.com/cfromknecht/OZcoin\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/cfromknecht/OZcoin\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["SnipBit", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/kSFwqTBYFxw?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n</ul> </div>\n<div>\n<h2>Summary:</h2>\n<p>SnipBit is a bitcoin micropayment platform that brings payments to the browser and eliminates the subscription and paywall problems of the web. By utilizing bitcoin and micropayment channels, content producers will be able to easily monetize their content and consumers will be able to access the premium content they desire with one click. This, overall, makes for a better web experience for everyone as content producers are incentivized to produce quality content and consumers are able to finally browse the web a la carte style.</p>\n<h2>Feasibility:</h2>\n<p>The SnipBit platform is extremely scalable. By providing the content producers with an api as well as common plug-ins for the most popular CMS’s like Wordpress and Drupal, they can set up their content in a matter of minutes. Any content producer, regardless of size or geographic location will have the same level of access to these tools. The consumer only has to have a bitcoin wallet so it is mostly limited by the amount of users with bitcoin.</p>\n<h2>Uniqueness:</h2>\n<p>The idea of micropayments and in browser payments has been around since the creation of the internet, but has been unable to come to fruition because of the traditional financial infrastructure. With bitcoin, we can now tap in to the true potential of micropayments. Our system is completely open and allows the consumer to use whatever wallet they would like in order to pay for the content. We aimed at sticking to the core benefits and avoided a platform like changetip that locks user into a closed system and holds the control of the bitcoin.</p>\n<h2>Functionality:</h2>\n<p>Over the course of the month, we were able to accomplish many of the key features of our platform. We currently having a working MVP that allows a user to signup for a new wallet and send and receive out of that wallet. The extension currently shows the transaction history after a payment has been made and is programed to respond to the BIP 70 payment protocols. Because of this, when the user clicks on a bitcoin payment button on the content producer’s site, the extension is alerted and the consumer can confirm the payment with only one more click. The extension is never opened and the smooth web experience is maintained. BIP 70 allows the client to verify where the Payment Request is coming from therefore eliminating man-in-the-middle attacks. The user can trust the payment information just as he could trust an SSL protected site. </p>\n<h2>Need:</h2>\n<p>A platform like SnipBit was envisioned since the creation of the internet and the experience for consumers and content producers has been drastically hindered because of the lack of this platform. Sites like the New York times currently only monetize 3% of their viewers meaning all the rest turn away as soon as the first paywall pops up. By allowing micropayments and the user to sample the content before they commit to a longer term commitment, content producers will be able to increase revenue through these one off payments as well as those consumers who go on to purchase a longer subscription after enjoying the sample content a la carte style. With this extra revenue, many content producers will finally be able to switch to an alternative revenue model. In turn the average web user will finally be able to browse the web how it was intended. Without the constant interruptions of paywalls and advertisements and the internet will return to a true environment where information has freedom.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bitcoin\">bitcoin</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/chrome\">chrome</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag\">bip-70</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://198.199.70.166:8888/\" rel=\"nofollow\" target=\"_blank\" title=\"http://198.199.70.166:8888/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>198.199.70.166</span>\n</a></li>\n<li><a href=\"https://github.com/snipbit\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/snipbit\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Built server code and chrome extension", "I acted as the project manager for SnipBit for the duration of the hackathon. My responsibilities included delegating tasks amongst the different developers, provided guidance for overall project goals and tasks, as well as acted as the main communication portal for the team. ", "UI / UX and chrome extension design", "", ""]], ["BitFor.me", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"BitFor.me – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/328/249/datas/gallery.jpg\"/>\n<p>\n<i>Post Overview</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"BitFor.me – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/328/250/datas/gallery.jpg\"/>\n<p>\n<i>Bitcoin Deposit</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"BitFor.me – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/328/251/datas/gallery.jpg\"/>\n<p>\n<i>Home Page</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"BitFor.me – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/328/252/datas/gallery.jpg\"/>\n<p>\n<i>Registration Page</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"BitFor.me – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/328/253/datas/gallery.jpg\"/>\n<p>\n<i>Login Page</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h1>Hack Western 2015 - BitFor.me</h1>\n<h2>Process</h2>\n<ol>\n<li>User loads Bitcoin into webapp</li>\n<li>User creates simple task that others can easily do, such as purchasing coffee.</li>\n<li>Another user finds the task based on location, and accepts it.</li>\n<li>That user then completes the task by, for instance, purchasing coffee and delivering it to the first user.</li>\n<li>After the task has been completed, the purchaser marks the transaction as complete and the Bitcoin is sent from the first user to the second.</li>\n<li><del>Both users can give either positive or negative feedback, based on how the transaction went</del>. Coming soon.</li>\n</ol>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ajax\">ajax</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://BitFor.me\" rel=\"nofollow\" target=\"_blank\" title=\"http://BitFor.me\">\n<i class=\"ss-icon ss-link\"></i>\n<span>BitFor.me</span>\n</a></li>\n<li><a href=\"https://github.com/jmichaelbarker/Hack-Western-2015\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/jmichaelbarker/Hack-Western-2015\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on design, logo creation, layout and css fixes, and form submission, as well as SQL and PHP integration for forms.", "Worked on the front end and designing.", "I mainly worked on the backend. Stuff with PHP and MySQL, Ajax and so forth. I also helped with the front end of some pages. ", "I helped with the front end and back end coding for the site helped in the designing of the site and the visuals"]], ["Cryptid", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/whRBZZjm7ks?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"Cryptid – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/328/706/datas/gallery.jpg\"/>\n<p>\n<i>Website UI for verifying IDS</i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Cryptid – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/328/707/datas/gallery.jpg\"/>\n<p>\n<i>Cryptid program for generating and verifying IDs</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Summary</h2>\n<p>Cryptid is the next generation of identification. Cryptid eliminates the possibility of counterfeits by adding factors of authentication and encryption that is backed a distributed global network. It benefits a group or organization of any scale by allowing them implement a secure method of managing the verification of official members. \nUtilizing existing standards, such as ISO 19794-2 for our fingerprint templates and AAMVA and ANSI personal information format standards, our system can be integrated with existing software and hardware (fingerprint scanners) and easily understood. Our current version of Cryptid uses Factom as its blockchain backend. For encryption we use AES-512-CBC for data encryption and RSA-4096 for signing and verification.</p>\n<h2>Feasibility</h2>\n<p>Cryptid has been designed with scalability and feasibility in mind. A new identity costs as little as $0.05 USD, and is stored on the blockchain removing the need to handle any in house data storage (with the possibility of a breach). Because the data is on the blockchain, the maintenance cost of our software is minimal. Additional cost is only incurred if an existing ID must be modified. Since Cryptid ID strings can be stored on anything that can store 32-44 bytes of data, that means it can be implemented into current reading systems such as magstripe readers or smart card readers. Additionally, a smartphone can be used for a sort of optical data transfer -- most generally, displaying a QR code to be scanned via scanner or webcam.</p>\n<h2>Uniqueness</h2>\n<p>From the vast research we’ve done since beginning this project, we’ve found our project to be completely unique. The only organizations really focusing on any sort of secure identification were the DOD and state endorsed passports. The problem with those systems are simply that they are not in public domain and are not as secure as Cryptid. The open nature of Cryptid allows it to be more widely adopted, adapted for security and integrated into unique systems. The use of the blockchain for immutable, effectively unhackable, identity storage is extremely novel and not seen before in the industry.</p>\n<h2>Implementation and Execution</h2>\n<p>Our product is currently 100% viable and ready, and has been tested. We could serve a client and implement our verification system on top of their current infrastructure for an extremely affordable price. Once our verification system was in place, we are capable of handling any quantity of identities within minutes. Our system is also easily integrated with any current identity system, so an organization that already uses a form of identification could easily switch to Cryptid.</p>\n<h2>Need</h2>\n<p>There is need in both small and large organizations as our product is not only affordable, but also secure. The biggest advantage of Cryptid is it’s complete identity security. With Cryptid identity theft is a thing of the past. A thief no longer needs only to steal your wallet to masquerade as their victim's identity. Below are three identity implementations of various security levels and their flaws compared to Cryptid:</p>\n<p><strong>Rochester Institute of Technology Student Identification Cards</strong>\nRIT, like almost every other university uses a unique number stored on the magnetic stripe for authentication. RIT in particular uses ID cards for building access, dorm access and billing. This is considered one factor of authentication and is easily susceptible to replay attack. All you need is a magnetic stripe encoder and a picture of their identification card and you have the same access as the card holder. The advantage of Cryptid in this scenario is invulnerability to replay attacks as well as additional factors of authentication.</p>\n<p><strong>United States Department of Defense Common Access Card</strong>\nThe DOD CAC uses all three factors of authentication, however the issuance of the card is limited to only DOD employees and contractors. The DOD CAC also calls back to one central database (RAPIDS -- which is vulnerable to potential data breach). The advantage of Cryptid in this scenario is the distributed nature of the block chain, further securing the data.</p>\n<p><strong>ICAO Machine Readable Travel Documents (Passports)</strong>\nPassports use two factors of authentication (something you have -- the passport -- and something you are -- the fingerprint). However, like DOD CAC they also call back to a central database. They are also far more expensive to make as they require expensive EEPROM contactless chips to store and transmit data. The advantages of Cryptid here are low cost and again the distributed nature of the block chain.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--2\">c#</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/golang\">golang</a></span></li><li><span class=\"cp-tag\">factom</span></li><li><span class=\"cp-tag\">rest</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--3\">c++</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/visual-studio\">visual-studio</a></span></li><li><span class=\"cp-tag\">sweat</span></li><li><span class=\"cp-tag\">tears</span></li><li><span class=\"cp-tag\">carpal-tunnel</span></li><li><span class=\"cp-tag\">illuminati</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://cryptid.xyz\" rel=\"nofollow\" target=\"_blank\" title=\"http://cryptid.xyz\">\n<i class=\"ss-icon ss-link\"></i>\n<span>cryptid.xyz</span>\n</a></li>\n<li><a href=\"https://github.com/CryptidID/Cryptid\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/CryptidID/Cryptid\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"https://git.hackcollegecrypto.com/cryptid/crypt\" rel=\"nofollow\" target=\"_blank\" title=\"https://git.hackcollegecrypto.com/cryptid/crypt\">\n<i class=\"ss-icon ss-link\"></i>\n<span>git.hackcollegecrypto.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on everything except the factom API!", "Factom, and some other things. Factom API is now on NuGet!"]], ["Knot", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Knot – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/328/604/datas/gallery.jpg\"/>\n<p>\n<i>Knot</i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2><strong>Summary</strong></h2>\n<p>Knot is mobile commerce technology that allows peers to exchange value.   We use unique network algorithms including cost, time, place, supply and demand, amongst others to connect buyers and sellers of value of almost anything, anytime, anywhere.  As a mobile application built for iOS, we use Xcode and AWS for our stack and storage.  Also we referenced and implemented concepts of the Bitcoin protocol and Blockchain technology.</p>\n<h2><strong>Feasibility</strong></h2>\n<p>Scale is possible but execution matters more.  There are many variables and inputs in our Knot network algorithm that we will validate.  Though it is easy enough to supply content postings, we want to build a useful and engaging product that is helpful, reliable and secure.  Once we have accomplished this, we feel that our product can scale rapidly based on our location app features of localized to global networks.</p>\n<h2><strong>Uniqueness</strong></h2>\n<p>What differentiates Knot from existing marketplaces today like eBay, Amazon, Craigslist and new startup competitors like OfferUp is our unique algorithm and blockchain implementations.  With any new technology, getting new users to adopt this is difficult and time consuming so we will focus on building a great product for our early adopter, core users first and foremost.  </p>\n<h2><strong>Implementation and Execution</strong></h2>\n<p>Knot executed well on our project goals.  This project evolved from an earlier version of a proof of concept, so we wanted to make a functional app.  While we did create a use case for posting and securing objects, the transactional component still needs to be implemented.  There are also still some parts of the project that will need to be addressed before we can make Knot revenue generating, including legal and payment processing.</p>\n<h2><strong>Need</strong></h2>\n<p>Mobile commerce is gaining more widespread adoption, especially as mobile technology becomes more ubiquitous and standard.  This is our core reason to build for mobile first.  The fundamental problem we are trying to solve is the exchange of value between peers using digital technology.  Our solution Knot must be simple, fast and secure.  Then it can become trusted and reliable for the network.  If we can save buyers money and time this will be a huge win.  Everyone can benefit from saving money and having more time.  On the flip side, if we can help sellers list their products and create a market of high quality products and a demand that is timely and profitable this benefits the merchant sellers.  All of this is made possible using modern digital technologies and staying ahead of the curve with new advancements like the Blockchain.</p>\n<p>More details about the project below:</p>\n<p><em><strong>Inspiration:</strong></em>\nThe Knot project has evolved over time, but its foundation remains true and centers around the idea that value transferred through technology is better, faster, cheaper and more secure.  The beginnings for the project originate from a BlockChain University Hackathon at the Microsoft Reactor incubator in San Fransisco over Halloween weekend.  This is where Nathan and Tim met and formed a team.  The original theory was to find a valuable way for merchants to use the Blockchain and Bitcoin payment protocol as a service with their customers (inputs) and vendors (outputs).  </p>\n<p>Value could be exchanged and flow via a merchant such as Blue Bottle coffee throughout its network of customers, coffee suppliers and employees.  Our proof of concept evolved into something of a p2p exchange of value locally or globally.  We proposed a question if it was possible to trade value between peers of almost anything, anytime, anywhere by using technology.  It would need to be engaging, fast and secure.</p>\n<p>Our proposed theory we wanted to answer was:\nHow to trade value between peers, across complex distances and chaotic time intervals, simply and quickly, securely and universally, in a modern digital and globalized system, that is more interconnected, yet protectively capitalistic and cautiously trustworthy when it comes to money and exchange? </p>\n<p>Knot was selected as our name because of its connotations to security and the Blockchain.  Originally we were looking to emphasize a trustless digital solution for exchanging value, and so we came up with the Knot Complex.   Like a link or block in the chain, knots can be tied together to strengthen and build off one another.  The endless knot is our logo because it symbolizes wisdom, eternity, and compassion.  </p>\n<p><em><strong>What Knot does:</strong></em>\nKnot's a network as a technological solution of value connections.  Simplicity, openness, timeliness, security, trust.</p>\n<p>Knot is a technology solution of innovation that has the potential to be a win-win-win: Consumers can win by getting the products the want and need with pricing that best suits their preferences, essentially reducing their cost of living. Sellers/Merchants can win by competing on high-quality products at good prices, without the risk of losing out to less scrupulous sellers that compete through deception and inferior quality. And entrepreneurs and innovators like Knot can win by devising new ways of serving consumers in the system.  It is a whole network effect that benefits the sum of its relational parts.</p>\n<p>To create these complex tools and technology as a reliable system of exchange, one that is the sum of its relational parts, one that is accessible and valuable to all, this requires complex nodes and micro-networks to be simplified to their core: ease of use, measured in time, and securely reliable.  Knot Complex Theory is the proposed solution to this problem.</p>\n<p>Our goal is to make Knot something you want to use.  Something that is engaging and fun.  Keep it simple.  For consumer buyers and sellers.  How do you make everyone a winner?  Just like the blockchain is decentralized and trustless, so too is the Knot network and everything it ties together.  We’re attempting to hit both sides of the coin on this one for supply and demand.  Centers around the connections of people that want to get rid of stuff, and people that want stuff, essentially everyone. By providing people with an easier way to use buy and sell the stuff they want and need we’re opening doors for a lot of people. Amazon, Ebay, Craigslist, Shopify, OpenBazaar, all these platforms provide these same abilities but not always in the most user friendly way, or even the most productive way. We take away the anonymity of Ebay so you know you’re interacting with a real person, like with AirBnb where you actually message the person that you’re contacting and can coordinate transaction details. By implementing online sales and also providing easy access to coordinate in-person meetups we let users interact on their own terms. The key here is frictionless interaction.  Knot is the platform, where users provide the content and the use cases.  If you can do all this within the Knot app easily, then the advantage is clear for us as a growth engine and optimization/efficiency machine for users who want to get the most out of the experience.</p>\n<p><em><strong>How we built Knot:</strong></em>\nWe built an iOS app using Xcode and AWS.  This is our MVP and will be evolved, based on our product roadmap and customer feedback with early beta testers.  </p>\n<p><em><strong>Challenges we ran into:</strong></em>\nDifficult to build a functional MVP of the product in such a condensed four-week timeframe.  It was also challenging to work on this side project with other priorities and the holidays in between.  We managed to use the best of our limited time and resources to accomplish our goals.  Working remotely but also meeting up in person for the project helped to ensure we were aligned on our goals and prioritize to get on the same page.</p>\n<p><em><strong>Accomplishments that we are proud of:</strong></em>\nOur first build submitted to the App Store with TestFlight.  Seeing the Knot product live and in a \"wild\" test environment is fulfilling to see and have achieved.  Also our logo, website, data storage solution and user logins were big developments for us.</p>\n<p><em><strong>What we learned:</strong></em>\nFocus and patience.  We must prioritize what is mission critical and limit ourselves to do this and execute.  Sam Altman has written a good write up about the Startup Playbook we used as a helpful tool.  Effective prioritization and killing ideas to focus on the most important needs is a learned skill.  We got better at executing as deadlines approached making our limited amount of resources more useful and directly targeted.  </p>\n<p>The best parts of the Hackathon were that it created a forcing function with milestones.  Seeing all of the other projects and teams submitting their ideas and milestones forced us to follow suit.  And it helped to plan and organize our thoughts and ideas into an organized manner for a functional product and project. </p>\n<p><em><strong>What's next for Knot:</strong></em>\nThis is all theory, and a side project.  We will test, build and validate our assumptions to confirm or refute this thesis.  If worth pursuing thereafter, with a viable product and a relative business model, one which has the potential to earn immediate revenues and ensure profitability, we will reevaluate its viability, and/or to begin to take the next steps to put in motion and create a sustainable company, and an actual business with customers.</p>\n<p>We would like to validate and test our ideas for Knot with beta invited customers.  With feedback and support, we have a product roadmap of features and functionality that we would like to implement.   However it is important to us to become extremely competent, in our execution and prove we are capable and trustworthy before we start implementing new ideas and features.  There are also legal and financial requirements we need to clarify and lock down if we’re going to be involved with customers' payments and money.  Then we need to provide a level of trust and verification that we have dealt with the intermediary steps, processing transactions, securing sensitive information, making transactions easy and painless before rolling out to more users and more app releases.   It is important to master the fundamentals and core functionality of our app before we expand or release to any wider audiences.  </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/iphone-sdk\">iphone-sdk</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xcode\">xcode</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/amazon-web-services\">amazon-web-services</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://www.knotcomplex.com\" rel=\"nofollow\" target=\"_blank\" title=\"http://www.knotcomplex.com\">\n<i class=\"ss-icon ss-link\"></i>\n<span>www.knotcomplex.com</span>\n</a></li>\n<li><a href=\"https://git.hackcollegecrypto.com/corvos/Knot\" rel=\"nofollow\" target=\"_blank\" title=\"https://git.hackcollegecrypto.com/corvos/Knot\">\n<i class=\"ss-icon ss-link\"></i>\n<span>git.hackcollegecrypto.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["Bitcoin Accepted Here", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Bitcoin Accepted Here – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/326/089/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>A better way to search merchants that accept bitcoin in the world</p>\n<h2>What it does</h2>\n<p>It helps users to easily find out merchants that accept bitcoin, by proximity, by countries list, by categories, by name, by map.\nIt generates usefull statistics about the diffusion of shops in the world.</p>\n<h2>How I built it</h2>\n<p>I wrote a PHP parser that grabs all bitcoin points; i developed an Android app to view them.</p>\n<h2>Challenges I ran into</h2>\n<p>Coding with native PHP and Java, without any framework or library/addon.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Categorize most of the shops in countries/cities and categories.</p>\n<h2>What I learned</h2>\n<p>I improved my \"academic\" coding skills.</p>\n<h2>What's next for Bitcoin Accepted Here</h2>\n<p>A web version.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/eclipse\">eclipse</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php5\">php5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/sql\">sql</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mysql\">mysql</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/phpmyadmin\">phpmyadmin</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/openstreetmap\">openstreetmap</a></span></li></ul>\n</div>\n</div>", [""]]]