[["StockAssist", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"StockAssist – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/321/909/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"StockAssist – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/005/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"StockAssist – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/006/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Humans will invest in stocks they believe in and sell stocks they don’t believe in; it only makes sense to be logical when dealing with matters of money and finance. Thus, accurately predicting stock changes requires knowing which companies are currently trending in the public’s favor. What StockAssist brings to the table that is unique to our generation is generating predictions based on social media trends. Older generations may look to news sources to inform them of which stocks to invest in, but this implies a lag of possibly weeks as news sources need to gather their data and edit it before publishing. By the time the news reaches the crowd, its advice may already be outdated. With StockAssist, we cut out this lag entirely and give you the real-time general consensus of how a company stands by data mining and implementing machine learning on social media posts. This will give the most accurate prediction of how stocks will fare, and thus is revolutionary in advising people with their stock investment decisions. </p>\n<h2>What it does</h2>\n<p>This web application will take the stock in question and collect all the news, social media, and statistical data about that stock. It will then run this data through our machine learning algorithms to analyze how well the company is doing in the eyes of the public. With this application, the users will only need to check one place to find an aggregated analysis of their stocks from a diverse, real-time generated data set. </p>\n<h2>How I built it</h2>\n<p>The first iteration of the application was written in Go. After discovering incompatibility issues with the Azure platform, the application was completely rewritten in javascript using Node.js. The application consists of two main parts the server and client, with each communicating with another through http requests.\nThe server is where all of the heavy data manipulation is conducted. The server receives a query from the client via an HTTP GET request. The server then takes that query and using Twitter’s REST search api finds 1000 tweets that match that query. Then using regular expressions, the server strips and removes all the referenced URLs (in order to make the semantic analysis easier). After the data has been prepared, we perform an analysis of the tweets using semantic analysis tools hosted on Azure. The analysis tool then returns a score based the words used, and from that we generate a confidence statistic.\nThe second part of the application consists of the client. As mentioned beforehand, the client sends a query to the server, and the server in turn returns a summary of the analysis it performed. The client then generates a stock recommendation based on a determining algorithm, displays a rough summary of that data using a pie chart, and gives a confidence statistic. The client was written in the standard HTML5/CSS/JavaScript while reference several other open source libraries for the visuals and the communications.     </p>\n<h2>Challenges I ran into</h2>\n<p>Developing a web application hosted on Microsoft Azure was our biggest challenge. Initially, our team used Go to develop the back-end of the application; however, Azure never seemed to be compatible with Go. Thus, we had to switch languages, and completely re-write the entire back-end in Node.js. Another challenge we faced along the lines of Microsoft Azure was figuring out the Machine Learning. It was difficult to create training models with the help of different statistics such as chi-squared. We attempted to create an optimal training model on twitter feeds based on binary sentiment analysis. Upon building the training models, it was another challenge to create a predictive experiment based on the optimized training model, and hosting the solution on the web. Although we couldn't get the machine learning algorithm to work, we made great headway in learning this sector of Microsoft Azure. </p>\n<h1>Accomplishments</h1>\n<p>Despite all the challenges present, we were able to finally implement Microsoft Azure as a web host for our application. Even though we did not completely figure out the Microsoft Azure Machine Learning, we made great progress in learning how to utilize this tool to perform sentiment analysis on twitter feeds. In order to actually create the machine learning, we used a direct approach with sentiment analysis through node.js. On the front-end, we were able to coordinate all the back-end to co-exist with the front-end. The most important accomplishment was to develop the Azure hosting service, along with our web application.</p>\n<h2>What I learned</h2>\n<p>This hackathon was full of twists and turns and we definitely learned a lot from it. From how to use Azure to what web frameworks work best with our front end, our general takeaway for this hackathon was to remember to reach out for help. The Microsoft team was immensely effective in mentoring us and helping guide us to reach our goals; it’s been a game changer for us and it’s something we’ll be sure to do in future hackathons. </p>\n<h2>What's next for STOCKASSIST</h2>\n<p>We’d love to expand on every aspect of our app. This means we’d love to include more and more social media outlets to better refine our data set, and thus use this to refine our machine learning algorithm as well. We also believe that this app would be effective across more platforms - from mobile to tablets to smart watches. If there’s an influx of negative social media coverage for a particular company, having a mobile app ping our users would be highly effective in helping them save money in the stock market. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/azure\">azure</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/json\">json</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://stockassist.azurewebsites.net\" rel=\"nofollow\" target=\"_blank\" title=\"http://stockassist.azurewebsites.net\">\n<i class=\"ss-icon ss-link\"></i>\n<span>stockassist.azurewebsites.net</span>\n</a></li>\n<li><a href=\"http://stockassist.xyz\" rel=\"nofollow\" target=\"_blank\" title=\"http://stockassist.xyz\">\n<i class=\"ss-icon ss-link\"></i>\n<span>stockassist.xyz</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on machine learning (ML) though the Microsoft Azure package. Being the first time I was exposed to machine learning (ML), it was a major challenge to implement and execute; however, by the end, I learned a lot about ML and its application!", "Created the front end and was the designer. Presentation/marketing, management", "I wrote the backend twice. I first wrote the entire backend in Go; and then after discovering compatibility issues with Azure, I rewrote the entire server using Node.js. I also spent several hours with Heran learning and writing R scripts and interfacing with the machine learning APIs. I also helped out on the frontend by writing some of the HTTP requests and communication logic", "I created the front end with Michelle"]], ["NerfLock", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/Z1-FwH8cZek?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"NerfLock – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/976/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>How I built it</h2>\n<p>Kinect based image recognition system. Uses Microsoft's open source Project Oxford to verify facial features in comparison to test subject. Uploads match boolean and comparison value to Firebase server. Based on positive or negative image comparison, will either lock a door or shoot a Nerf Gun Blaster at the approaching subject (hardware implemented by Intel Edison). </p>\n<h2>What's next for NerfLock</h2>\n<p>Fully integrate Facebook API to populate \"verified\" individuals set through JSON queries.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/kinect\">kinect</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/azure\">azure</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/microsoft-project-oxford\">microsoft-project-oxford</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/visual-studio\">visual-studio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/intel-edison\">intel-edison</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/firebase\">firebase</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/facebook-login-api\">facebook-login-api</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--2\">c#</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/sampurnabasu/NerfLock\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/sampurnabasu/NerfLock\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on the facial recognition software using Project Oxford to compare realtime Kinect images to a preset file.  Also created front end interface of informational website.", "I worked on microsoft kinect recognition. When either user is approached or button is pressed, i screenshot the user with background removal to send photo file to azure blob storage for Project Oxford. ", "I worked on the Project Oxford API and making sure the windows server we created could connect with the firebase server and the azure server.", "I designed and built the hardware with an Intel Edison and the Nerf gun. I pulled the data from firebase and pulled the triggers of the Nerf gun by using 2 servo motors and twine. I opened a door if the the picture is matching and shot 2 rounds of 3 bullets if it was a stranger. I also got the data of users with Facebook api."]], ["What's in a Yelp?", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"What's in a Yelp? – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/192/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<h2>What it does</h2>\n<p>Potentially help predict a yelp rating based on the words used in the review</p>\n<h2>How I built it</h2>\n<p>Using the Beaker IDE platform</p>\n<h2>Challenges I ran into</h2>\n<h2>Accomplishments that I'm proud of</h2>\n<h2>What I learned</h2>\n<h2>What's next for What's in a Yelp?</h2>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag\">beaker</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li></ul>\n</div>\n</div>", [""]], ["In Brief", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"In Brief – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/978/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"In Brief – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/997/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"In Brief – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/015/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p><strong>Ever gotten the feeling that you're left out of a conversation just because you just don't have enough background information? So have we.</strong> Recently, major events have shocked the world, leaving people confused and wanting to be informed at the topic at hand: but what exactly should people look out for? How can people search for something when they don't know where to begin?</p>\n<h2>What it does</h2>\n<p>In Brief scrapes the internet looking for the most relevant pieces of information to help a user dive right into any conversation, whether it be about recent news, or just a topic in general. <strong>We grab descriptions from Wikipedia, the most current tweets on Twitter that mention the topic, recent news articles from Alchemy, and even the general sentiment on whether or not the public views a particular topic in a positive or negative light.</strong></p>\n<h2>How I built it</h2>\n<p>In Brief was built with Javascript on top of Python with Flask. Our team learned a lot with this new framework, while still relying on standard web development tools such as Bootstrap, Flexbox, Material Design Lite, and jQuery (for front-end), and BeautifulSoup with other tools for back-end development.</p>\n<h2>Challenges I ran into</h2>\n<p>Design was a major challenge of this process. We wanted to focus on getting the best project possible, and not just the best implementation possible. It took a lot of time and energy in defining exactly what we wanted and streamlining functionality to suit the user's need. Also, data and API availability was a huge problem: we had a goal in mind and the knowledge to do so, but the resources simply weren't there.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>At the end of the day, this was a huge accomplishment. Instead of hooking up to the usual one API, our team grabbed data from three APIs, really bringing the concept of \"data accumulation\" home.</p>\n<h2>What I learned</h2>\n<p>Really search hard for those resources such that your project has the most reach possible.</p>\n<h2>What's next for InBrief</h2>\n<p>Think about this: a lot of news applications can curate what the conversation is about, but a conversation can't exist without people. A large step forward would be linking InBrief to social media to see exactly who in your friend group is interested in a certain topic, so you can be certain there's something to talk about the next time you two meet up.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/flask\">flask</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/AndrewLikesFood/InBrief\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/AndrewLikesFood/InBrief\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["Quark", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Quark – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/868/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>One of our team members, Hannah, is double majoring in flute performance and computer science. She also enjoys videography (the video's we used, she took!). She wanted to create an app that manipulated videos. So after her initial idea and many pivots, we have successfully ended with Quark.</p>\n<h2>What it does</h2>\n<p>Quark is a multi-player apple TV app. Each player is able a distort the different video with different swiping motions and movements. Additionally by scanning QR codes, players can bring different instruments to life. When these instruments come together, a song is formed. </p>\n<h2>How I built it</h2>\n<p>We built this app entirely using Swift. </p>\n<h2>Challenges I ran into</h2>\n<p>Apple TV can only connect to two devices at a time, only one of the members had ever done iOS development before this weekend.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>It was 3 out of 4 members first time programming iOS and using swift.  </p>\n<h2>What I learned</h2>\n<p>Swift</p>\n<h2>What's next for Quark</h2>\n<p>Finding a way to have more than 2 devices at a time. erggg apple tv</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/uikit\">uikit</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ios\">ios</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/iphone-sdk\">iphone-sdk</a></span></li></ul>\n</div>\n</div>", ["I used the Core Image framework and Swift for OS X to create versatile image filters which I applied to \nindividual video frames.", "", "", ""]], ["JARVIS GestUR", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"JARVIS GestUR – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/903/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"JARVIS GestUR – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/812/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"JARVIS GestUR – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/813/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>What is that one thing that has driven the mankind to look out for new places, even if it needs and Apollo 11? The wanderlust within!\nQuite often you are tied to your work or your homework or simply stripped of the bucks to satiate that wanderlust. \nSo, why not let the world come to you and you take the driver's seat with simple gestures on your fingers!</p>\n<h2>What it does</h2>\n<p>Jarvis GestUR is the next advancement in JARVIS2, with gesture controlled navigation and betteer VR travel experience. GestUR is the technology that tracks your hand gestures and sends them to JARVIS platform for it to give you all the joys of visiting new places. Yes, Jarvis GestUR is your personal gesture assisted VR navigation system.</p>\n<h2>How I built it</h2>\n<p>Loaded with capabilities, the systeme leverages the database from Google Maps coupled with the VR power of Oculus. The platform integration is done using Unreal Engine with Myo driving the gesture automation in the VR.</p>\n<h2>Challenges I ran into</h2>\n<p>Unit 3D has no open-source free support to work on web enabled data for OCulus VR. And then Unreal 4.10 has compatibility issues with Myo Plugins. There were some modifications in the source codes that all settled the dust and gave life to Jarvis GestUR.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Huge learning on Myo and the featres it has. I tried creating custom gestures for our model and that was really exciting. </p>\n<h2>What I learned</h2>\n<p>Myo! The powerful armband.</p>\n<h2>What's next for JARVIS GestUR</h2>\n<p>Voice Integration, feet motion sensing. Other sense features for sound and feel factor!  Coming Up soon! - Stay tuned.</p>\n<h2>JARVIS2 - The predecessor of Jarvis GestUR</h2>\n<p><a href=\"http://hackscfall2014.devpost.com/submissions/29775-jarvis2\" rel=\"nofollow\">http://hackscfall2014.devpost.com/submissions/29775-jarvis2</a></p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/myo\">myo</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unreal-engine\">unreal-engine</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/oculus\">oculus</a></span></li></ul>\n</div>\n</div>", [""]], ["LightHouse", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"LightHouse – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/952/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"LightHouse – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/954/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"LightHouse – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/956/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"LightHouse – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/957/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"LightHouse – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/958/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"LightHouse – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/959/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"LightHouse – screenshot 7\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/961/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h1>LightHouse</h1>\n<p>A iOS application that allows for more immediate responses to disasters, crime, and terrorist attacks. </p>\n<h4>Our product site is available at: <a href=\"https://matthew-lin-45a3.squarespace.com/\" rel=\"nofollow\">https://matthew-lin-45a3.squarespace.com/</a></h4>\n<h4>Our web application is available at: <a href=\"http://lighthouse2015.azurewebsites.net/\" rel=\"nofollow\">http://lighthouse2015.azurewebsites.net/</a></h4>\n<h2>Motivation for platform</h2>\n<p>Given the recent tragedy in France, and many other disasters that strike us nearly every day; it becomes apparent that reacting effectively and efficiently in such scenarios becomes critical. It was for this reason that we decided to build LightHouse a platform that seeks to reduce the burden of these calamities. We hope that by using technology we can make response to these situations more effortlessly and reduce friction.</p>\n<h2>Summary</h2>\n<p>Our application aims to respond to every and all situations related danger; this includes sexual assault, armed robbery, terrorism, domestic abuse, arson, natural disasters. With the use of our application we allow victims a chance to instantly send out an SOS to the police and government; we also allow citizens to upload videos, photos, and audio of dangerous situations as they encounter them, creating essentially a hazard map that informs everybody around them of the danger.</p>\n<h2>Solution</h2>\n<p>Our solution can broken down into essentially two products: a web application and iOS application. For the average citizen our product aims to help quickly respond to disaster situations. Faced with danger a citizen can tap our widget on the lock screen without even opening the application allowing for instant contact with law enforcement. Additionally during times of national disaster, families can view loved ones through GPS location and know whether  are safe. Finally law enforcement can use either the mobile application or web application to monitor crime statistics, hot spots, and high problem areas.</p>\n<p>Here is a further break down of the three different categories to utilize our product; they are broken down as follows.</p>\n<h3>LAW ENFORCEMENT</h3>\n<p>Officers can find out the number of conflicts reported as well as the distance to the nearest conflict.\nThe number of officers is reported to determine the number of police to be allocated per crisis.\nCrisis mapping indicates what the most urgent crisis is so that the officers know which disaster to prioritize.</p>\n<h3>CIVILIANS</h3>\n<p>Civilian users can register based on their Government ID i.e. Driver's License or Social Security.\nInformation about nearby disasters and their categorizations is provided.\nSimple, intuitive widget on mobile phone allows civilians to send an SOS in times of danger.</p>\n<h3>FAMILIES</h3>\n<p>Users can verify the status of family members in a disaster. \nThe relative distance to the family member can be tracked to provide potential rescue options.\nEach user has his or her location mapped so family members know exactly where the disaster occurred.</p>\n<h2>Future/ Applications</h2>\n<p>This application was inspired by the recent attacks in Paris, but go much beyond that. It was built with the purpose of helping save lives and reduce daily calamities. This application works on the basis of immediate response and can therefore be applied to situations that require a natural disaster relief or situations of unrest in countries like in the Middle East.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/objective-c\">objective-c</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/makefile\">makefile</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/parse\">parse</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/azure\">azure</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bootstrap\">bootstrap</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ios\">ios</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/iphone-sdk\">iphone-sdk</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google-maps\">google-maps</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bing-maps\">bing-maps</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/squarespace\">squarespace</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/facebook-login-api\">facebook-login-api</a></span></li><li><span class=\"cp-tag\">sketch3</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/express-js\">express.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ajax\">ajax</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google--2\">google</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xcode\">xcode</a></span></li><li><span class=\"cp-tag\">parse-node</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/json\">json</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/AkhilNadendla/Lighthouse\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/AkhilNadendla/Lighthouse\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Worked on a majority of the front end iOS development. Linking the UI to the functionality, linking in Facebook, communicating with Parse, handling the MapKit, Widgets, and Form Control.", "I developed the concept, design, and UI; I built the front end of the app and also worked on implementing app features.", "", ""]], ["Diver", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Diver – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/079/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Diver – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/096/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Diver – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/097/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Diver – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/098/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Diver – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/099/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>We believe that Virtual Reality has the power to send extremely powerful messages that no other medium can possibly convey. As a result, we created Diver, a Virtual Reality experience designed to spread awareness about environmental pollution. We started with a simple list of hobbies- what would people want to experience in Virtual Reality? From there, we thought of how we could convert a simple game into a meaningful and immersive virtual experience, in a way that only Virtual Reality could manage. Through Diver, and Virtual Reality itself, we sought to bring attention to the severity of pollution while also allowing users to navigate an underwater, though polluted, environment.</p>\n<h2>What it does</h2>\n<p>Diver is an underwater Virtual Reality experience, where the user is able to use Sixense Razer Hydras to swim and enjoy the beauty of underwater marine life (There's even a whale!), and the Oculus Rift to look around them. However, there's a catch: The ocean is filled with trash, and it's the player's job to swim around and clean up trash including cans and water bottles.</p>\n<p>Once the user has cleaned up enough trash, they will have \"won\" our game, but the message we want to send is much more profound. A message will display saying \"Congratulations! You beat our game! In reality, however, pollution occurs on a much greater scale...\" and at that point, pollution rains from above and throughly covers the ocean floor where the user is swimming.</p>\n<p>In this case, seeing is believing. It's one thing to hear about pollution- it's another to experience it around you. One person alone cannot solve the problem, and that problem is escalating quickly. This is the message we wanted to send through Diver, and the unfortunate reality we wanted to convey.</p>\n<h2>How I built it</h2>\n<p>To create Diver, we used the Unity Game Engine, the Oculus Rift, and the Sixense Razer Hydras. </p>\n<p>All actual game functionality was built inside Unity, including the scene itself. We wrote several scripts in C# to implement the actual user \"swimming\" and the random instantiation of trash in the scene. </p>\n<p>The Oculus Rift, arguably the most essential part of our message, brings Virtual Reality to the game engine and allows the user to become fully immersed in the experience. It provides 360 motion tracking, allowing anyone to look around them while in the scene completely hands free.</p>\n<p>The Razer Hydras, an input mechanism designed by Sixense, were used to map actual human hands into the scene. When the user holds the Hydras, they gain control of these hands, and can move in a 3D space to move the hands as well. Through this input mechanism, we were able to let the user \"swim\" around them, an action achieved by actually moving the hands while inside Virtual Reality.</p>\n<p>We obtained facts from kanat.jsc.vsc.edu/student/brookfield/mainpoints.htm and music, titled Perspectives, from <a href=\"http://incompetech.com/music/royalty-free/index.html?isrc=USUAN1300027\" rel=\"nofollow\">http://incompetech.com/music/royalty-free/index.html?isrc=USUAN1300027</a>. </p>\n<p>While the work on Diver was split amongst the three of us, we collaborate for opinions and to keep each other updated and aware on the progress of the part. Tasks were given based on who was capable of doing so. Several examples of collaborative tasks include working with the swimming simulation, designing the murky underwater fog, and music choice. Communication among the team was also important to ensure proper combination and building of the project in the end so that everyone's work gets successfully integrated.</p>\n<h2>Challenges I ran into</h2>\n<p>Our biggest challenge was trying to work with the Razer Hydras to simulate swimming. The user, ideally, should be able to use the Razer Hydras to swim through the scene and collect trash. However, we had trouble deciding the best way to implement the action. We settled with using the Hydras to detect which direction the palms of the hands were facing and, by using the distance from the start of the movement to the end, allow the user to move in the direction opposite of where the hand is facing in a distance relative to how much distance your hands moved, as if they are \"pushing water\" and moving. Mapping actual swimming gestures and practices was unrealistic given our time frame, so the swimming in the game is more of a \"push away from the direction you want to move\", which sometimes takes a bit of getting used to.</p>\n<p>Distributing work was also tricky. However, we were able to get through by lots of communication and making sure each person was up to date with their task and no one was falling behind. There was a lot to do so each part and person were important.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Diver is a creation based on the desire to make a difference in the world. Though it is still, at it's core, a Virtual Reality game, it transcends that purpose and is far more of a message we want to send out across the world. We truly believed in the power of Diver to raise awareness and think that it has the potential to change perspectives for those who don't recognize the actual severity of pollution in the environment. Virtual Reality is still a very undeveloped field, and through our project, we are guiding it in a more positive and helpful direction.</p>\n<h2>What I learned</h2>\n<p>Honestly, we were forced to face the realities of pollution ourselves. Through looking up facts and creating devastating scenes, we had to confront a reality that pollution is far worse than we expected, and essentially tried to convey the same shock we initially experienced.</p>\n<p>On a more technical note, we learned a lot about actual movement in Virtual Reality using the Razer Hydras, and about input mechanisms in general and the role they play in VR.</p>\n<h2>What's next for Diver</h2>\n<p>We want to expand the message that Diver sends. Rather than just presenting the user with an ultimate feeling of hopelessness as trash piles up, we want to show that, through collaboration, the problem can be solved. First, we want to clean up what we have, and improve the actual quality of experience and make it more understandable for the general public. From there, we want to integrate ways and show the user that they can make a difference if everyone pitches in.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--2\">c#</a></span></li><li><span class=\"cp-tag\">virtual-reality</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/oculus\">oculus</a></span></li><li><span class=\"cp-tag\">razer-hydras</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/visual-studio\">visual-studio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/windows\">windows</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li></ul>\n</div>\n</div>", ["", "", ""]], ["ShowFinder", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/dZLE14s5pGE?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"ShowFinder – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/379/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"ShowFinder – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/381/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>An opportunity to work on a various brand new platforms.</p>\n<h2>What it does</h2>\n<p>The application on Echo uses TicketMaster APIs to find the events in the city with the details and with consent of the user, it also books an Uber for the user through Uber APIs.</p>\n<h2>How I built it</h2>\n<p>The application uses Alexa Skillset to train the Echo and convert the text to speech and vice-versa. The backend service that creates the functionality is hosted using Amazon Lambda. The Lambda function inturn communicates with a python web service hosted on a Azure instance to generate authentication credentials that allow the Echo to book an Uber on the user's behalf.</p>\n<h2>Challenges I ran into</h2>\n<p>Understanding various new technologies like Amazon Lambda service, Alex Skillset, Azure and integration among them. To generate the authentication tokens using OAuth in Java for Uber provider.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Implementing the authentication module for the Uber API. Integrating with Azure to host a web service over SSL.</p>\n<h2>What I learned</h2>\n<p>Various technologies like Lambda Service, Amazon EC2, Microsoft Azure. The team effort and the working in parallel by sharing the work to maximize the throughput.</p>\n<h2>What's next for ShowFinder</h2>\n<p>Being able to set a reminder using Alexa to Book a Uber.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/django\">django</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/azure\">azure</a></span></li><li><span class=\"cp-tag\">amazon-lambda</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/amazon-dynamodb\">amazon-dynamodb</a></span></li><li><span class=\"cp-tag\">alexa-skillset</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/ShantanuBal/AlexaShowFinder.git\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/ShantanuBal/AlexaShowFinder.git\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on the Amazon web services to host the Dynamo DB services and integrating the services with the Alexa app with clients being in python and Java . Along with that worked with all to get the app up and running.", "", "", ""]], ["Global Symptom Project", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Healthcare today is not the healthcare we deserve. This is largely due to a lack of education and a lack of information. We were inspired to tackle this problem by building something both educational and impactful, so we set out to build the Global Symptom Project. </p>\n<h2>What it does</h2>\n<p>We provide an easy way for people to log their symptoms and receive insights into their health using machine learning. Not only can this data be used personally, it is completely de-identified and open sourced so the entire world can query and discover new insights that can impact public health.</p>\n<h2>How I built it</h2>\n<p>iOS app and Apple watch app using the latest and greatest xCode 7.1 utilizing swift and a WatchKit 2 extension. </p>\n<p>The web app was built with apache web server on an Azure Ubuntu VM using CartoDB, D3, and sci-kit. The map uses a symptom name and the lat/long it gets from the apple watch or phone. We can set this to display a snapshot or a time-lapse. For the insights, we created both a regression and classification algorithm to predict when symptoms might occur, as well as what diseases a person might have. These results are displayed in an intuitive way on the web app.</p>\n<h2>Challenges I ran into</h2>\n<p>One of the biggest challenges was using ML. We didn’t have a lot of actual data so we had to simulate a lot of the data, which skewed the predictions. However, once we get more actual data, we can plug it directly into our existing models and keep iterating.</p>\n<p>Another challenge was using WatchKit. we had getting it paired with device, getting session from device, and getting navigation not to crash when popping to root controller.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>We am proud to say that we built a WatchKit 2 app over the weekend and handle \nlogging symptoms to a Microsoft Azure server.</p>\n<p>We used ML on Azure!!!</p>\n<h2>What I learned</h2>\n<p>While building the iOS/watchkit app, we learned how to manage sessions on the apple watch, how to communicate between the watch and the phone, WatchKit 2 API, and\nStay away from cocoa pods with watch extensions.</p>\n<h2>What's next for Global Symptom Project</h2>\n<p>During the next month, we hope to polish up the mobile and web apps, build out more insights, and launch the Global Symptom Project. We hope to make a campaign out of this in order for large amount of people to become aware of what we’re doing and download the app. Once we have collected a significant amount of data, we hope to release more data visualizations, improve our models, and work with leading government and academic institutions to figure out how this data can be used effectively.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag\">watchkit</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/azure\">azure</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/cartodb\">cartodb</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/d3-js\">d3.js</a></span></li><li><span class=\"cp-tag\">apple-watch</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/scikit-learn\">scikit-learn</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://40.122.174.31/\" rel=\"nofollow\" target=\"_blank\" title=\"http://40.122.174.31/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>40.122.174.31</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["Pulse Watch", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration People are scared to do CPR. With this app, their hands are free yet they have guided instruction to perform it.</h2>\n<h2>What it does It gives instructions on giving CPR through compressions. The pulse is the beat of when to perform a compression. (3 options - infant, child, adult)</h2>\n<h2>How I built it - I built it with Xcode using WatchKit</h2>\n<h2>Challenges I ran into - Haptic Feedback</h2>\n<h2>What I learned - More about developing for Watch Kit</h2>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag\">watchkit</span></li></ul>\n</div>\n</div>", [""]], ["Doggish", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Doggish – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/200/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Doggish – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/410/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Doggish – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/411/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Doggish – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/426/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>You've have a really long day... Let's just say you've gone from aiming for \"straights A's \"... to \"Bs\"... \"to Cs\"... to \"just passing\". Worst of all, you really miss home and your dog Waffles. Wouldn't it be nice if you could be cheered up?  </p>\n<h2>What it does</h2>\n<p>Enter Doggish! This is the paws on demand service that ensures flurry deliver to you! Using Doggish you can see the nearest dog play dates conveniently displayed on a map. Would like some 4 legged action now?? Search for specific dogs and notify them right away! </p>\n<p>What about dog owners you ask? As a dog owner of course you want to be encourage to take your precious pooch out, socialize, and show him off! But wait! With every confirmed play date, you earn points. Whenever you reach the next level, you get your pick of pet prizes!</p>\n<p>There's more! We also waited to eliminate digital noise. Everyone hates irrelevant advertisements thrown in their faces. With our app, local pet stores can offer coupons as prizes! This relevant, direct marketing ensures happier consumers and businesses. Are you a pet product company? No problem! Contact us to list your new product as a prize sample. Choose to directly market to small or large, young or old dogs, even specific breeds of dogs!</p>\n<h2>How we built it</h2>\n<p>We using facebook login to authenticate users, and take that access token to exchange for valid Amazon web services credentials (Cognito) to access resources. The database is a noSQL, fully managed and scaleable dynamo db. To ensure minimal latency we don't edit the database directly. We can AWS lambda functions, which pretty gives us a on demand server to run whatever code we need. We used google cloud messaging for push notifications to users. Of course we use google maps and markers to display the play date points. As a team, of course we realize we could not implement everything we wanted. Our designer used Illustrator and Photoshop to whip up custom icons and images as \"Coming soon\" features. </p>\n<h2>What's next for Doggish</h2>\n<p>We plan on extensive testing for bugs and finishing the implementation. We came together because we wanted to leverage cool technology and built something helpful. You might just find in the app store soon!</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google-maps\">google-maps</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/amazon-web-services\">amazon-web-services</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/facebook-graph\">facebook-graph</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/facebook\">facebook</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google-cloud-messaging\">google-cloud-messaging</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/amazon-dynamodb\">amazon-dynamodb</a></span></li><li><span class=\"cp-tag\">cognito</span></li><li><span class=\"cp-tag\">amazon-lambda</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/lchrislee/Doggish\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/lchrislee/Doggish\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", "", ""]], ["WeHack", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/TnMRGj_z7yM?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"WeHack – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/176/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"WeHack – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/177/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"WeHack – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/178/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>We set out to build an iOS application that truly solves a real-world problem, and we did exactly that. We realized how tedious it is to browse through postings in Excel of hackers posting their technical expertise and skills. In fact, they all end up looking roughly the same over time. WeHack simplifies the entire process of finding teammates based on desired skills, and exploring teams to better understand the project idea, including skills they're currently looking for as well as how many spaces are open. In addition, there's a bulletin board for the hackathon admin to continuously update, all with locations that make it easy for attendees to pinpoint exactly where the event or food is. This proves to be particularly useful since most attendees are new to the school and unfamiliar with its layout.</p>\n<h2>What it does</h2>\n<p>WeHack serves as a platform for teams to browse students who are looking for teams. They can search for specific skills, making it much more easier than ever before to find attendees with the exact skills they're looking for. In addition, attendees can view teams, their project idea, as well as the tech stack for the project. The admin of the hackathon event can continuously add bulletin posts with the latest news and updates, all with location included (that open in maps) that make it easy for attendees to find exactly where the event is going on. </p>\n<h2>How I built it</h2>\n<p>We built this with Swift for the iOS application, and node.js with MongoDB for the back-end REST API. </p>\n<h2>Challenges I ran into</h2>\n<p>There were several challenges we ran into throughout the process of developing this application. The main one was developing a fully polished iOS app that adheres to Apple's UI/UX guidelines within the timeframe of this hackathon. While we got much of the application working, there is definitely more work to be done.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>We're proud of developing an iOS application that resolves a real-world problem for hackathon attendees. We placed UI/UX design as one of our priorities as this application seeks to be the information hub for hackathons. We completed read through and understood Apple's design guidelines, and each every button, gesture, and style is optimized for ease of use for the user. We really believe that this application can change the way that people attend hackathons in the future, resolving many of the common pain-points from earlier.</p>\n<h2>What I learned</h2>\n<p>To make a fully robust iOS application, it definitely takes more than 1-2 nights. We also learned how to build robust APIs in Node.js and the sheer amount of work it takes to develop a UI/UX friendly application that optimizes the user's ease of use.</p>\n<h2>What's next for WeHack</h2>\n<p>We need to fully implement some of the features we set for the roadmap of our product, such as the admin options and messaging. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/iphone-sdk\">iphone-sdk</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mongodb\">mongodb</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/spencerprescott/WeHack\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/spencerprescott/WeHack\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"https://github.com/vishnukarthikl/hacker\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/vishnukarthikl/hacker\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on the wireframes, user flow, navigation, UI, UI kit, clickable prototype so everything UX and design related. ", "", "", "", ""]], ["Lost In The Woods", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Lost In The Woods – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/205/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Lost In The Woods – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/043/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Lost In The Woods – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/318/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Wanted to create something that looked better than a simple 2D game, possibly better than some existing Unity 3D projects out there.</p>\n<h2>What it does</h2>\n<p>Control a player who has to avoid the enemies. Enemies spawn at edges of the map at increasing frequencies as time passes. </p>\n<h2>How I built it</h2>\n<p>Created terrain, added some graphic details, then created enemy, player, and collision detection as well as scripts for damaging.</p>\n<h2>Challenges I ran into</h2>\n<p>Collision detection between enemy and trees as well as player and terrain.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Solved pathfinding through NavMesh, looks great with the wind and sun, also first project in Unity</p>\n<h2>What I learned</h2>\n<p>3D programming isn't as hard as I thought it would be, it's exciting to be able to do so much just over one weekend.</p>\n<h2>What's next for Lost In The Woods</h2>\n<p>Allow player to kill enemies, add a start screen.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://drive.google.com/drive/u/0/folders/0B71b79c5_JQlSllDMktROUVmNHc\" rel=\"nofollow\" target=\"_blank\" title=\"https://drive.google.com/drive/u/0/folders/0B71b79c5_JQlSllDMktROUVmNHc\">\n<i class=\"ss-icon ss-link\"></i>\n<span>drive.google.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Worked on the modeling, graphics, effects, and player/enemy navigation.", "Worked on HUD, player/enemy health, navigation, and hit detection."]], ["sparkfy.club", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>my classmates and friends have problems that can be addressed by seniors</h2>\n<h2>help students find answers</h2>\n<h2>I built it with bootstrap and php</h2>\n<h2>fast deployment</h2>\n<h2>finished most of features in given time</h2>\n<h2>preparation is key</h2>\n<h2>What's next for sparkly: promote to classmates</h2>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php5\">php5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/laravel\">laravel</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bootstrap\">bootstrap</a></span></li><li><span class=\"cp-tag\">javscript</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ajax\">ajax</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/json\">json</a></span></li></ul>\n</div>\n</div>", ["", ""]], ["Face Central", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<h2>What it does</h2>\n<h2>How I built it</h2>\n<h2>Challenges I ran into</h2>\n<h2>Accomplishments that I'm proud of</h2>\n<h2>What I learned</h2>\n<h2>What's next for Face Central</h2>\n<h1>We are AWESOME!;)</h1>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--2\">c#</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xaml\">xaml</a></span></li></ul>\n</div>\n</div>", [""]], ["DinePro", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"DinePro – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/046/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"DinePro – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/047/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>WE LOVE EATING and knowing new friends.</p>\n<h2>What it does</h2>\n<p>Users can get to know new people through our app and join or create a dining based on who they want to know and what they want to know.</p>\n<h2>How I built it</h2>\n<p>We started from learning the Swift Language and Xcode.</p>\n<h2>Challenges I ran into</h2>\n<p>SWIFT is NEW!!! And so many features for an app to be perfect</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>We learned a lot!</p>\n<h2>What I learned</h2>\n<p>New Language and new friends.</p>\n<h2>What's next for DinePro</h2>\n<p>We want to start a Startup!</p>\n</div>\n</div>", [""]], ["safeRoute", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>We wanted to find the safest route among the routes provided by Google Maps.</p>\n<h2>What it does</h2>\n<p>Calculates the safest route between 2 points by accounting for crime rate at different locations.</p>\n<h2>How I built it</h2>\n<p>Using azure, flask, swift.</p>\n<h2>Challenges I ran into</h2>\n<p>Debugging Google Maps SDK in ios, and using python with azure.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Integrating 3 separate aspects of the application.</p>\n<h2>What I learned</h2>\n<p>Download software and get an idea before arriving. Never give up.</p>\n<h2>What's next for safeRoute</h2>\n<p>Implementing it on the Apple Watch.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/flask\">flask</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/azure\">azure</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google--2\">google</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google-maps\">google-maps</a></span></li><li><span class=\"cp-tag\">mobile</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ios\">ios</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/jiminkk/safeRoute\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/jiminkk/safeRoute\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["Convergent", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Convergent – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/003/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Convergent – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/022/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Convergent – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/023/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Convergent – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/024/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Convergent – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/025/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>The inspiration came from a game many are familiar with and may have played at some point called \"assassin.\" Essentially every player is given a target which they will try to find over a however-long period of time and \"assassinate' them. So at any given moment you will have someone you are trying to find before someone else finds you. This game has been the subject of large events over the years and has many variations to its name but never has there been an app to help facilitate it.</p>\n<h2>What it does</h2>\n<p>The app will allow for players to choose to join ongoing games or create games of their own. Once the player joins, they are automatically assigned a player to find on their smartphone along with a radar pointing to were they are in the predetermined boundaries. They will then have to navigate their way through their campus, city or neighborhood and try to locate their target. Once located the user will have the chance to tag their target by swiping up on their face on the app and send a notification to the target that they've been tagged. The player then earns points and can then carry on with their next target while their tagged target must report to a \"respawn zone\" to continue with their game.</p>\n<h2>How we built it</h2>\n<p>We used swift to code the front-end which currently consists of a map that will follow the user on the map as they walk towards the preset pin on the map. Once the user is close enough, they have the option of clicking the tag button and send a notification to themselves that they've tagged the target. Later code will incorporate our back end to connect other users and allow for much more functionality in the app.</p>\n<h2>Challenges we ran into</h2>\n<p>Some challenges we ran into was learning the protocols to program iOS apps in swift. </p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Creating a basic iOS app with a team with diverse skill sets.</p>\n<h2>What we learned</h2>\n<p>How to build a map on an iOS app and place your current location. </p>\n<h2>What's next for Convergent</h2>\n<p>Incorporating other users and adding navigation to our app so users can see their profile and statistics. Additionally there will be matches which users can join and play with others. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/ShaneRosse/HackSC.git\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/ShaneRosse/HackSC.git\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Designed the UI prototypes using Adobe Photoshop and Illustrator.", "I worked on developing the front-end and laying out some basic groundwork for future work in creating a fully immersive app.", ""]], ["RideOut", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"RideOut – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/979/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"RideOut – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/980/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"RideOut – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/981/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"RideOut – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/982/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"RideOut – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/983/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"RideOut – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/984/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"RideOut – screenshot 7\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/985/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"RideOut – screenshot 8\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/986/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Many of us are not able to afford a private mode of transportation. Thankfully, we do have other options like Uber or Lyft which enable us to commute effectively. But unfortunately, it can still get expensive for everyday commutes. So we decided to work on creating a system that provides a cheap as well as consistent solution to this problem.</p>\n<h2>What it does</h2>\n<p>RideOut is a ride sharing application that allows people to pool cars to go from one point to another. It is different from other car pooling or cab applications out there in the sense that it takes into account driver's priorities - drivers post their ride as per their itinerary. </p>\n<p>For example a person X wants to go shopping from his home and return. X can reduce his/her fuel cost by picking up maybe a couple of people on his way who are also looking to go for a similar errand. As a result, the price is considerably lower than other cabs. The riders benefit from this model since they get a similar ride at deflated price. </p>\n<p>People who wish to commute between places can look up for available drivers who have planned their journey on a similar route.</p>\n<h2>How I built it</h2>\n<p>We created an iOS application to showcase our MVP. Coding was done in Swift to speed up development. Back-end was hosted with Parse for the time being. We used Google Maps APIs to carry out all travel and map operations.</p>\n<h2>Challenges I ran into</h2>\n<p>Drivers can post rides from source S to destination D with several additional points (way-points) in between. With huge number of drivers posting, this creates a graph of available stops (nodes) and paths (edges). Now the challenge is to provide all possible paths when a rider searches for a ride from source S’ to destination D’. There can be multiple paths using those intermediate way-points which can be tough to find since the Google Maps API returns only points in path A to B (it doesn’t consider all points around its near proximity). But our application should provide all such paths.</p>\n<p>Since time was a constraint, we designed an algorithm which finds rides which uses all such way-points in a x mile radius from source and destination only. But it can be extended in future to use all such 1 mile radius way-points along the entire path (not just source and destination).</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>With the time constraint, we are happy to create a close MVP for a ride-sharing app which incorporates a custom routing algorithm as per the novel idea of making the app driver centric and yet keeping the cost cheap for the riders.</p>\n<h2>What I learned</h2>\n<p>We learnt to use Google Maps APIs better than ever before since we never needed to explore the API to the edge. There was this great real world graph problems which further strengthened our knowledge of the most interesting and effective field of Computer Science.</p>\n<h2>What's next for RideOut</h2>\n<p>We wish to provide every transit method for a person who is planning to go from A to B. This could be by walk, bike or other transport methods available, to make the system fully complete for a person.</p>\n<p>As we gather more and more users on the system, and consequently more data, we plan to mine the data to gather meaningful insights out of it. A rating system can be created where drivers can rate passengers and vice-versa. A recommendation engine can be incorporated to make the experience better for both parties.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ios\">ios</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xcode\">xcode</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/uikit\">uikit</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/cocoa\">cocoa</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google-maps\">google-maps</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/parse\">parse</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/ab93/RideOut\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/ab93/RideOut\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Coded the iOS application", "", "", ""]], ["Wizard Chess ", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<p>VR voice controlled Chess </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/google-cardboard\">google-cardboard</a></span></li><li><span class=\"cp-tag\">microsoft-luis</span></li><li><span class=\"cp-tag\">microsoft-speach-api</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/azure\">azure</a></span></li></ul>\n</div>\n</div>", ["", "", ""]], ["RoadTrip Discover (iOS App)", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"RoadTrip Discover (iOS App) – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/074/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"RoadTrip Discover (iOS App) – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/069/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"RoadTrip Discover (iOS App) – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/071/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"RoadTrip Discover (iOS App) – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/075/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"RoadTrip Discover (iOS App) – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/076/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"RoadTrip Discover (iOS App) – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/077/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"RoadTrip Discover (iOS App) – screenshot 7\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/078/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Both of our team members love traveling. And while we were traveling around different places, we found that we always missed a lot of beautiful and interesting things. Sometimes the reason is as simple as we didn't know that they existed. So we developed this RoadTrip Discover to help us better plan our travel.</p>\n<h2>What it does</h2>\n<p>Plan your trip and help you find all the intersting and wonderful places that you might want to visit during your trip. Also we can share the experience using OneNote.</p>\n<h2>How I built it</h2>\n<p>(1) Bing Search \n(2) OneNote \n(3) Apple iOS (Map Kit and so on)</p>\n<h2>Challenges I ran into</h2>\n<p>Integrating the app with OneNote and Bing search was very challenging for us for the season that we were both new to this and it took us a long time to figure out the best way to integrate our app with them.</p>\n<p>The Sample code is at least 2 years ago....</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Finally I made it, without a lot sleep</p>\n<h2>What I learned</h2>\n<p>A lot </p>\n<h2>What's next for RoadTrip Discover</h2>\n<p>Add more thing? Publish to Apple App Store? \nWe will do road trip to North California We will see</p>\n</div>\n</div>", ["I worked on our backend service and helped handling all the data store and business  logic.", "", ""]], ["Cardbird", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Cardbird – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/081/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Cardbird – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/170/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Cardbird – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/087/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Cardbird – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/088/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>What would a common user interface design pattern look like if it were translated into VR?</p>\n<p>This web app displays the latest tweets from the user's home timeline in 3D. By turning right, the user can see more tweets. Tweets outside of the user's field of view get replaced by new tweets in the user's feed, allowing tweets to be displayed continuously. Media associated with the tweet can be viewed directly underneath the tweet.</p>\n<p>Cardbird runs entirely in your browser. It utilizes <a href=\"https://vr.chromeexperiments.com/\" rel=\"nofollow\">Chrome Experiments for VR</a> for setting up three.js to work with Cardboard. OAuth.io is used to authenticate the user with Twitter easily and to call the Twitter API. Tweets are converted into three.js objects and are inserted and removed from the scene as the user turns left and right.</p>\n<h3>What's next</h3>\n<p>Currently, Tweets are read-only, but the retweet/favorite buttons could be used to perform their associated actions. If a tweet is part of a conversation, the other tweets in that conversation could be displayed behind the tweet.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag\">babel</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/three-js\">three.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/twitter\">twitter</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag\">oauthio</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/bmats/cardbird\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/bmats/cardbird\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["WideAwake", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>After struggling for many years to wake up on time to attend classes and other morning activities, we decided to take the ball in our own hands and develop an app that would force us to wake up. Usually, alarm clock apps are unsuccessful at waking people up after a certain time duration of being used (anywhere from a few days to a few months), since users become accustomed to the app's method of waking them up. We decided to develop an alarm clock that makes it difficult to develop muscle memory for, forcing its users to wake up upon the app's activation in the morning.</p>\n<h2>What it does</h2>\n<p>The app begins by implementing a simple clock that can be scrolled through to set an alarm (in either hours or minutes). Once the alarm goes off, the app prompts the user to get out of bed and dance around until the accelerometer has been sufficiently activated for a certain time duration. The app cleverly prevents users from throwing the phone by forcing users to constantly be pressing a button on the screen in order to have the phone's movements recorded. Finally, after passing the physical movement stage, users are given a fun fifteen-slider puzzle to solve in order to wake up the cerebellum. </p>\n<h2>How I built it</h2>\n<p>Although on Friday night, at the beginning of the hackathon, none of our three members had ever developed an iOS application, we learned the basics of Swift and Objective-C to utilize Apple's developer platform, Xcode, and create this app. We specifically utilized the CoreMotion software in order to activate the accelerometer. </p>\n<h2>Challenges I ran into</h2>\n<p>We had some difficulties making our code effective while switching between Swift and Objective-C. Additionally, integration of the different parts of our code was a time-consuming endeavor. </p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>We're proud of the fact that we were quickly able to learn new coding languages and create our very first games and first mobile applications. We also spent a significant amount of time making sure the app was user-intuitive and aesthetically pleasing. </p>\n<h2>What I learned</h2>\n<p>We learned how to code in Swift and Objective-C. Additionally, we learned the importance of teamwork and beginning with a simple and intuitive design. We also discovered the potent power of Red Bull. </p>\n<h2>What's next for WideAwake</h2>\n<p>We hope to finish developing the app and making sure to fix any bugs we may find. We also hope to add a randomized variety of alarm sounds and puzzles in order to continue our goal of developing an alarm that counteracts muscle memory. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/objective-c\">objective-c</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xcode\">xcode</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/photoshop\">photoshop</a></span></li><li><span class=\"cp-tag\">paper</span></li><li><span class=\"cp-tag\">coremotion</span></li><li><span class=\"cp-tag\">audiotoolkit</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://goo.gl/wtNaC2\" rel=\"nofollow\" target=\"_blank\" title=\"https://goo.gl/wtNaC2\">\n<i class=\"ss-icon ss-link\"></i>\n<span>goo.gl</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["Localization Launcher", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Localization Launcher – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/004/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>I decided I wanted to design a video game for my Graphic Design class, and I haven't planned to develop it, but I took this opportunity to develop a prototype of the game. The topic that I chose is the cultural appropriation of Japanese anime and video games when they brought over to the US. A lot of the time, some things get lost in the localization, especially when there is censorship and edits done to completely remove content from the original.</p>\n<h2>What it does</h2>\n<p>It is a launcher game where the goal is to get as far as you can by hitting boosting items and avoiding obstacles. The game is over when the character is stopped. After launching, much of it is reliant on luck, but the user gets to boost the main character to save the main character from stopping. </p>\n<h2>How I built it</h2>\n<p>I built it through Unity and Unity C#.</p>\n<h2>Challenges I ran into</h2>\n<p>This was the first time building something on my own in Unity and my first time using C#, so I had a lot of trouble trying to figure out how everything worked.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>I'm happy that I got as far as I did. I wish that I had more time or finished faster to be able to add graphics instead of the current placeholders, but I am happy that I was able to learn so much and put together a game that works, though sometimes buggy.</p>\n<h2>What I learned</h2>\n<p>I learned more on how to use Unity and C#, almost from scratch. Adam from Microsoft, who taught the Unity workshop, was very helpful in teaching me the material and helping me with my project.</p>\n<h2>What's next for Localization Launcher</h2>\n<p>I need to hammer out the bugs with the launching part of the game, because sometimes the character gets launched backward. I also need to draw graphics to put in it. It is currently only using placeholder images and text. One big part of the game is supposed to be the background, which is one of the key points of communicating my topic.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://www.filedropper.com/localizationlauncher\" rel=\"nofollow\" target=\"_blank\" title=\"http://www.filedropper.com/localizationlauncher\">\n<i class=\"ss-icon ss-link\"></i>\n<span>www.filedropper.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["EventEyes", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Flyers are an important part of our event planning. So are our calendars. But often times flyers are too cumbersome and ineffective, and we are too lazy to constantly update our calendars. This is where this project comes in.</p>\n<h2>What it is</h2>\n<p>EventEyes is an Android application converts an image of a flyer into a calendar event.</p>\n<h2>What it does</h2>\n<p>EventEyes prompts the user to take a photo, scans the photo, analyzes the data using an OCR, parses the given data and determines the most relevant data to the best of its ability. The user may also see events that are most popular in the public.</p>\n<h2>How it's made and components</h2>\n<p>Front end: Java</p>\n<p>Back end: Javascript and Microsoft Azure</p>\n<h2>Challenges we ran into</h2>\n<p>The biggest challenge we ran into was setting up and connecting to Microsoft Azure.</p>\n<h2>Accomplishments that we're proud of</h2>\n<p>Being able to read and actually parse an image. This is also our first time using Android Studio so we are very proud of creating a simple yet aesthetically pleasing UI.</p>\n<h2>What we learned</h2>\n<p>We did not know much going in, so we ended up learning about Android Studio, how to set up Microsoft Azure and get a voting system going on our app.</p>\n<h2>What's next for EventEyes</h2>\n<p>We will continue to improve upon our program and compete in future events where we add on features.</p>\n<h2>Eye Design for our Logo</h2>\n<p>Eye graphic by <a href=\"http://www.freepik.com/\" rel=\"nofollow\">Freepik</a> from <a href=\"http://www.flaticon.com/\" rel=\"nofollow\">Flaticon</a> is licensed under <a href=\"http://creativecommons.org/licenses/by/3.0/\" rel=\"nofollow\">CC BY 3.0</a>. Made with <a href=\"http://logomakr.com\" rel=\"nofollow\">Logo Maker</a></p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/azure\">azure</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/tesseract\">tesseract</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android-studio\">android-studio</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/json\">json</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/rajaman0/HackSCTeam\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/rajaman0/HackSCTeam\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Worked on getting Azure up and running, storing and retrieving data from Azure and putting relevant data it into our app. I also worked on the design of the front page of the app using Android Studio.  ", "I worked on the front end UI design using Android Studio and assisted with the tesseract API. I also assisted in designing the azure functionalities.", "I worked on the front end, back end, UI design, and functionalities as well as the Tesseract API.", "I worked on building the UI using java. I also worked on connecting and setting up with Microsoft Azure. Offered assistance with API.", "OCR/Text recognition algorithms, input parsing and output to Calendar, Android front-end development, Azure integration."]], ["Lily", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>Seeing friends become increasingly reckless with money transferring because of the ease of Venmo</p>\n<h2>What it does</h2>\n<p>Uses Venmo's API to retrieve financial data about the user and presents the data clearly and concisely. Also, analyzes data and gives insight into the user's spending habits, and offers recommendations for the future.</p>\n<h2>How I built it</h2>\n<p>Using objective-C for client-side code, PHP for server-side code, and SQL for a database</p>\n<h2>Challenges I ran into</h2>\n<p>Getting all the information Venmo's API has to offer, linking PHP to Objective-C, and analyzing the financial data</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Successfully integrating Venmo's API, creating a functional User Interface, and creating a fully-functional SQL database</p>\n<h2>What I learned</h2>\n<p>Plenty of Objective-C skills, auto-layout skills, and some server-side skills</p>\n<h2>What's next for Lily</h2>\n<p>Get the data analysis side of the project to be fully operational, and create better graphics to represent the data</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/iphone-sdk\">iphone-sdk</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/shavix/Lily.git\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/shavix/Lily.git\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["ChemType", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"ChemType – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/890/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"ChemType – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/891/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"ChemType – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/892/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>What it does</h2>\n<p>ChemType is a note taking tool for chemists which turns a handwritten organic chemical structure into a typeset image. The application uses machine learning optical structure recognition technology to identify up to 9 different structures from a user generated handwritten image. Within the app, the user hand draws a structure which is then sent to the machine learning algorithm to be processed, and is returned as a typeset image.</p>\n<h2>How I built it</h2>\n<p>ChemType uses a machine learning algorithm called a neural network classifier for optical structure recognition. To generate training examples, we hand drew 40 diagrams of each structure with pen and paper. Because we had such few training examples, great care was taken to ensure high training data quality by preprocessing the images. Dimensionality reduction, reducing each image from millions of dimensions to only 96 dimensions, allowed the neural network to focus on the broad structural features of the molecule. Additionally, we applied a background correction to denoise the images. We then developed and tested the neural network using Microsoft Azure Machine Learning and used Azure's web service to transfer raw data and results to and from our iPad app. The main job of the app was to get the user generated image and send it to Azure, then collect the result of the neural network algorithm from Azure and give the user the corresponding image.</p>\n<h2>What's next for ChemType</h2>\n<p>With more training data ChemType can eventually be able to recognize hundreds of structures. Adding further machine learning algorithms will allow the app to recognize structures it has never been taught before by recognizing their chemical functional groups, as well as recognizing text. Because all the heavy-duty computation is loaded on the cloud, the app has a great potential to be scaled up without putting a burden on iOS or the user's local machine. With the right algorithm, ChemType could make chemistry note taking entirely digital, completely bypassing the need for conventional molecule editing software.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/azure\">azure</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://docs.google.com/presentation/d/1WbT8S-9hucZSAftC-JUzNY9YbbP2ceBcGKWBkEsvjsY/pub?start=false&amp;loop=false&amp;delayms=3000&amp;slide=id.p8\" rel=\"nofollow\" target=\"_blank\" title=\"https://docs.google.com/presentation/d/1WbT8S-9hucZSAftC-JUzNY9YbbP2ceBcGKWBkEsvjsY/pub?start=false&amp;loop=false&amp;delayms=3000&amp;slide=id.p8\">\n<i class=\"ss-icon ss-link\"></i>\n<span>docs.google.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on some of the iOS components of the application, including image processing, and communication with the Azure web service (sending input data, and parsing JSON data) that uses Azure Machine Learning to return a matching chemical compound. JSON Parsing  ended up being more difficult than expected, as Azure returned the data we want buried 4 nested dictionaries and nested arrays. Image processing (scaling down) in iOS yielded issues as the picture suffered some level of distortion regardeless of how we were scaling it due to iOS image processing constraints, lowering the accuracy on the iOS app.", "", "", ""]], ["Chicken Gives you Wings", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Chicken Gives you Wings – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/975/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>This video game was inspired by the Greek and Roman mythology. Their fighting spirit empowers us</p>\n<p>It is a simple 2D platformer. </p>\n<p>This was built in Unity 5 2D. The graphics were imported from Adobe Illustrator.</p>\n<p>We had many challenges to overcome such as learning many new coding concepts and techniques to make the game run in the way that we wanted and creating images that could be animated inside the Unity program.</p>\n<p>What's next for Chicken Gives you Wings? <strong>We'll add more chickens.</strong></p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://onedrive.live.com/redir?resid=62C8FFF651CC061D!266536&amp;authkey=!AFyLTdL0aUxcRH0&amp;ithint=folder%2c\" rel=\"nofollow\" target=\"_blank\" title=\"https://onedrive.live.com/redir?resid=62C8FFF651CC061D!266536&amp;authkey=!AFyLTdL0aUxcRH0&amp;ithint=folder%2c\">\n<i class=\"ss-icon ss-link\"></i>\n<span>onedrive.live.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["SafeGuard", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"SafeGuard – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/926/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"SafeGuard – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/928/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"SafeGuard – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/929/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"SafeGuard – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/937/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p><strong>## Inspiration</strong>\nMany of us have faced the situation where another driver comes into our lane, nearly hitting us in the process. This is the shortcomings of the blind spots that exist in all cars, however we as engineers will not stand by and let this happen to others. About 18,000 injuries and 300 deaths happen every year due to visibility issues with blind spots in the United States. We wanted to create something that mitigates this issue.  </p>\n<p><strong>## What it does</strong>\nSafeGuard is a portable module that reports any collision incident anywhere. It is a cloud connected blackbox that constantly saves sensor data. A built in rangefinder detects for close by objects, along with other sensors for additional data. For example, the weather shield can be attached to retrieve Temperature, Humidity, Pressure, etc. of a certain location during the time of incidence. </p>\n<p>It can be used in multiple different industries from simple home care to factory automation. Today we have used the SafeGuard module to give a normal car luxury options, such as a backup range detector, an HUD with frontal range, and a blind spot monitoring system. </p>\n<p><strong>## How we built it</strong>\nWe use a Photon Board connected to Azure for saving data. This was after using a couple other boards including the Arduino and Spark Cores. An LED matrix shows how close any object gets within 4ft. Additional i/o devices such as weather shields and speakers can be added. </p>\n<p><strong>## Challenges we ran into</strong>\nAt first we wanted to create a blind spot detector with the Arduino and turn on an LED, but then realized the value proposition of creating an IoT device connected to the cloud. The WiFi shield proved difficult for us, making us explore different option with the Photon and Spark Cores. As a team we came into this hackathon wanting to make something big and grand, but soon realized a valuable lesson: A small thing that solves a big problem is much more valuable than a big thing that solves a small problem. </p>\n<p><strong>## Accomplishments that we are proud of</strong>\nThis is our first hardware hack at a hackathon. We are all software people so learning hardware was definitely new for us. We created a pretty awesome cardboard model of our car named Speedy. Be sure to check us out! </p>\n<p><strong>## What we learned</strong>\nHow to use and Arduino, Spark Cores, Node Js, JSON packets, Microsoft Azure, Microsoft Kinect, and Android. \nSmall things that solve big problems are much more important than big things that solve small problems. </p>\n<p><strong>## What's next for SafeGuard</strong>\nSafeGuard is just the beginning of IoT data retrieval. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/arduino\">arduino</a></span></li><li><span class=\"cp-tag\">photon</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/particle\">particle</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--3\">c++</a></span></li><li><span class=\"cp-tag\">microsoft</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/azure\">azure</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag\">cardboard</span></li><li><span class=\"cp-tag\">ductape</span></li><li><span class=\"cp-tag\">hud</span></li></ul>\n</div>\n</div>", ["", "", ""]], ["Picture This!", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Picture This</h2>\n<p><em>Debut @ hackSC2015</em></p>\n<p>Play the most exciting new game! After prompted by an adjective, take a picture to share with your friends and see if they can guess it right! </p>\n<p><strong>Reviews from our Users:</strong></p>\n<p>\"Best Game Ever!!!\" - Sara Binder</p>\n<p>\"Outstanding use of Azure!\" - Drew Okenfuss</p>\n<p>\"Most fun I've had in days!\" - Wyatt Paul </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/azure\">azure</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li></ul>\n</div>\n</div>", ["", "", ""]], ["Justice Car", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/y8GBwm_4Ejo?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Wanted to learn something new and building a game was something i was always interested about.</p>\n<h2>What it does</h2>\n<p>A simple game with a maze and you can move your car around it. I</p>\n<h2>How I built it</h2>\n<p>Using Unity and C#</p>\n<h2>Challenges I ran into</h2>\n<p>Dint know what it is or to how to build one 48 hours ago. Had to start from the scratch.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>A running app at hand.</p>\n<h2>What I learned</h2>\n<p>Developing simple games.</p>\n<h2>What's next for Justice Car</h2>\n<p>Try developing more complex levels and improvise.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--2\">c#</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/RakeshKumarSatvik/HackSC-Game\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/RakeshKumarSatvik/HackSC-Game\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["Email Content Manager", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>The idea to simplify the way we read and keep track of emails inspired us to create this application</p>\n<h2>What it does</h2>\n<p>The application allows the user to login with his Microsoft Outlook account, and have access to a timeline view of his emails. Each timeline pertains to a particular topic. When he hovers over the timeline, he sees the key points discussed in the email; when he clicks on the timeline, he gets to see the entire message content.</p>\n<h2>How I built it</h2>\n<p>We used the Microsoft Outlook REST API integrated in python and django. We set up a server in django and created a Microsoft Developer Application which has access to the user's email account once he authenticates with his outlook credentials. We used the Topia python library to extract key points from the body of an email. We designed the timeline using HTML, Bootstrap CSS, JavaScript. </p>\n<h2>Challenges I ran into</h2>\n<p>First we tried to create a Microsoft Outlook Add-In, but it had the limitation of reading only one mail at a time. Hence, we switched to use the Microsoft Outlook REST API integrated in python and django. Finding key points in the body of an email was a challenge.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>We are proud that we chose a topic which helps the user keep track of his daily email activities. </p>\n<h2>What I learned</h2>\n<p>We learnt new technologies like Django, Microsoft Outlook REST API integrated in python.</p>\n<h2>What's next for Email Content Manager</h2>\n<p>There is no limit to the modifications that we can make in this application. Every minor improvement will make this application more efficient and useful to the user. For the immediate future, we are planning to integrate other email accounts like Gmail, and also enhance the timeline to enable more data to be visible there.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/django\">django</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag\">microsoft-outlook-api</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/TeamECM2/ecm\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/TeamECM2/ecm\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on integrating the Microsoft Outlook REST API to the application and extracting important keywords in an email to help form the timeline.", "I worked on using the Outlook REST API and setting up the basic Django workflow.", "I was involved in the implementation of some of the elements in the backend and also worked on the front end, that included representing the content of the email on the timeline. I also made an effort to implement the project with the help of plugins in outlook.com."]], ["iOS Air Drums", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"iOS Air Drums – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/266/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Drums are expensive and this prevents a lot of people who can't afford them from enjoying this cheerful past time. We want to make drumming accessible to anyone and anywhere. </p>\n<h2>What it does</h2>\n<p>Through the use of iWatches, users can open this app on their phone and select various types of drumming sets to play music. </p>\n<h2>How I built it</h2>\n<p>We utilized gyroscopes and accelerometers on an iwatch to collect hand motion data. We used blue-tooth to transfer data from the iwatch to an iphone. Based on the data, we calculated different types of hand gesture and assigned specific sound to each of them.</p>\n<h2>Challenges I ran into</h2>\n<p>We struggled with accurately producing a beat sound when the user would strike downwards, We had trouble with the iwatch os 2 since it was just released. Also, we had to do extensive research in order to be able to use the iwatch's gyroscopes and accelerometers. Finally, it was a  difficulty process to come up with a precise algorithm to curate our data.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Finishing the impossible task of implementing an app, especially utilizing an iWatch with little documentation and no knowledge of swift before this weekend. </p>\n<h2>What I learned</h2>\n<p>The crucial component every team member plays in development, and how difficult yet rewarding it can be. </p>\n<h2>What's next for iOS Air Drums</h2>\n<p>Improving accuracy, UI design, and accommodating more drum sounds.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ios\">ios</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag\">iwatch</span></li></ul>\n</div>\n</div>", [""]], ["Hypermazed", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Hypermazed – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/274/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>A few months ago I came across my first image of a hypercube maze. I was already quite fascinated with many hyper cube mazes -- however this particular image had caught my attention. It wasn't long before I had already started to wonder how to procedurally generate something like a modified hyper cube maze. </p>\n<p>I came to this hackathon without much of an idea, but I remember how I wanted to try my hand at implementing a game around mazes, and so -- here we are =)</p>\n<h2>What it does</h2>\n<p>It's an impromptu local multiplayer game with a casual twist -- procedurally generated \"mazes\".</p>\n<h2>How I built it</h2>\n<p>This was built with Unity3D, GLSL and C#. </p>\n<h2>Challenges I ran into</h2>\n<p>We ran into a few VCS issues and a accodemts kist eatomg wotj a frome</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>We were able to create a successful MVP of a game idea in 36 hours and polish it to the point where it has a distinct style and personality </p>\n<h2>What I learned</h2>\n<p>We learned quite a bit about procedural generation as well as the design aspects surrounded along with creating a procedurally generated game. </p>\n<h2>What's next for Hypermazed</h2>\n<p>We would love to build Hypermaze for scale as an online web-game on it's own domain or partnered with a provider.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--2\">c#</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/glsl\">glsl</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/amiruqdah/HackSC15/tree/master\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/amiruqdah/HackSC15/tree/master\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["Sloshed!", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Sloshed! – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/196/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Sloshed! – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/197/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Sloshed! – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/198/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Sloshed! – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/199/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Sloshed! – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/226/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Every two minutes, someone in the US is injured in a drunk driving accident.  In fact, 2/3 of Americans will be involved in a drunk driving accident during our lifetimes.  We wanted to build an app to help young people learn to drink smart, and have a great time while doing it!</p>\n<h2>What it does</h2>\n<p>Sloshed! helps people keep track of how many drinks they've had, helping raise awareness of how the body metabolizes alcohol, and hopefully leading people to make responsible choices.</p>\n<h2>How I built it</h2>\n<p>This was our team's first experience with iOS development.  We're very grateful for the support we've gotten from our peers and the leaders at Apple, whose team members have helped us every step of the way. </p>\n<h2>Challenges I ran into</h2>\n<p>iOS itself presented the greatest challenge; learning a new language, a new IDE, new programming paradigms, and making new friends over the course of a (sleepless) weekend has been a great learning experience with a lot of hard work along the way.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Handling the algorithms necessary to provide relatively accurate estimates of blood alcohol concentration while learning iOS development has been incredibly challenging, and rewarding for our team. Our greatest pride, however, will come from knowing that our technology, effort, and passion can come together to help people make safer choices around alcohol.</p>\n<h2>What I learned</h2>\n<p>We've learned more than we could imagine, from iOS development to the ins and outs of alcohol's metabolism, and continue to learn more every day!</p>\n<h2>What's next for Sloshed!</h2>\n<p>We'd like to expand Sloshed! to help friends stay in touch when they've been drinking.  Friends are the most important line of defense in the dangerous situations that alcohol can impose, so going social is a natural next step for Sloshed!. We would also like to increase our accuracy by designing hardware to pair with the app.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xcode\">xcode</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ios\">ios</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/photoshop\">photoshop</a></span></li></ul>\n</div>\n</div>", ["", ""]], ["HackSChedule", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/-cqlEOR_kGQ?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"HackSChedule – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/451/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"HackSChedule – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/452/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration...</h2>\n<p>Registering for classes at USC is currently a grueling, inefficient process. After spending countless hours rummaging through a mess of RateMyProfessor, Calendar View, Coursebin, and scheduling advisement, you end up with an ugly, sporadic schedule that FINALY fits the bare requirements for the upcoming semester. USC itself recognized this issue last year, and hosted a competition to ameliorate the scheduling mess. However, its product runs into the same core issues, albeit with bigger buttons and a prettier schedule display. Many students, including myself, still use the old platform because the improvements are minor and actually make certain features harder to use. It’s time for real change.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/azure\">azure</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/mysql\">mysql</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/ninjiangstar/HackSChedule\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/ninjiangstar/HackSChedule\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["Escape the Troll on the Rainbow!", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/yGqmlhrGatQ?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"Escape the Troll on the Rainbow! – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/145/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Escape the Troll on the Rainbow! – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/146/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Escape the Troll on the Rainbow! – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/147/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Escape the Troll on the Rainbow! – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/148/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>We wanted to create an immersive that uses VR technology. We are unable to get our hands on the Oculus Rift, so we used the Myo to create a \"Temple Run\"-esque game using Hand Gestures. Using the Unity Game Engine and our wild imagination, we created a Runner Game featuring Rainbow Horses, Trolls, and Demon Kittens.</p>\n<h2>What it does</h2>\n<p>The game uses the Myo wrist capturing controller or your Arrow Keys to move you around rocks, while trying to run from a nasty Earthborn Troll. You use the space button or a Hand-Open gesture to shoot fireballs at the demonic kittens.</p>\n<h2>How I built it</h2>\n<p>We built this game using the Unity 3D Game Engine in C#</p>\n<h2>Challenges I ran into</h2>\n<p>We had issues with getting the Myo to work with Unity. In addition, the Myo also did not have the best gesture recognition so it was hard to make the game work with the Myo.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<ul>\n<li>A working 3D Unity Game</li>\n<li>Psychedelic crazy features</li>\n<li>Epic music</li>\n</ul>\n<h2>What I learned</h2>\n<ul>\n<li>We learned how to make an awesome 3D Unity game</li>\n<li>Using the Myo Controller</li>\n<li>The Biology of an Earthborn Troll</li>\n</ul>\n<h2>What's next for Escape the Troll on the Rainbow</h2>\n<p>Escape the Troll on the Rainbow 2: The Troll Returns...\nand better collision optimization.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/unity\">unity</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/myo\">myo</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/c--2\">c#</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/caioteixeira/Escape-Troll-In-The-Rainbow\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/caioteixeira/Escape-Troll-In-The-Rainbow\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on game design, level design, coded the level controller, the projectiles and other scripts.", "I worked on Game design, various scripts, audio support and myo hardware integration.", "I worked on game design, the GameManager script, Myo Integration and UI. "]], ["SMSmo", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"SMSmo – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/088/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>We wanted to be able to use payments without data or a smartphone</p>\n<h2>What it does</h2>\n<p>Uses the Venmo API to make payments with text messages</p>\n<h2>How we built it</h2>\n<p>Twilio API, Venmo API, Node</p>\n<h2>What's next for SMSmo</h2>\n<p>Making it more user friendly!</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/node-js\">node.js</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/venmo\">venmo</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/twilio\">twilio</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://smsmo.meteor.com\" rel=\"nofollow\" target=\"_blank\" title=\"http://smsmo.meteor.com\">\n<i class=\"ss-icon ss-link\"></i>\n<span>smsmo.meteor.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["Voices", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>With the growth of applications like meerkat and periscope in the video streaming space, we thought the audio streaming space was something which we could venture upon. We wished to come up with an app that was spontaneous and had the capability to go viral. </p>\n<h2>What it does</h2>\n<p>Imagine you are going around USC you see the band tailgating the football team and you like what they are playing. You just take out your mobile phone, open voices and cast this audio byte. Voices limits audio bytes to unto 90 seconds. When you cast out your audio byte, you will have to choose a radius upto which this byte is to be cast to. We know the exact coordinates of where this stream was recorded. The user can optionally add a 50 character text message to describe what the audio byte is about (eg) #USC #Tailgate #USCvUCLA. \nOnce you cast this audio byte into the platform there is no talking it back, it's for everyone to listen to.</p>\n<p>When I login to the web-application or mobile application I will be able to see the streams around me on a map. The streams are marked by colors from dark red to red based on their popularity. Hovering on these streams would given me meta information about byte. Clicking on it would play the byte. I will be able to 'like' the byte or 'comment' on it as well.</p>\n<h2>How I built it</h2>\n<p>These audio bytes are subjected to a temperature metric. Bytes created by popular users will be 'hotter'. We assign an absolute value of hotness to the byte once it's created. As more users start listening to it, liking it or commenting on it we increase the temperature of the stream by linear amounts. If a stream remains inactive for a long time their temperatures start to drop exponentially over time. With inspiration from 'exponential-decay' of radio-active elements and applying to this problem we came up with an efficient metric to gauge the effective popularity of bytes.\nWe set a lower bound threshold on the hotness when we query bytes. We used simple mysql spatial queries to fetch bytes around a location with their specified radius.</p>\n<p>We built a RAILS API server on top of a MYSQL database. The API server provides well defined HTTP api calls for login, byte creation, listing bytes around a location in a paginated fashion, to comment on streams, like streams (etc). The web / mobile apps interact with this API server based on these defined APIs and interface with the user. The web application was a front end SPA with angular-js. We were also working on android and IOS applications.</p>\n<h2>Challenges I ran into</h2>\n<p>We set out to build an API backend, a web-app, an android app and an IOS app. We failed miserably in managing our time. I think we over-engineered the product and started thinking outside the confines of presenting this product at the end of the a hackathon which caused us a lot of time. (eg) I like to TDD, so I spent a lot of time writing tests for the API backend code. We were only able to build a functional API server. All the other three of our front ends are a work in progress. </p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>I believe that this is a great idea. If engineered to scale and built with a nice funky feel to it, I believe this app can go viral.</p>\n<h2>What I learned</h2>\n<p>I personally gained a lot of experience from this project as a leader. Right from convincing my team mates that this is an Idea worth investing their time in, to defusing conflicts, taking calls on feasibility. </p>\n<h2>What's next for Voices</h2>\n<p>This is just the beginning. Over the next one month we are hoping to spend time on this and engineer it right and build it to scale. We are looking to do a soft launch around USC.</p>\n<p>As a longterm vision, I see a lot of scope for Voices in terms of a tool to gauge the sentiment of people around a specific region on various topics. I believe this has tremendous value much more than a service like twitter because we get much more insight from audio data. With the learning technologies available at hand and with considerable data this platform will help gauge sentiments of people much more accurately.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ruby-on-rails\">ruby-on-rails</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/android\">android</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ios\">ios</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/nithinkrishna/voices-api\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/nithinkrishna/voices-api\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"https://github.com/nithinkrishna/voices-android\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/nithinkrishna/voices-android\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"https://github.com/nithinkrishna/voices-web-app\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/nithinkrishna/voices-web-app\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", ""]], ["ALRM-Kill", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"ALRM-Kill – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/012/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"ALRM-Kill – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/011/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"ALRM-Kill – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/013/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"ALRM-Kill – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/010/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>We've all had a roommate who <strong>always</strong> sets an alarm that goes off in the earliest hours of the morning, which pulls you out of your deepest slumber, leaving you wide awake while he/she continues to sleep through it. You are stuck in limbo where you don't really want to get out of bed and walk across the room to wake your roommate or kill their alarm (and hopefully not the roommate!) and you just want it to stop! What if you could just tap a button on your phone to kill their alarm and go back to sleep?</p>\n<h2>What it does</h2>\n<p>This alarm clock app has an added feature to turn off the alarm on a neighboring device via bluetooth with just the tap of a button</p>\n<h2>How I built it</h2>\n<p>We built it using objective-C. It mainly has two core features</p>\n<ol>\n<li>Function as an alarm clock.</li>\n<li>Turn off the alarm (via bluetooth) on another device that uses this app.</li>\n</ol>\n<p>We referred documentation and sample codes on developer.apple.com to implement bluetooth communication, creating timer objects and handling gestures. </p>\n<h2>Challenges I ran into</h2>\n<p>The main challenge was figuring out how we can use bluetooth to serve our communication purpose and also figuring out circular motion gestures that allows the user to scroll to set the alarm time.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>We kept it simple and minimalistic and were able to get the core intended features working. The gesture control to set the alarm time is really cool.</p>\n<h2>What I learned</h2>\n<p>Learnt swift and objective-C and how to use APIs to communicate via bluetooth and gesture control.</p>\n<h2>What's next for ALRM-Kill</h2>\n<ol>\n<li>Ensure that a roommate cannot kill an alarm until a minimum of 'N'-snooze cycles (pre-defined by user).</li>\n<li>Change the alarm to just vibrate mode by turning off the sound.</li>\n<li>Change to vibrate only on the apple watch.</li>\n<li>Option to either kill the alarm or send a different pre-recorded alarm tone (Maybe a rude voice-recording that the user had saved for his/her roommate).</li>\n</ol>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/objective-c\">objective-c</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/latera1n/ALRM-Kill\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/latera1n/ALRM-Kill\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I participated in combining the \"Swirl\" UIgesture and clock, which let users to \"swirl\" to set the alarm. ", "I worked on shaping and sculpting my idea for this app.Created the design of the application and researched the APIs to be used to implement the necessary features. Worked on the UI/UX with the gestures for swirl/circular motion to set the alarm time. Worked on using bluetooth message broadcasting and receiving between devices to trigger actions and using Notification center. Worked on the frontend visual design of the app and also the logo.", "I worked on the integration of two main parts of the app, which are the development of user interface of the alarm clock and background logics. The front-end of this app includes a round clock face that can read user gestures and two labels that can display current and countdown time accordingly. The back-end developments are the logic of the timer, gesture recognition, and UI controllers. Also I embedded the bluetooth communication sample codes from Apple developer website to enable peer-to-peer communication between two devices. The final app is responsive, smooth and user-friendly.", ""]], ["Squad", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Squad – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/882/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Squad – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/886/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>We wanted to cure loneliness through sports. It's easy to feel disconnected at a large school and we wanted to find a way to connect people. It is also a well known fact that Freshmen tend to gain a significant amount of weight during their first quarter. We decided to solve both problems, making it easy to find people you connect with while helping you stay in shape.</p>\n<h2>What it does</h2>\n<p>Users can find people around them to play sports and do activities with.</p>\n<h2>How I built it</h2>\n<p>We used swift for the iOS development and Microsoft Azure for the back end.</p>\n<h2>Challenges I ran into</h2>\n<p>Learning to make the app was a challenge since this was our first time developing for iOS.\nWe ran into some problems with github since we weren't sure what to .gitignore at first.</p>\n<h2>What I learned</h2>\n<p>We learnt basic mobile development in iOS and how to use Azure as a mobile back end.</p>\n<h2>What's next for Squad</h2>\n<p>We plan to redo the app when we get more iOS experience</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/azure\">azure</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/facebook\">facebook</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/akumar97/Squad\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/akumar97/Squad\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"http://akumar97.github.io/Squad/\" rel=\"nofollow\" target=\"_blank\" title=\"http://akumar97.github.io/Squad/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>akumar97.github.io</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Worked on the backend, connected app to Azure database.", "", "", ""]], ["Text Tommy", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>What it does</h2>\n<p>Text Tommy is an invisible app* built around an \"expertise at your fingertips\" service model. Somewhere in-between freelancing and specialized service. Get whatever you need on demand with just one text message!</p>\n<p>*Invisible apps are apps without an interface. </p>\n<h2>How we built it</h2>\n<p>Built the front-end on vanilla HTML/CSS and used jQuery to take user-input (their phone number) and send it to the backend PHP scripts. PHP scripts utilized the Twilio API to convert phone numbers into HTTP signals, which could be manipulated server-side.</p>\n<h2>Challenges I ran into</h2>\n<p>Learning how to use PHP and set up servers. Figuring out how to put everything together (PHP, jQuery, HTML/CSS, Twilio API).</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Overcoming the above challenges.</p>\n<h2>What we earned</h2>\n<p>How to code in jQuery and PHP, and how to set up a server on Digital Ocean and navigate it in Unix. Most importantly, how to build front-end WITH backend!</p>\n<h2>What's next for Text Tommy</h2>\n<p>Make money! First we need to set up an email and PayPal account. We also need to recruit a network of Trojans to work for Text Tommy. </p>\n<h2>Disclaimer</h2>\n<p>I love my teammates, Jenny I'm sorry for accidentally spitting rice on you when I laughed.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html5\">html5</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css3\">css3</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/jquery\">jquery</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/php\">php</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/twilio\">twilio</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://texttommy.xyz\" rel=\"nofollow\" target=\"_blank\" title=\"http://texttommy.xyz\">\n<i class=\"ss-icon ss-link\"></i>\n<span>texttommy.xyz</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["Built the initial front-end structure and idea. Built the backend and connection to Twilio.", "", ""]], ["wisebite", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"wisebite – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/321/922/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h1>wisebite</h1>\n<h2>What we did?</h2>\n<p>An apple watch application that helps you find out the nutrient information of your meal. </p>\n<p>Also acts as a shopping assistant by listing products and their nutritional values. </p>\n<h2>What makes it special?</h2>\n<p>Easy to use interface. Just say \"what you want to know about your meal\" and we'll find it out for you.</p>\n<p>Minimum clicks and swipes</p>\n<h2>How we did it?</h2>\n<p>Convert what you say to text. (speech to text translation)</p>\n<p>Extract food products from the text (sentence parsing)</p>\n<p>Do our magic and get you the nutrition report (public APIs)</p>\n<p>Suggest similar products for you to buy </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/html\">html</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/css\">css</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/akhilram/wisebite\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/akhilram/wisebite\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["", "", ""]], ["Recommending Emotionally Pleasant Navigation Routes", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h2>Inspiration</h2>\n<p>The idea of this project is to suggest an emotionally pleasant alternative route to the users of mapping services. By emotionally pleasant, I mean routes that are more scenic, quieter or have some kind of interesting attractions for users like restaurants, tourist places, etc. The current mapping services do not provide this feature. It can be very useful when planning tours.</p>\n<h2>What it does</h2>\n<p>The project suggests alternative pleasant routes in New York City that would be only reasonably longer than the most optimal routes. For this, we use the opinions/emotions left behind by people about the different places on social networking platforms like Foursquare. When visiting a place, people have a tendency to share their experience or leave behind a review about the place on Foursquare. As this social networking site allows geo-tagging, we can use this data to know the general sentiment of the people about the place. This sentiment score can then be used in identifying pleasant routes to a destination.</p>\n<h2>How I built it</h2>\n<p>My approach to this problem can be summarized into three main steps:</p>\n<ol>\n<li><p>Create a graph with nodes as the places on the map. Geographically neighboring places are connected by an edge in the graph. The edges represent the geographical distance between the places. For this project I considered New York City.</p></li>\n<li><p>Then extract posts from Twitter and Foursquare with places tagged in them. Using Sentiment Analysis, we get the opinion of people about the place. Then update the graph we created in step 1 with the sentiment score. We do this for all the places/nodes in our graph. Finally we have a graph with each node having a corresponding sentiment score.</p></li>\n<li><p>Now, when a user enters his destination, we find the route to the destination using the graph that we created. For this, we use the path finding algorithms. We find the different routes, each having two scores assigned to them­-Distance and Sentiment. We then find the best possible route, one that is not too long than the shortest one, but has more positive sentiment to it, signifying more emotional pleasantness.</p></li>\n</ol>\n<h2>Challenges I ran into</h2>\n<p>Dividing the city of New York in blocks of 1km square are geographically required use of latitudes and longitudes. Understanding the Foursquare API was tough at start. Also, path finding algorithms like Yen's K shortest paths algorithm and Dijkstra's algorithm was a challenge to implement, especially because the graph size was huge.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Successfully leveraged the vast potential of the data on social networking sites to improve the mapping features. Sentiment Analysis of this data provides valuable insights about different places in a city, which I have used to find an emotionally pleasant route. This feature in a mapping service is bound to make our trips a lot more exciting!</p>\n<h2>What I learned</h2>\n<p>Using Foursquare API. Also, several Graph Algorithms like Yen's Algorithm.</p>\n<h2>What's next for Route to Happiness</h2>\n<ol>\n<li>Adding this feature to the mapping services like Google Maps, Apple Maps</li>\n<li>Using the data from other social networking sites like Twitter, Flicker etc.</li>\n</ol>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag\">stanford-nlp</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/foursquare\">foursquare</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/ajinkya13/Route-to-Happiness\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/ajinkya13/Route-to-Happiness\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n<li><a href=\"https://prezi.com/xavgtdzex8np/route-to-happiness/\" rel=\"nofollow\" target=\"_blank\" title=\"https://prezi.com/xavgtdzex8np/route-to-happiness/\">\n<i class=\"ss-icon ss-link\"></i>\n<span>prezi.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", [""]], ["Charlie", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\">\n<li class=\"text-center\">\n<img alt=\"Charlie – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/323/044/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<p>I am Charlie.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/javascript\">javascript</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/python\">python</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/nuance\">nuance</a></span></li><li><span class=\"cp-tag\">speechkit</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/scikit-learn\">scikit-learn</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ios\">ios</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/iphone-sdk\">iphone-sdk</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xcode\">xcode</a></span></li><li><span class=\"cp-tag\">vi</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/git\">git</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/machine-learning\">machine-learning</a></span></li><li><span class=\"cp-tag\">ai</span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/ingochris/Charlie\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/ingochris/Charlie\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on the front end of the project. It was my first project, so it was a bit intimidating and a learning process. I used Swift and Xcode to build the app. ", "", ""]], ["Fastype: Play for humanity", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Fastype: Play for humanity – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/149/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Fastype: Play for humanity – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/107/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Fastype: Play for humanity – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/186/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Fastype: Play for humanity – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/238/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Fastype: Play for humanity – screenshot 5\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/237/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Fastype: Play for humanity – screenshot 6\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/236/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Fastype: Play for humanity – screenshot 7\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/234/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Fastype: Play for humanity – screenshot 8\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/235/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Fastype: Play for humanity – screenshot 9\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/233/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>We came with a simple idea of developing a <strong>typing game</strong> that scores user based on how fast they type a given text. After some thinking of what can we do with that data, we figured an interesting solution to a serious problem. Apply the data to solve the problems of <strong>screen readers</strong> that <strong>visually impaired</strong> people use.</p>\n<h2>What it does</h2>\n<p>There are two parts to the project:</p>\n<ol>\n<li>We present the users with a game that scores them based on their accuracy of typing. The players get a score, the time they took and the mistakes they made. The sentences contain markers around the words that have emphasis. After playing for a while, the player gets accustomed and learns where to place markers. Then we start providing plain sentences and users add emphasis markers.</li>\n<li>We use this data to build a machine learning model. To create the initial model, we give the players pre-marked sentences to mark. Using their markings, we generate a model to build their profile. For eg players marking plain sentences correctly will receive much higher XP as compared what they would get playing just the typing game. These profiles will be used to predict which is the correctly emphasized sentence. The correct sentence will be provided to a text to speech service that understands the emphasis markers and produce a prosodically pleasing speech.\nThe screen reader service is hosted on Azure Cloud. It takes the .wav files and the correctly emphasised sentence and sends the .wav file as the output of TTS.</li>\n</ol>\n<h2>How I built it</h2>\n<p>The mobile app is developed for iOS using XCode and Swift. \nThe initial, unmarked sentences provided to the players are manually marked to generate a classification model using perceptron. Now the players are provided with completely unknown sentences and using the model we classify the marked sentences into correct or incorrect.\nThe correct sentences are provided to a TTS service that analyzes the emphasis marks and generates a .wav file which is later used on the online screen reader.</p>\n<h2>Challenges I ran into</h2>\n<p>iOS development was really new to our teammates. Getting a good TTS service that incorporates prosody was challenging, Microsoft mentor Tim really helped with this.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>Finishing a working model of the product, integrating various services</p>\n<h2>What I learned</h2>\n<p>Technical skills: iOS, Azure Web deployment.\nPlanning really helps as does taking breaks.</p>\n<h2>What's next for Fastype: Play for humanity</h2>\n<p>Improve the machine learning model, get more data, introduce new levels in the game, make it multiplayer, possibility of monetization by providing the audio to various audio books developers</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/xcode\">xcode</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/azure\">azure</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/net\">.net</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/windows-10\">windows-10</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/ios\">ios</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/visual-studio\">visual-studio</a></span></li></ul>\n</div>\n</div>", ["", "", ""]], ["Password Saver", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div>\n<h1>Voice Recognision project</h1>\n<h2>Members of the Research Group:</h2>\n<p><strong>Member #1:</strong> Oceane Bel</p>\n<p><strong>Member #2:</strong> Kenneth Chang</p>\n<p>BEFORE YOU RUN ANYTHING! Please pull out the FastFourierTransformExemple directory OUT OF THIS DIRECTORY. Place it wherever you want. THEN open it with Android Studio by creating a new project. </p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/Oceane/voiceRecognision\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/Oceane/voiceRecognision\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked on the GUI and the UX design with Oceane.", "I have worked on the algorithm and the UX design. I also implemented the database that will be modified to become more user friendly in the future."]], ["Mouse Chase", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li class=\"text-center\">\n<img alt=\"Mouse Chase – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/321/846/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Mouse Chase – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/321/847/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Mouse Chase – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/321/849/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>Our team wanted to make a fun java game for our first hackathon.</p>\n<h2>What it does</h2>\n<p>Mouse Chase is a game where you get to be a mouse and eat all the cheese you can... you just have to avoid being eaten by the cat!</p>\n<h2>How I built it</h2>\n<p>We built it using Java on Eclipse.</p>\n<h2>Challenges I ran into</h2>\n<p>The challenge was uploading it to a webpage and just debugging the code in general.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>We are proud of the working tunnel feature in the game, and we like the leaderboard feature that we included to keep track of high scores.</p>\n<h2>What I learned</h2>\n<p>Throughout the process, we learned a lot about Microsoft Azure.</p>\n<h2>What's next for Mouse Chase</h2>\n<p>Maybe Mouse Chase could eventually be a mobile app too.</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/java\">java</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/azure\">azure</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/onedrive\">onedrive</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/photoshop\">photoshop</a></span></li><li><span class=\"cp-tag\">indesign</span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/eclipse\">eclipse</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/adobe-illustrator\">adobe-illustrator</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/github\">github</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/bootstrap\">bootstrap</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"http://mousechase.azurewebsites.net\" rel=\"nofollow\" target=\"_blank\" title=\"http://mousechase.azurewebsites.net\">\n<i class=\"ss-icon ss-link\"></i>\n<span>mousechase.azurewebsites.net</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I worked mostly on the gameplay and the GUI. I also created the leaderboard.", "I worked a lot on the Java programming for the game. I implemented the tunnel feature and most of the actions for the game. I also wrote the html for the Mouse Chase webpage.", "", ""]], ["Trump", "<div class=\"large-9 columns\" id=\"app-details-left\">\n<div id=\"gallery\">\n<ul class=\"no-bullet\" data-options=\"animation_speed:0;slide_number:false;timer:false\" data-orbit=\"true\">\n<li>\n<div class=\"flex-video\">\n<iframe allowfullscreen=\"allowfullscreen\" allowscriptaccess=\"always\" class=\"video-embed\" frameborder=\"0\" height=\"375\" mode=\"transparent\" src=\"https://www.youtube.com/embed/DfXYcBtQZpE?enablejsapi=1&amp;hl=en_US&amp;rel=0&amp;version=3&amp;wmode=transparent\" type=\"text/html\" webkitallowfullscreen=\"true\" width=\"615\" wmode=\"transparent\"></iframe>\n</div>\n</li>\n<li class=\"text-center\">\n<img alt=\"Trump – screenshot 1\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/321/827/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Trump – screenshot 2\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/321/826/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Trump – screenshot 3\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/517/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li> <li class=\"text-center\">\n<img alt=\"Trump – screenshot 4\" class=\"software_photo_image image-replacement\" src=\"//challengepost-s3-challengepost.netdna-ssl.com/photos/production/software_photos/000/322/518/datas/gallery.jpg\"/>\n<p>\n<i></i>\n</p>\n</li>\n</ul> </div>\n<div>\n<h2>Inspiration</h2>\n<p>On the brink of sleep, a single idea surfaced in my mind. Trump. Trump. Trump...\nThe world needs to be able to appreciate his hair!</p>\n<h2>What it does</h2>\n<p>Users brush Trump's hair to earn points, which work towards checkpoints. At checkpoints, Trump succeeds at a point in his political campaign. User's also are given the option to send a tweet to Mr. Trump after completing a checkpoint.</p>\n<h2>How I built it</h2>\n<p>I built it using Swift, Xcode, and SpriteKit.</p>\n<h2>Challenges I ran into</h2>\n<p>iPhones aren't really powerful enough to simulate hair (at least the way I was rendering it). It took a lot of time and effort to optimize this so that it runs semi-smoothly.</p>\n<h2>Accomplishments that I'm proud of</h2>\n<p>It's Trump! What more can I say.</p>\n<h2>What I learned</h2>\n<p>I learned how to better use SpriteKit, and I learned a lot more about the Swift Language.</p>\n<h2>What's next for Trump</h2>\n<p>The Oval Office, 2016! :p</p>\n</div>\n<div class=\"\" id=\"built-with\">\n<h2>Built With</h2>\n<ul class=\"no-bullet inline-list\"><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/swift\">swift</a></span></li><li><span class=\"cp-tag recognized-tag\"><a href=\"https://devpost.com/software/built-with/sprite-kit\">sprite-kit</a></span></li></ul>\n</div>\n<nav class=\"app-links section\">\n<h2>Try it out</h2>\n<ul class=\"no-bullet\" data-role=\"software-urls\">\n<li><a href=\"https://github.com/ColeHud/Trump\" rel=\"nofollow\" target=\"_blank\" title=\"https://github.com/ColeHud/Trump\">\n<i class=\"ss-icon ss-link\"></i>\n<span>github.com</span>\n</a></li>\n</ul>\n</nav>\n</div>", ["I did pretty much everything. Design, Coding, Ideation, etc."]]]